{"definitions": [{"wordtype": "Adjective", "description": "Withdraw; separate."}, {"wordtype": "Adjective", "description": "Considered apart from any application to a particular object; separated from matter; existing in the mind only; as, abstract truth, abstract numbers.  Hence: ideal; abstruse; difficult."}, {"wordtype": "Adjective", "description": "Expressing a particular property of an object viewed apart from the other properties which constitute it; -- opposed to concrete; as, honesty is an abstract word."}, {"wordtype": "Adjective", "description": "Resulting from the mental faculty of abstraction; general as opposed to particular; as, \"reptile\" is an abstract or general name."}, {"wordtype": "Adjective", "description": "Abstracted; absent in mind."}, {"wordtype": "Adjective", "description": "To withdraw; to separate; to take away."}, {"wordtype": "Adjective", "description": "To draw off in respect to interest or attention; as, his was wholly abstracted by other objects."}, {"wordtype": "Adjective", "description": "To separate, as ideas, by the operation of the mind; to consider by itself; to contemplate separately, as a quality or attribute."}, {"wordtype": "Adjective", "description": "To epitomize; to abridge."}, {"wordtype": "Adjective", "description": "To take secretly or dishonestly; to purloin; as, to abstract goods from a parcel, or money from a till."}, {"wordtype": "Adjective", "description": "To separate, as the more volatile or soluble parts of a substance, by distillation or other chemical processes. In this sense extract is now more generally used."}, {"wordtype": "Transitive Verb", "description": "To perform the process of abstraction."}, {"wordtype": "Adjective", "description": "That which comprises or concentrates in itself the essential qualities of a larger thing or of several things. Specifically: A summary or an epitome, as of a treatise or book, or of a statement; a brief."}, {"wordtype": "Adjective", "description": "A state of separation from other things; as, to consider a subject in the abstract, or apart from other associated things."}, {"wordtype": "Adjective", "description": "An abstract term."}, {"wordtype": "Adjective", "description": "A powdered solid extract of a vegetable substance mixed with sugar of milk in such proportion that one part of the abstract represents two parts of the original substance."}]}