{"definitions": [{"wordtype": "Noun", "description": "A superior force of voice or of articulative effort upon some particular syllable of a word or a phrase, distinguishing it from the others."}, {"wordtype": "Noun", "description": "A mark or character used in writing, and serving to regulate the pronunciation; esp.: (a) a mark to indicate the nature and place of the spoken accent; (b) a mark to indicate the quality of sound of the vowel marked; as, the French accents."}, {"wordtype": "Noun", "description": "Modulation of the voice in speaking; manner of speaking or pronouncing; peculiar or characteristic modification of the voice; tone; as, a foreign accent; a French or a German accent."}, {"wordtype": "Noun", "description": "A word; a significant tone"}, {"wordtype": "Noun", "description": "expressions in general; speech."}, {"wordtype": "Noun", "description": "Stress laid on certain syllables of a verse."}, {"wordtype": "Noun", "description": "A regularly recurring stress upon the tone to mark the beginning, and, more feebly, the third part of the measure."}, {"wordtype": "Noun", "description": "A special emphasis of a tone, even in the weaker part of the measure."}, {"wordtype": "Noun", "description": "The rhythmical accent, which marks phrases and sections of a period."}, {"wordtype": "Noun", "description": "The expressive emphasis and shading of a passage."}, {"wordtype": "Noun", "description": "A mark placed at the right hand of a letter, and a little above it, to distinguish magnitudes of a similar kind expressed by the same letter, but differing in value, as y', y''."}, {"wordtype": "Noun", "description": "A mark at the right hand of a number, indicating minutes of a degree, seconds, etc.; as, 12'27'', i. e., twelve minutes twenty seven seconds."}, {"wordtype": "Noun", "description": "A mark used to denote feet and inches; as, 6' 10'' is six feet ten inches."}, {"wordtype": "Transitive Verb", "description": "To express the accent of (either by the voice or by a mark); to utter or to mark with accent."}, {"wordtype": "Transitive Verb", "description": "To mark emphatically; to emphasize."}]}