{"definitions": [{"wordtype": "Verb", "description": "To aim; to direct."}, {"wordtype": "Verb", "description": "To prepare or make ready."}, {"wordtype": "Verb", "description": "Reflexively: To prepare one's self; to apply one's skill or energies (to some object); to betake."}, {"wordtype": "Verb", "description": "To clothe or array; to dress."}, {"wordtype": "Verb", "description": "To direct, as words (to any one or any thing); to make, as a speech, petition, etc. (to any one, an audience)."}, {"wordtype": "Verb", "description": "To direct speech to; to make a communication to, whether spoken or written; to apply to by words, as by a speech, petition, etc., to speak to; to accost."}, {"wordtype": "Verb", "description": "To direct in writing, as a letter; to superscribe, or to direct and transmit; as, he addressed a letter."}, {"wordtype": "Verb", "description": "To make suit to as a lover; to court; to woo."}, {"wordtype": "Verb", "description": "To consign or intrust to the care of another, as agent or factor; as, the ship was addressed to a merchant in Baltimore."}, {"wordtype": "Verb Intransitive", "description": "To prepare one's self."}, {"wordtype": "Verb Intransitive", "description": "To direct speech."}, {"wordtype": "Transitive Verb", "description": "Act of preparing one's self."}, {"wordtype": "Transitive Verb", "description": "Act of addressing one's self to a person; verbal application."}, {"wordtype": "Transitive Verb", "description": "A formal communication, either written or spoken; a discourse; a speech; a formal application to any one; a petition; a formal statement on some subject or special occasion; as, an address of thanks, an address to the voters."}, {"wordtype": "Transitive Verb", "description": "Direction or superscription of a letter, or the name, title, and place of residence of the person addressed."}, {"wordtype": "Transitive Verb", "description": "Manner of speaking to another; delivery; as, a man of pleasing or insinuating address."}, {"wordtype": "Transitive Verb", "description": "Attention in the way one's addresses to a lady."}, {"wordtype": "Transitive Verb", "description": "Skill; skillful management; dexterity; adroitness."}]}