{"definitions": ["To bring forward; to move towards the van or front; to make to go on.", "To raise; to elevate.", "To raise to a higher rank; to promote.", "To accelerate the growth or progress; to further; to forward; to help on; to aid; to heighten; as, to advance the ripening of fruit; to advance one's interests.", "To bring to view or notice; to offer or propose; to show; as, to advance an argument.", "To make earlier, as an event or date; to hasten.", "To furnish, as money or other value, before it becomes due, or in aid of an enterprise; to supply beforehand; as, a merchant advances money on a contract or on goods consigned to him.", "To raise to a higher point; to enhance; to raise in rate; as, to advance the price of goods.", "To extol; to laud.", "To move or go forward; to proceed; as, he advanced to greet me.", "To increase or make progress in any respect; as, to advance in knowledge, in stature, in years, in price.", "To rise in rank, office, or consequence; to be preferred or promoted.", "The act of advancing or moving forward or upward; progress.", "Improvement or progression, physically, mentally, morally, or socially; as, an advance in health, knowledge, or religion; an advance in rank or office.", "An addition to the price; rise in price or value; as, an advance on the prime cost of goods.", "The first step towards the attainment of a result; approach made to gain favor, to form an acquaintance, to adjust a difference, etc.; an overture; a tender; an offer; -- usually in the plural.", "A furnishing of something before an equivalent is received (as money or goods), towards a capital or stock, or on loan; payment beforehand; the money or goods thus furnished; money or value supplied beforehand.", "Before in place, or beforehand in time; -- used for advanced; as, an advance guard, or that before the main guard or body of an army; advance payment, or that made before it is due; advance proofs, advance sheets, pages of a forthcoming volume, received in advance of the time of publication."]}