{"definitions": [{"wordtype": "Noun", "description": "The fluid which we breathe, and which surrounds the earth; the atmosphere. It is invisible, inodorous, insipid, transparent, compressible, elastic, and ponderable."}, {"wordtype": "Noun", "description": "Symbolically: Something unsubstantial, light, or volatile."}, {"wordtype": "Noun", "description": "A particular state of the atmosphere, as respects heat, cold, moisture, etc., or as affecting the sensations; as, a smoky air, a damp air, the morning air, etc."}, {"wordtype": "Noun", "description": "Any aeriform body; a gas; as, oxygen was formerly called vital air."}, {"wordtype": "Noun", "description": "Air in motion; a light breeze; a gentle wind."}, {"wordtype": "Noun", "description": "Odoriferous or contaminated air."}, {"wordtype": "Noun", "description": "That which surrounds and influences."}, {"wordtype": "Noun", "description": "Utterance abroad; publicity; vent."}, {"wordtype": "Noun", "description": "Intelligence; information."}, {"wordtype": "Noun", "description": "A musical idea, or motive, rhythmically developed in consecutive single tones, so as to form a symmetrical and balanced whole, which may be sung by a single voice to the stanzas of a hymn or song, or even to plain prose, or played upon an instrument; a melody; a tune; an aria."}, {"wordtype": "Noun", "description": "In harmonized chorals, psalmody, part songs, etc., the part which bears the tune or melody -- in modern harmony usually the upper part -- is sometimes called the air."}, {"wordtype": "Noun", "description": "The peculiar look, appearance, and bearing of a person; mien; demeanor; as, the air of a youth; a heavy air; a lofty air."}, {"wordtype": "Noun", "description": "Peculiar appearance; apparent character; semblance; manner; style."}, {"wordtype": "Noun", "description": "An artificial or affected manner; show of pride or vanity; haughtiness; as, it is said of a person, he puts on airs."}, {"wordtype": "Noun", "description": "The representation or reproduction of the effect of the atmospheric medium through which every object in nature is viewed."}, {"wordtype": "Noun", "description": "Carriage; attitude; action; movement; as, the head of that portrait has a good air."}, {"wordtype": "Noun", "description": "The artificial motion or carriage of a horse."}, {"wordtype": "Noun", "description": "To expose to the air for the purpose of cooling, refreshing, or purifying; to ventilate; as, to air a room."}, {"wordtype": "Noun", "description": "To expose for the sake of public notice; to display ostentatiously; as, to air one's opinion."}, {"wordtype": "Noun", "description": "To expose to heat, for the purpose of expelling dampness, or of warming; as, to air linen; to air liquors."}]}