{"definitions": [{"wordtype": "Transitive Verb", "description": "To command or request to come or be present; to summon; as, to call a servant."}, {"wordtype": "Transitive Verb", "description": "To summon to the discharge of a particular duty; to designate for an office, or employment, especially of a religious character; -- often used of a divine summons; as, to be called to the ministry; sometimes, to invite; as, to call a minister to be the pastor of a church."}, {"wordtype": "Transitive Verb", "description": "To invite or command to meet; to convoke; -- often with together; as, the President called Congress together; to appoint and summon; as, to call a meeting of the Board of Aldermen."}, {"wordtype": "Transitive Verb", "description": "To give name to; to name; to address, or speak of, by a specifed name."}, {"wordtype": "Transitive Verb", "description": "To regard or characterize as of a certain kind; to denominate; to designate."}, {"wordtype": "Transitive Verb", "description": "To state, or estimate, approximately or loosely; to characterize without strict regard to fact; as, they call the distance ten miles; he called it a full day's work."}, {"wordtype": "Transitive Verb", "description": "To show or disclose the class, character, or nationality of."}, {"wordtype": "Transitive Verb", "description": "To utter in a loud or distinct voice; -- often with off; as, to call, or call off, the items of an account; to call the roll of a military company."}, {"wordtype": "Transitive Verb", "description": "To invoke; to appeal to."}, {"wordtype": "Transitive Verb", "description": "To rouse from sleep; to awaken."}, {"wordtype": "Verb Intransitive", "description": "To speak in loud voice; to cry out; to address by name; -- sometimes with to."}, {"wordtype": "Verb Intransitive", "description": "To make a demand, requirement, or request."}, {"wordtype": "Verb Intransitive", "description": "To make a brief visit; also, to stop at some place designated, as for orders."}, {"wordtype": "Noun", "description": "The act of calling; -- usually with the voice, but often otherwise, as by signs, the sound of some instrument, or by writing; a summons; an entreaty; an invitation; as, a call for help; the bugle's call."}, {"wordtype": "Noun", "description": "A signal, as on a drum, bugle, trumpet, or pipe, to summon soldiers or sailors to duty."}, {"wordtype": "Noun", "description": "An invitation to take charge of or serve a church as its pastor."}, {"wordtype": "Noun", "description": "A requirement or appeal arising from the circumstances of the case; a moral requirement or appeal."}, {"wordtype": "Noun", "description": "A divine vocation or summons."}, {"wordtype": "Noun", "description": "Vocation; employment."}, {"wordtype": "Noun", "description": "A short visit; as, to make a call on a neighbor; also, the daily coming of a tradesman to solicit orders."}, {"wordtype": "Noun", "description": "A note blown on the horn to encourage the hounds."}, {"wordtype": "Noun", "description": "A whistle or pipe, used by the boatswain and his mate, to summon the sailors to duty."}, {"wordtype": "Noun", "description": "The cry of a bird; also a noise or cry in imitation of a bird; or a pipe to call birds by imitating their note or cry."}, {"wordtype": "Noun", "description": "A reference to, or statement of, an object, course, distance, or other matter of description in a survey or grant requiring or calling for a corresponding object, etc., on the land."}, {"wordtype": "Noun", "description": "The privilege to demand the delivery of stock, grain, or any commodity, at a fixed, price, at or within a certain time agreed on."}, {"wordtype": "Noun", "description": "See Assessment, 4."}]}