{"definitions": ["The exterior form or appearance of anything; that part which presents itself to the view; especially, the front or upper part or surface; that which particularly offers itself to the view of a spectator.", "That part of a body, having several sides, which may be seen from one point, or which is presented toward a certain direction; one of the bounding planes of a solid; as, a cube has six faces.", "The principal dressed surface of a plate, disk, or pulley; the principal flat surface of a part or object.", "That part of the acting surface of a cog in a cog wheel, which projects beyond the pitch line.", "The width of a pulley, or the length of a cog from end to end; as, a pulley or cog wheel of ten inches face.", "The upper surface, or the character upon the surface, of a type, plate, etc.", "The style or cut of a type or font of type.", "Outside appearance; surface show; look; external aspect, whether natural, assumed, or acquired.", "That part of the head, esp. of man, in which the eyes, cheeks, nose, and mouth are situated; visage; countenance.", "Cast of features; expression of countenance; look; air; appearance.", "Ten degrees in extent of a sign of the zodiac.", "Maintenance of the countenance free from abashment or confusion; confidence; boldness; shamelessness; effrontery.", "Presence; sight; front; as in the phrases, before the face of, in the immediate presence of; in the face of, before, in, or against the front of; as, to fly in the face of danger; to the face of, directly to; from the face of, from the presence of.", "Mode of regard, whether favorable or unfavorable; favor or anger; mostly in Scriptural phrases.", "The end or wall of the tunnel, drift, or excavation, at which work is progressing or was last done.", "The exact amount expressed on a bill, note, bond, or other mercantile paper, without any addition for interest or reduction for discount.", "To meet in front; to oppose with firmness; to resist, or to meet for the purpose of stopping or opposing; to confront; to encounter; as, to face an enemy in the field of battle.", "To Confront impudently; to bully.", "To stand opposite to; to stand with the face or front toward; to front upon; as, the apartments of the general faced the park.", "To cover in front, for ornament, protection, etc.; to put a facing upon; as, a building faced with marble.", "To line near the edge, esp. with a different material; as, to face the front of a coat, or the bottom of a dress.", "To cover with better, or better appearing, material than the mass consists of, for purpose of deception, as the surface of a box of tea, a barrel of sugar, etc.", "To make the surface of (anything) flat or smooth; to dress the face of (a stone, a casting, etc.); esp., in turning, to shape or smooth the flat surface of, as distinguished from the cylindrical surface.", "To cause to turn or present a face or front, as in a particular direction.", "To carry a false appearance; to play the hypocrite.", "To turn the face; as, to face to the right or left.", "To present a face or front."]}