{"definitions": [{"wordtype": "Adjective", "description": "Free from spots, specks, dirt, or imperfection; unblemished; clean; pure."}, {"wordtype": "Adjective", "description": "Pleasing to the eye; handsome; beautiful."}, {"wordtype": "Adjective", "description": "Without a dark hue; light; clear; as, a fair skin."}, {"wordtype": "Adjective", "description": "Not overcast; cloudless; clear; pleasant; propitious; favorable; -- said of the sky, weather, or wind, etc.; as, a fair sky; a fair day."}, {"wordtype": "Adjective", "description": "Free from obstacles or hindrances; unobstructed; unincumbered; open; direct; -- said of a road, passage, etc.; as, a fair mark; in fair sight; a fair view."}, {"wordtype": "Adjective", "description": "Without sudden change of direction or curvature; smooth; fowing; -- said of the figure of a vessel, and of surfaces, water lines, and other lines."}, {"wordtype": "Adjective", "description": "Characterized by frankness, honesty, impartiality, or candor; open; upright; free from suspicion or bias; equitable; just; -- said of persons, character, or conduct; as, a fair man; fair dealing; a fair statement."}, {"wordtype": "Adjective", "description": "Pleasing; favorable; inspiring hope and confidence; -- said of words, promises, etc."}, {"wordtype": "Adjective", "description": "Distinct; legible; as, fair handwriting."}, {"wordtype": "Adjective", "description": "Free from any marked characteristic; average; middling; as, a fair specimen."}, {"wordtype": "Adverb", "description": "Clearly; openly; frankly; civilly; honestly; favorably; auspiciously; agreeably."}, {"wordtype": "Noun", "description": "Fairness, beauty."}, {"wordtype": "Noun", "description": "A fair woman; a sweetheart."}, {"wordtype": "Noun", "description": "Good fortune; good luck."}, {"wordtype": "Transitive Verb", "description": "To make fair or beautiful."}, {"wordtype": "Transitive Verb", "description": "To make smooth and flowing, as a vessel's lines."}, {"wordtype": "Noun", "description": "A gathering of buyers and sellers, assembled at a particular place with their merchandise at a stated or regular season, or by special appointment, for trade."}, {"wordtype": "Noun", "description": "A festival, and sale of fancy articles. erc., usually for some charitable object; as, a Grand Army fair."}, {"wordtype": "Noun", "description": "A competitive exhibition of wares, farm products, etc., not primarily for purposes of sale; as, the Mechanics' fair; an agricultural fair."}]}