{"definitions": [{"wordtype": "Transitive Verb", "description": "To Descend, either suddenly or gradually; particularly, to descend by the force of gravity; to drop; to sink; as, the apple falls; the tide falls; the mercury falls in the barometer."}, {"wordtype": "Transitive Verb", "description": "To cease to be erect; to take suddenly a recumbent posture; to become prostrate; to drop; as, a child totters and falls; a tree falls; a worshiper falls on his knees."}, {"wordtype": "Transitive Verb", "description": "To find a final outlet; to discharge its waters; to empty; -- with into; as, the river Rhone falls into the Mediterranean."}, {"wordtype": "Transitive Verb", "description": "To become prostrate and dead; to die; especially, to die by violence, as in battle."}, {"wordtype": "Transitive Verb", "description": "To cease to be active or strong; to die away; to lose strength; to subside; to become less intense; as, the wind falls."}, {"wordtype": "Transitive Verb", "description": "To issue forth into life; to be brought forth; -- said of the young of certain animals."}, {"wordtype": "Transitive Verb", "description": "To decline in power, glory, wealth, or importance; to become insignificant; to lose rank or position; to decline in weight, value, price etc.; to become less; as, the falls; stocks fell two points."}, {"wordtype": "Transitive Verb", "description": "To be overthrown or captured; to be destroyed."}, {"wordtype": "Transitive Verb", "description": "To descend in character or reputation; to become degraded; to sink into vice, error, or sin; to depart from the faith; to apostatize; to sin."}, {"wordtype": "Transitive Verb", "description": "To become insnared or embarrassed; to be entrapped; to be worse off than before; asm to fall into error; to fall into difficulties."}, {"wordtype": "Transitive Verb", "description": "To assume a look of shame or disappointment; to become or appear dejected; -- said of the countenance."}, {"wordtype": "Transitive Verb", "description": "To sink; to languish; to become feeble or faint; as, our spirits rise and fall with our fortunes."}, {"wordtype": "Transitive Verb", "description": "To pass somewhat suddenly, and passively, into a new state of body or mind; to become; as, to fall asleep; to fall into a passion; to fall in love; to fall into temptation."}, {"wordtype": "Transitive Verb", "description": "To happen; to to come to pass; to light; to befall; to issue; to terminate."}, {"wordtype": "Transitive Verb", "description": "To come; to occur; to arrive."}, {"wordtype": "Transitive Verb", "description": "To begin with haste, ardor, or vehemence; to rush or hurry; as, they fell to blows."}, {"wordtype": "Transitive Verb", "description": "To pass or be transferred by chance, lot, distribution, inheritance, or otherwise; as, the estate fell to his brother; the kingdom fell into the hands of his rivals."}, {"wordtype": "Transitive Verb", "description": "To belong or appertain."}, {"wordtype": "Transitive Verb", "description": "To be dropped or uttered carelessly; as, an unguarded expression fell from his lips; not a murmur fell from him."}, {"wordtype": "Transitive Verb", "description": "To let fall; to drop."}, {"wordtype": "Transitive Verb", "description": "To sink; to depress; as, to fall the voice."}, {"wordtype": "Transitive Verb", "description": "To diminish; to lessen or lower."}, {"wordtype": "Transitive Verb", "description": "To bring forth; as, to fall lambs."}, {"wordtype": "Transitive Verb", "description": "To fell; to cut down; as, to fall a tree."}, {"wordtype": "Noun", "description": "The act of falling; a dropping or descending be the force of gravity; descent; as, a fall from a horse, or from the yard of ship."}, {"wordtype": "Noun", "description": "The act of dropping or tumbling from an erect posture; as, he was walking on ice, and had a fall."}, {"wordtype": "Noun", "description": "Death; destruction; overthrow; ruin."}, {"wordtype": "Noun", "description": "Downfall; degradation; loss of greatness or office; termination of greatness, power, or dominion; ruin; overthrow; as, the fall of the Roman empire."}, {"wordtype": "Noun", "description": "The surrender of a besieged fortress or town ; as, the fall of Sebastopol."}, {"wordtype": "Noun", "description": "Diminution or decrease in price or value; depreciation; as, the fall of prices; the fall of rents."}, {"wordtype": "Noun", "description": "A sinking of tone; cadence; as, the fall of the voice at the close of a sentence."}, {"wordtype": "Noun", "description": "Declivity; the descent of land or a hill; a slope."}, {"wordtype": "Noun", "description": "Descent of water; a cascade; a cataract; a rush of water down a precipice or steep; -- usually in the plural, sometimes in the singular; as, the falls of Niagara."}, {"wordtype": "Noun", "description": "The discharge of a river or current of water into the ocean, or into a lake or pond; as, the fall of the Po into the Gulf of Venice."}, {"wordtype": "Noun", "description": "Extent of descent; the distance which anything falls; as, the water of a stream has a fall of five feet."}, {"wordtype": "Noun", "description": "The season when leaves fall from trees; autumn."}, {"wordtype": "Noun", "description": "That which falls; a falling; as, a fall of rain; a heavy fall of snow."}, {"wordtype": "Noun", "description": "The act of felling or cutting down."}, {"wordtype": "Noun", "description": "Lapse or declension from innocence or goodness. Specifically: The first apostasy; the act of our first parents in eating the forbidden fruit; also, the apostasy of the rebellious angels."}, {"wordtype": "Noun", "description": "Formerly, a kind of ruff or band for the neck; a falling band; a faule."}, {"wordtype": "Noun", "description": "That part (as one of the ropes) of a tackle to which the power is applied in hoisting."}]}