{"definitions": [{"wordtype": "Verb Intransitive", "description": "To abstain from food; to omit to take nourishment in whole or in part; to go hungry."}, {"wordtype": "Verb Intransitive", "description": "To practice abstinence as a religious exercise or duty; to abstain from food voluntarily for a time, for the mortification of the body or appetites, or as a token of grief, or humiliation and penitence."}, {"wordtype": "Verb Intransitive", "description": "Abstinence from food; omission to take nourishment."}, {"wordtype": "Verb Intransitive", "description": "Voluntary abstinence from food, for a space of time, as a spiritual discipline, or as a token of religious humiliation."}, {"wordtype": "Verb Intransitive", "description": "A time of fasting, whether a day, week, or longer time; a period of abstinence from food or certain kinds of food; as, an annual fast."}, {"wordtype": "Verb", "description": "Firmly fixed; closely adhering; made firm; not loose, unstable, or easily moved; immovable; as, to make fast the door."}, {"wordtype": "Verb", "description": "Firm against attack; fortified by nature or art; impregnable; strong."}, {"wordtype": "Verb", "description": "Firm in adherence; steadfast; not easily separated or alienated; faithful; as, a fast friend."}, {"wordtype": "Verb", "description": "Permanent; not liable to fade by exposure to air or by washing; durable; lasting; as, fast colors."}, {"wordtype": "Verb", "description": "Tenacious; retentive."}, {"wordtype": "Verb", "description": "Not easily disturbed or broken; deep; sound."}, {"wordtype": "Verb", "description": "Moving rapidly; quick in mition; rapid; swift; as, a fast horse."}, {"wordtype": "Verb", "description": "Given to pleasure seeking; disregardful of restraint; reckless; wild; dissipated; dissolute; as, a fast man; a fast liver."}, {"wordtype": "Adjective", "description": "In a fast, fixed, or firmly established manner; fixedly; firmly; immovably."}, {"wordtype": "Adjective", "description": "In a fast or rapid manner; quickly; swiftly; extravagantly; wildly; as, to run fast; to live fast."}, {"wordtype": "Noun", "description": "That which fastens or holds; especially, (Naut.) a mooring rope, hawser, or chain; -- called, according to its position, a bow, head, quarter, breast, or stern fast; also, a post on a pier around which hawsers are passed in mooring."}, {"wordtype": "Noun", "description": "The shaft of a column, or trunk of pilaster."}]}