{"definitions": [{"wordtype": "Noun", "description": "One of the peculiar dermal appendages, of several kinds, belonging to birds, as contour feathers, quills, and down."}, {"wordtype": "Noun", "description": "Kind; nature; species; -- from the proverbial phrase, \"Birds of a feather,\" that is, of the same species."}, {"wordtype": "Noun", "description": "The fringe of long hair on the legs of the setter and some other dogs."}, {"wordtype": "Noun", "description": "A tuft of peculiar, long, frizzly hair on a horse."}, {"wordtype": "Noun", "description": "One of the fins or wings on the shaft of an arrow."}, {"wordtype": "Noun", "description": "A longitudinal strip projecting as a fin from an object, to strengthen it, or to enter a channel in another object and thereby prevent displacement sidwise but permit motion lengthwise; a spline."}, {"wordtype": "Noun", "description": "A thin wedge driven between the two semicylindrical parts of a divided plug in a hole bored in a stone, to rend the stone."}, {"wordtype": "Noun", "description": "The angular adjustment of an oar or paddle-wheel float, with reference to a horizontal axis, as it leaves or enters the water."}, {"wordtype": "Transitive Verb", "description": "To furnish with a feather or feathers, as an arrow or a cap."}, {"wordtype": "Transitive Verb", "description": "To adorn, as with feathers; to fringe."}, {"wordtype": "Transitive Verb", "description": "To render light as a feather; to give wings to."}, {"wordtype": "Transitive Verb", "description": "To enrich; to exalt; to benefit."}, {"wordtype": "Transitive Verb", "description": "To tread, as a cock."}, {"wordtype": "Verb Intransitive", "description": "To grow or form feathers; to become feathered; -- often with out; as, the birds are feathering out."}, {"wordtype": "Verb Intransitive", "description": "To curdle when poured into another liquid, and float about in little flakes or \"feathers;\" as, the cream feathers"}, {"wordtype": "Verb Intransitive", "description": "To turn to a horizontal plane; -- said of oars."}, {"wordtype": "Verb Intransitive", "description": "To have the appearance of a feather or of feathers; to be or to appear in feathery form."}]}