{"definitions": [{"wordtype": "Past Participle", "description": "of Fee"}, {"wordtype": "Transitive Verb", "description": "To give food to; to supply with nourishment; to satisfy the physical huger of."}, {"wordtype": "Transitive Verb", "description": "To satisfy; grafity or minister to, as any sense, talent, taste, or desire."}, {"wordtype": "Transitive Verb", "description": "To fill the wants of; to supply with that which is used or wasted; as, springs feed ponds; the hopper feeds the mill; to feed a furnace with coal."}, {"wordtype": "Transitive Verb", "description": "To nourish, in a general sense; to foster, strengthen, develop, and guard."}, {"wordtype": "Transitive Verb", "description": "To graze; to cause to be cropped by feeding, as herbage by cattle; as, if grain is too forward in autumn, feed it with sheep."}, {"wordtype": "Transitive Verb", "description": "To give for food, especially to animals; to furnish for consumption; as, to feed out turnips to the cows; to feed water to a steam boiler."}, {"wordtype": "Transitive Verb", "description": "To supply (the material to be operated upon) to a machine; as, to feed paper to a printing press."}, {"wordtype": "Transitive Verb", "description": "To produce progressive operation upon or with (as in wood and metal working machines, so that the work moves to the cutting tool, or the tool to the work)."}, {"wordtype": "Verb Intransitive", "description": "To take food; to eat."}, {"wordtype": "Verb Intransitive", "description": "To subject by eating; to satisfy the appetite; to feed one's self (upon something); to prey; -- with on or upon."}, {"wordtype": "Verb Intransitive", "description": "To be nourished, strengthened, or satisfied, as if by food."}, {"wordtype": "Verb Intransitive", "description": "To place cattle to feed; to pasture; to graze."}, {"wordtype": "Noun", "description": "That which is eaten; esp., food for beasts; fodder; pasture; hay; grain, ground or whole; as, the best feed for sheep."}, {"wordtype": "Noun", "description": "A grazing or pasture ground."}, {"wordtype": "Noun", "description": "An allowance of provender given to a horse, cow, etc.; a meal; as, a feed of corn or oats."}, {"wordtype": "Noun", "description": "A meal, or the act of eating."}, {"wordtype": "Noun", "description": "The water supplied to steam boilers."}, {"wordtype": "Noun", "description": "The motion, or act, of carrying forward the stuff to be operated upon, as cloth to the needle in a sewing machine; or of producing progressive operation upon any material or object in a machine, as, in a turning lathe, by moving the cutting tool along or in the work."}, {"wordtype": "Noun", "description": "The supply of material to a machine, as water to a steam boiler, coal to a furnace, or grain to a run of stones."}, {"wordtype": "Noun", "description": "The mechanism by which the action of feeding is produced; a feed motion."}]}