{"definitions": ["The form of anything; shape; outline; appearance.", "The representation of any form, as by drawing, painting, modeling, carving, embroidering, etc.; especially, a representation of the human body; as, a figure in bronze; a figure cut in marble.", "A pattern in cloth, paper, or other manufactured article; a design wrought out in a fabric; as, the muslin was of a pretty figure.", "A diagram or drawing; made to represent a magnitude or the relation of two or more magnitudes; a surface or space inclosed on all sides; -- called superficial when inclosed by lines, and solid when inclosed by surface; any arrangement made up of points, lines, angles, surfaces, etc.", "The appearance or impression made by the conduct or carrer of a person; as, a sorry figure.", "Distinguished appearance; magnificence; conspicuous representation; splendor; show.", "A character or symbol representing a number; a numeral; a digit; as, 1, 2,3, etc.", "Value, as expressed in numbers; price; as, the goods are estimated or sold at a low figure.", "A person, thing, or action, conceived of as analogous to another person, thing, or action, of which it thus becomes a type or representative.", "A mode of expressing abstract or immaterial ideas by words which suggest pictures or images from the physical world; pictorial language; a trope; hence, any deviation from the plainest form of statement.", "The form of a syllogism with respect to the relative position of the middle term.", "Any one of the several regular steps or movements made by a dancer.", "A horoscope; the diagram of the aspects of the astrological houses.", "Any short succession of notes, either as melody or as a group of chords, which produce a single complete and distinct impression.", "A form of melody or accompaniment kept up through a strain or passage; a musical or motive; a florid embellishment.", "To represent by a figure, as to form or mold; to make an image of, either palpable or ideal; also, to fashion into a determinate form; to shape.", "To embellish with design; to adorn with figures.", "To indicate by numerals; also, to compute.", "To represent by a metaphor; to signify or symbolize.", "To prefigure; to foreshow.", "To write over or under the bass, as figures or other characters, in order to indicate the accompanying chords.", "To embellish.", "To make a figure; to be distinguished or conspicious; as, the envoy figured at court.", "To calculate; to contrive; to scheme; as, he is figuring to secure the nomination."]}