{"definitions": [{"wordtype": "Noun", "description": "An orderly succession; a line; a row"}, {"wordtype": "Noun", "description": "A row of soldiers ranged one behind another; -- in contradistinction to rank, which designates a row of soldiers standing abreast; a number consisting the depth of a body of troops, which, in the ordinary modern formation, consists of two men, the battalion standing two deep, or in two ranks."}, {"wordtype": "Noun", "description": "An orderly collection of papers, arranged in sequence or classified for preservation and reference; as, files of letters or of newspapers; this mail brings English files to the 15th instant."}, {"wordtype": "Noun", "description": "The line, wire, or other contrivance, by which papers are put and kept in order."}, {"wordtype": "Noun", "description": "A roll or list."}, {"wordtype": "Noun", "description": "Course of thought; thread of narration."}, {"wordtype": "Transitive Verb", "description": "To set in order; to arrange, or lay away, esp. as papers in a methodical manner for preservation and reverence; to place on file; to insert in its proper place in an arranged body of papers."}, {"wordtype": "Transitive Verb", "description": "To bring before a court or legislative body by presenting proper papers in a regular way; as, to file a petition or bill."}, {"wordtype": "Transitive Verb", "description": "To put upon the files or among the records of a court; to note on (a paper) the fact date of its reception in court."}, {"wordtype": "Verb Intransitive", "description": "To march in a file or line, as soldiers, not abreast, but one after another; -- generally with off."}, {"wordtype": "Noun", "description": "A steel instrument, having cutting ridges or teeth, made by indentation with a chisel, used for abrading or smoothing other substances, as metals, wood, etc."}, {"wordtype": "Noun", "description": "Anything employed to smooth, polish, or rasp, literally or figuratively."}, {"wordtype": "Noun", "description": "A shrewd or artful person."}, {"wordtype": "Transitive Verb", "description": "To rub, smooth, or cut away, with a file; to sharpen with a file; as, to file a saw or a tooth."}, {"wordtype": "Transitive Verb", "description": "To smooth or polish as with a file."}, {"wordtype": "Transitive Verb", "description": "To make foul; to defile."}]}