{"definitions": [{"wordtype": "Adjective", "description": "Finished; brought to perfection; refined; hence, free from impurity; excellent; superior; elegant; worthy of admiration; accomplished; beautiful."}, {"wordtype": "Adjective", "description": "Aiming at show or effect; loaded with ornament; overdressed or overdecorated; showy."}, {"wordtype": "Adjective", "description": "Nice; delicate; subtle; exquisite; artful; skillful; dexterous."}, {"wordtype": "Adjective", "description": "Not coarse, gross, or heavy"}, {"wordtype": "Adjective", "description": "Not gross; subtile; thin; tenous."}, {"wordtype": "Adjective", "description": "Not coarse; comminuted; in small particles; as, fine sand or flour."}, {"wordtype": "Adjective", "description": "Not thick or heavy; slender; filmy; as, a fine thread."}, {"wordtype": "Adjective", "description": "Thin; attenuate; keen; as, a fine edge."}, {"wordtype": "Adjective", "description": "Made of fine materials; light; delicate; as, fine linen or silk."}, {"wordtype": "Adjective", "description": "Having (such) a proportion of pure metal in its composition; as, coins nine tenths fine."}, {"wordtype": "Adjective", "description": "(Used ironically.)"}, {"wordtype": "Adjective", "description": "To make fine; to refine; to purify, to clarify; as, to fine gold."}, {"wordtype": "Adjective", "description": "To make finer, or less coarse, as in bulk, texture, etc.; as. to fine the soil."}, {"wordtype": "Adjective", "description": "To change by fine gradations; as (Naut.), to fine down a ship's lines, to diminish her lines gradually."}, {"wordtype": "Noun", "description": "End; conclusion; termination; extinction."}, {"wordtype": "Noun", "description": "A sum of money paid as the settlement of a claim, or by way of terminating a matter in dispute; especially, a payment of money imposed upon a party as a punishment for an offense; a mulct."}, {"wordtype": "Noun", "description": "A final agreement concerning lands or rents between persons, as the lord and his vassal."}, {"wordtype": "Noun", "description": "A sum of money or price paid for obtaining a benefit, favor, or privilege, as for admission to a copyhold, or for obtaining or renewing a lease."}, {"wordtype": "Noun", "description": "To impose a pecuniary penalty upon for an offense or breach of law; to set a fine on by judgment of a court; to punish by fine; to mulct; as, the trespassers were fined ten dollars."}, {"wordtype": "Verb Intransitive", "description": "To pay a fine. See Fine, n., 3 (b)."}, {"wordtype": "Transitive Verb", "description": "To finish; to cease; or to cause to cease."}]}