{"definitions": [{"wordtype": "Noun", "description": "In Old English, a song; a strain; a canto or portion of a ballad; a passus."}, {"wordtype": "Adjective", "description": "Adapted to an end, object, or design; suitable by nature or by art; suited by character, qualitties, circumstances, education, etc.; qualified; competent; worthy."}, {"wordtype": "Adjective", "description": "Prepared; ready."}, {"wordtype": "Adjective", "description": "Conformed to a standart of duty, properiety, or taste; convenient; meet; becoming; proper."}, {"wordtype": "Transitive Verb", "description": "To make fit or suitable; to adapt to the purpose intended; to qualify; to put into a condition of readiness or preparation."}, {"wordtype": "Transitive Verb", "description": "To bring to a required form and size; to shape aright; to adapt to a model; to adjust; -- said especially of the work of a carpenter, machinist, tailor, etc."}, {"wordtype": "Transitive Verb", "description": "To supply with something that is suitable or fit, or that is shaped and adjusted to the use required."}, {"wordtype": "Transitive Verb", "description": "To be suitable to; to answer the requirements of; to be correctly shaped and adjusted to; as, if the coat fits you, put it on."}, {"wordtype": "Verb Intransitive", "description": "To be proper or becoming."}, {"wordtype": "Verb Intransitive", "description": "To be adjusted to a particular shape or size; to suit; to be adapted; as, his coat fits very well."}, {"wordtype": "Noun", "description": "The quality of being fit; adjustment; adaptedness; as of dress to the person of the wearer."}, {"wordtype": "Noun", "description": "The coincidence of parts that come in contact."}, {"wordtype": "Noun", "description": "The part of an object upon which anything fits tightly."}, {"wordtype": "Noun", "description": "A stroke or blow."}, {"wordtype": "Noun", "description": "A sudden and violent attack of a disorder; a stroke of disease, as of epilepsy or apoplexy, which produces convulsions or unconsciousness; a convulsion; a paroxysm; hence, a period of exacerbation of a disease; in general, an attack of disease; as, a fit of sickness."}, {"wordtype": "Noun", "description": "A mood of any kind which masters or possesses one for a time; a temporary, absorbing affection; a paroxysm; as, a fit melancholy, of passion, or of laughter."}, {"wordtype": "Noun", "description": "A passing humor; a caprice; a sudden and unusual effort, activity, or motion, followed by relaxation or insction; an impulse and irregular action."}, {"wordtype": "Noun", "description": "A darting point; a sudden emission."}]}