{"definitions": [{"wordtype": "Verb Intransitive", "description": "To hang loose without stiffness; to bend down, as flexible bodies; to be loose, yielding, limp."}, {"wordtype": "Verb Intransitive", "description": "To droop; to grow spiritless; to lose vigor; to languish; as, the spirits flag; the streugth flags."}, {"wordtype": "Transitive Verb", "description": "To let droop; to suffer to fall, or let fall, into feebleness; as, to flag the wings."}, {"wordtype": "Transitive Verb", "description": "To enervate; to exhaust the vigor or elasticity of."}, {"wordtype": "Noun", "description": "That which flags or hangs down loosely."}, {"wordtype": "Noun", "description": "A cloth usually bearing a device or devices and used to indicate nationality, party, etc., or to give or ask information; -- commonly attached to a staff to be waved by the wind; a standard; a banner; an ensign; the colors; as, the national flag; a military or a naval flag."}, {"wordtype": "Noun", "description": "A group of feathers on the lower part of the legs of certain hawks, owls, etc."}, {"wordtype": "Noun", "description": "A group of elongated wing feathers in certain hawks."}, {"wordtype": "Noun", "description": "The bushy tail of a dog, as of a setter."}, {"wordtype": "Transitive Verb", "description": "To signal to with a flag; as, to flag a train."}, {"wordtype": "Transitive Verb", "description": "To convey, as a message, by means of flag signals; as, to flag an order to troops or vessels at a distance."}, {"wordtype": "Noun", "description": "An aquatic plant, with long, ensiform leaves, belonging to either of the genera Iris and Acorus."}, {"wordtype": "Transitive Verb", "description": "To furnish or deck out with flags."}, {"wordtype": "Noun", "description": "A flat stone used for paving."}, {"wordtype": "Noun", "description": "Any hard, evenly stratified sandstone, which splits into layers suitable for flagstones."}, {"wordtype": "Transitive Verb", "description": "To lay with flags of flat stones."}]}