{"definitions": [{"wordtype": "Adjective", "description": "Having an even and horizontal surface, or nearly so, without prominences or depressions; level without inclination; plane."}, {"wordtype": "Adjective", "description": "Lying at full length, or spread out, upon the ground; level with the ground or earth; prostrate; as, to lie flat on the ground; hence, fallen; laid low; ruined; destroyed."}, {"wordtype": "Adjective", "description": "Wanting relief; destitute of variety; without points of prominence and striking interest."}, {"wordtype": "Adjective", "description": "Tasteless; stale; vapid; insipid; dead; as, fruit or drink flat to the taste."}, {"wordtype": "Adjective", "description": "Unanimated; dull; uninteresting; without point or spirit; monotonous; as, a flat speech or composition."}, {"wordtype": "Adjective", "description": "Lacking liveliness of commercial exchange and dealings; depressed; dull; as, the market is flat."}, {"wordtype": "Adjective", "description": "Clear; unmistakable; peremptory; absolute; positive; downright."}, {"wordtype": "Adjective", "description": "Below the true pitch; hence, as applied to intervals, minor, or lower by a half step; as, a flat seventh; A flat."}, {"wordtype": "Adjective", "description": "Not sharp or shrill; not acute; as, a flat sound."}, {"wordtype": "Adjective", "description": "Sonant; vocal; -- applied to any one of the sonant or vocal consonants, as distinguished from a nonsonant (or sharp) consonant."}, {"wordtype": "Adverb", "description": "In a flat manner; directly; flatly."}, {"wordtype": "Adverb", "description": "Without allowance for accrued interest."}, {"wordtype": "Noun", "description": "A level surface, without elevation, relief, or prominences; an extended plain; specifically, in the United States, a level tract along the along the banks of a river; as, the Mohawk Flats."}, {"wordtype": "Noun", "description": "A level tract lying at little depth below the surface of water, or alternately covered and left bare by the tide; a shoal; a shallow; a strand."}, {"wordtype": "Noun", "description": "Something broad and flat in form"}, {"wordtype": "Noun", "description": "A flat-bottomed boat, without keel, and of small draught."}, {"wordtype": "Noun", "description": "A straw hat, broad-brimmed and low-crowned."}, {"wordtype": "Noun", "description": "A car without a roof, the body of which is a platform without sides; a platform car."}, {"wordtype": "Noun", "description": "A platform on wheel, upon which emblematic designs, etc., are carried in processions."}, {"wordtype": "Noun", "description": "The flat part, or side, of anything; as, the broad side of a blade, as distinguished from its edge."}, {"wordtype": "Noun", "description": "A floor, loft, or story in a building; especially, a floor of a house, which forms a complete residence in itself."}, {"wordtype": "Noun", "description": "A horizontal vein or ore deposit auxiliary to a main vein; also, any horizontal portion of a vein not elsewhere horizontal."}, {"wordtype": "Noun", "description": "A dull fellow; a simpleton; a numskull."}, {"wordtype": "Noun", "description": "A character [/] before a note, indicating a tone which is a half step or semitone lower."}, {"wordtype": "Noun", "description": "A homaloid space or extension."}, {"wordtype": "Transitive Verb", "description": "To make flat; to flatten; to level."}, {"wordtype": "Transitive Verb", "description": "To render dull, insipid, or spiritless; to depress."}, {"wordtype": "Transitive Verb", "description": "To depress in tone, as a musical note; especially, to lower in pitch by half a tone."}, {"wordtype": "Verb Intransitive", "description": "To become flat, or flattened; to sink or fall to an even surface."}, {"wordtype": "Verb Intransitive", "description": "To fall form the pitch."}]}