{"definitions": [{"wordtype": "Verb Intransitive", "description": "To grow luxuriantly; to increase and enlarge, as a healthy growing plant; a thrive."}, {"wordtype": "Verb Intransitive", "description": "To be prosperous; to increase in wealth, honor, comfort, happiness, or whatever is desirable; to thrive; to be prominent and influental; specifically, of authors, painters, etc., to be in a state of activity or production."}, {"wordtype": "Verb Intransitive", "description": "To use florid language; to indulge in rhetorical figures and lofty expressions; to be flowery."}, {"wordtype": "Verb Intransitive", "description": "To make bold and sweeping, fanciful, or wanton movements, by way of ornament, parade, bravado, etc.; to play with fantastic and irregular motion."}, {"wordtype": "Verb Intransitive", "description": "To make ornamental strokes with the pen; to write graceful, decorative figures."}, {"wordtype": "Verb Intransitive", "description": "To execute an irregular or fanciful strain of music, by way of ornament or prelude."}, {"wordtype": "Verb Intransitive", "description": "To boast; to vaunt; to brag."}, {"wordtype": "Transitive Verb", "description": "To adorn with flowers orbeautiful figures, either natural or artificial; to ornament with anything showy; to embellish."}, {"wordtype": "Transitive Verb", "description": "To embellish with the flowers of diction; to adorn with rhetorical figures; to grace with ostentatious eloquence; to set off with a parade of words."}, {"wordtype": "Transitive Verb", "description": "To move in bold or irregular figures; to swing about in circles or vibrations by way of show or triumph; to brandish."}, {"wordtype": "Transitive Verb", "description": "To develop; to make thrive; to expand."}, {"wordtype": "Noun", "description": "A flourishing condition; prosperity; vigor."}, {"wordtype": "Noun", "description": "Decoration; ornament; beauty."}, {"wordtype": "Noun", "description": "Something made or performed in a fanciful, wanton, or vaunting manner, by way of ostentation, to excite admiration, etc.; ostentatious embellishment; ambitious copiousness or amplification; parade of words and figures; show; as, a flourish of rhetoric or of wit."}, {"wordtype": "Noun", "description": "A fanciful stroke of the pen or graver; a merely decorative figure."}, {"wordtype": "Noun", "description": "A fantastic or decorative musical passage; a strain of triumph or bravado, not forming part of a regular musical composition; a cal; a fanfare."}, {"wordtype": "Noun", "description": "The waving of a weapon or other thing; a brandishing; as, the flourish of a sword."}]}