{"definitions": [{"wordtype": "Verb Intransitive", "description": "To flow and spread suddenly; to rush; as, blood flushes into the face."}, {"wordtype": "Verb Intransitive", "description": "To become suddenly suffused, as the cheeks; to turn red; to blush."}, {"wordtype": "Verb Intransitive", "description": "To snow red; to shine suddenly; to glow."}, {"wordtype": "Verb Intransitive", "description": "To start up suddenly; to take wing as a bird."}, {"wordtype": "Transitive Verb", "description": "To cause to be full; to flood; to overflow; to overwhelm with water; as, to flush the meadows; to flood for the purpose of cleaning; as, to flush a sewer."}, {"wordtype": "Transitive Verb", "description": "To cause the blood to rush into (the face); to put to the blush, or to cause to glow with excitement."}, {"wordtype": "Transitive Verb", "description": "To make suddenly or temporarily red or rosy, as if suffused with blood."}, {"wordtype": "Transitive Verb", "description": "To excite; to animate; to stir."}, {"wordtype": "Transitive Verb", "description": "To cause to start, as a hunter a bird."}, {"wordtype": "Noun", "description": "A sudden flowing; a rush which fills or overflows, as of water for cleansing purposes."}, {"wordtype": "Noun", "description": "A suffusion of the face with blood, as from fear, shame, modesty, or intensity of feeling of any kind; a blush; a glow."}, {"wordtype": "Noun", "description": "Any tinge of red color like that produced on the cheeks by a sudden rush of blood; as, the flush on the side of a peach; the flush on the clouds at sunset."}, {"wordtype": "Noun", "description": "A sudden flood or rush of feeling; a thrill of excitement. animation, etc.; as, a flush of joy."}, {"wordtype": "Noun", "description": "A flock of birds suddenly started up or flushed."}, {"wordtype": "Noun", "description": "A hand of cards of the same suit."}, {"wordtype": "Adjective", "description": "Full of vigor; fresh; glowing; bright."}, {"wordtype": "Adjective", "description": "Affluent; abounding; well furnished or suppled; hence, liberal; prodigal."}, {"wordtype": "Adjective", "description": "Unbroken or even in surface; on a level with the adjacent surface; forming a continuous surface; as, a flush panel; a flush joint."}, {"wordtype": "Adjective", "description": "Consisting of cards of one suit."}, {"wordtype": "Adverb", "description": "So as to be level or even."}]}