{"definitions": [{"wordtype": "Verb Intransitive", "description": "To move in or pass thorugh the air with wings, as a bird."}, {"wordtype": "Verb Intransitive", "description": "To move through the air or before the wind; esp., to pass or be driven rapidly through the air by any impulse."}, {"wordtype": "Verb Intransitive", "description": "To float, wave, or rise in the air, as sparks or a flag."}, {"wordtype": "Verb Intransitive", "description": "To move or pass swiftly; to hasten away; to circulate rapidly; as, a ship flies on the deep; a top flies around; rumor flies."}, {"wordtype": "Verb Intransitive", "description": "To run from danger; to attempt to escape; to flee; as, an enemy or a coward flies. See Note under Flee."}, {"wordtype": "Verb Intransitive", "description": "To move suddenly, or with violence; to do an act suddenly or swiftly; -- usually with a qualifying word; as, a door flies open; a bomb flies apart."}, {"wordtype": "Transitive Verb", "description": "To cause to fly or to float in the air, as a bird, a kite, a flag, etc."}, {"wordtype": "Transitive Verb", "description": "To fly or flee from; to shun; to avoid."}, {"wordtype": "Transitive Verb", "description": "To hunt with a hawk."}, {"wordtype": "Verb Intransitive", "description": "Any winged insect; esp., one with transparent wings; as, the Spanish fly; firefly; gall fly; dragon fly."}, {"wordtype": "Verb Intransitive", "description": "Any dipterous insect; as, the house fly; flesh fly; black fly. See Diptera, and Illust. in Append."}, {"wordtype": "Verb Intransitive", "description": "A hook dressed in imitation of a fly, -- used for fishing."}, {"wordtype": "Verb Intransitive", "description": "A familiar spirit; a witch's attendant."}, {"wordtype": "Verb Intransitive", "description": "A parasite."}, {"wordtype": "Verb Intransitive", "description": "A kind of light carriage for rapid transit, plying for hire and usually drawn by one horse."}, {"wordtype": "Verb Intransitive", "description": "The length of an extended flag from its staff; sometimes, the length from the \"union\" to the extreme end."}, {"wordtype": "Verb Intransitive", "description": "The part of a vane pointing the direction from which the wind blows."}, {"wordtype": "Verb Intransitive", "description": "That part of a compass on which the points are marked; the compass card."}, {"wordtype": "Verb Intransitive", "description": "Two or more vanes set on a revolving axis, to act as a fanner, or to equalize or impede the motion of machinery by the resistance of the air, as in the striking part of a clock."}, {"wordtype": "Verb Intransitive", "description": "A heavy wheel, or cross arms with weights at the ends on a revolving axis, to regulate or equalize the motion of machinery by means of its inertia, where the power communicated, or the resistance to be overcome, is variable, as in the steam engine or the coining press. See Fly wheel (below)."}, {"wordtype": "Verb Intransitive", "description": "The piece hinged to the needle, which holds the engaged loop in position while the needle is penetrating another loop; a latch."}, {"wordtype": "Verb Intransitive", "description": "The pair of arms revolving around the bobbin, in a spinning wheel or spinning frame, to twist the yarn."}, {"wordtype": "Verb Intransitive", "description": "A shuttle driven through the shed by a blow or jerk."}, {"wordtype": "Verb Intransitive", "description": "Formerly, the person who took the printed sheets from the press."}, {"wordtype": "Verb Intransitive", "description": "A vibrating frame with fingers, attached to a power to a power printing press for doing the same work."}, {"wordtype": "Verb Intransitive", "description": "The outer canvas of a tent with double top, usually drawn over the ridgepole, but so extended as to touch the roof of the tent at no other place."}, {"wordtype": "Verb Intransitive", "description": "One of the upper screens of a stage in a theater."}, {"wordtype": "Verb Intransitive", "description": "The fore flap of a bootee; also, a lap on trousers, overcoats, etc., to conceal a row of buttons."}, {"wordtype": "Verb Intransitive", "description": "A batted ball that flies to a considerable distance, usually high in the air; also, the flight of a ball so struck; as, it was caught on the fly."}, {"wordtype": "Adjective", "description": "Knowing; wide awake; fully understanding another's meaning."}]}