{"definitions": ["A prefix to verbs, having usually the force of a negative or privative. It often implies also loss, detriment, or destruction, and sometimes it is intensive, meaning utterly, quite thoroughly, as in forbathe.", "In the most general sense, indicating that in consideration of, in view of, or with reference to, which anything is done or takes place.", "Indicating the antecedent cause or occasion of an action; the motive or inducement accompanying and prompting to an act or state; the reason of anything; that on account of which a thing is or is done.", "Indicating the remoter and indirect object of an act; the end or final cause with reference to which anything is, acts, serves, or is done.", "Indicating that in favor of which, or in promoting which, anything is, or is done; hence, in behalf of; in favor of; on the side of; -- opposed to against.", "Indicating that toward which the action of anything is directed, or the point toward which motion is made; /ntending to go to.", "Indicating that on place of or instead of which anything acts or serves, or that to which a substitute, an equivalent, a compensation, or the like, is offered or made; instead of, or place of.", "Indicating that in the character of or as being which anything is regarded or treated; to be, or as being.", "Indicating that instead of which something else controls in the performing of an action, or that in spite of which anything is done, occurs, or is; hence, equivalent to notwithstanding, in spite of; -- generally followed by all, aught, anything, etc.", "Indicating the space or time through which an action or state extends; hence, during; in or through the space or time of.", "Indicating that in prevention of which, or through fear of which, anything is done.", "Because; by reason that; for that; indicating, in Old English, the reason of anything.", "Since; because; introducing a reason of something before advanced, a cause, motive, explanation, justification, or the like, of an action related or a statement made. It is logically nearly equivalent to since, or because, but connects less closely, and is sometimes used as a very general introduction to something suggested by what has gone before.", "One who takes, or that which is said on, the affrimative side; that which is said in favor of some one or something; -- the antithesis of against, and commonly used in connection with it."]}