{"definitions": [{"wordtype": "Transitive Verb", "description": "To stuff; to lard; to farce."}, {"wordtype": "Noun", "description": "A waterfall; a cascade."}, {"wordtype": "Noun", "description": "Strength or energy of body or mind; active power; vigor; might; often, an unusual degree of strength or energy; capacity of exercising an influence or producing an effect; especially, power to persuade, or convince, or impose obligation; pertinency; validity; special signification; as, the force of an appeal, an argument, a contract, or a term."}, {"wordtype": "Noun", "description": "Power exerted against will or consent; compulsory power; violence; coercion."}, {"wordtype": "Noun", "description": "Strength or power for war; hence, a body of land or naval combatants, with their appurtenances, ready for action; -- an armament; troops; warlike array; -- often in the plural; hence, a body of men prepared for action in other ways; as, the laboring force of a plantation."}, {"wordtype": "Noun", "description": "Strength or power exercised without law, or contrary to law, upon persons or things; violence."}, {"wordtype": "Noun", "description": "Validity; efficacy."}, {"wordtype": "Noun", "description": "Any action between two bodies which changes, or tends to change, their relative condition as to rest or motion; or, more generally, which changes, or tends to change, any physical relation between them, whether mechanical, thermal, chemical, electrical, magnetic, or of any other kind; as, the force of gravity; cohesive force; centrifugal force."}, {"wordtype": "Noun", "description": "To constrain to do or to forbear, by the exertion of a power not resistible; to compel by physical, moral, or intellectual means; to coerce; as, masters force slaves to labor."}, {"wordtype": "Noun", "description": "To compel, as by strength of evidence; as, to force conviction on the mind."}, {"wordtype": "Noun", "description": "To do violence to; to overpower, or to compel by violence to one;s will; especially, to ravish; to violate; to commit rape upon."}, {"wordtype": "Noun", "description": "To obtain or win by strength; to take by violence or struggle; specifically, to capture by assault; to storm, as a fortress."}, {"wordtype": "Noun", "description": "To impel, drive, wrest, extort, get, etc., by main strength or violence; -- with a following adverb, as along, away, from, into, through, out, etc."}, {"wordtype": "Noun", "description": "To put in force; to cause to be executed; to make binding; to enforce."}, {"wordtype": "Noun", "description": "To exert to the utmost; to urge; hence, to strain; to urge to excessive, unnatural, or untimely action; to produce by unnatural effort; as, to force a consient or metaphor; to force a laugh; to force fruits."}, {"wordtype": "Noun", "description": "To compel (an adversary or partner) to trump a trick by leading a suit of which he has none."}, {"wordtype": "Noun", "description": "To provide with forces; to reenforce; to strengthen by soldiers; to man; to garrison."}, {"wordtype": "Noun", "description": "To allow the force of; to value; to care for."}, {"wordtype": "Verb Intransitive", "description": "To use violence; to make violent effort; to strive; to endeavor."}, {"wordtype": "Verb Intransitive", "description": "To make a difficult matter of anything; to labor; to hesitate; hence, to force of, to make much account of; to regard."}, {"wordtype": "Verb Intransitive", "description": "To be of force, importance, or weight; to matter."}]}