{"definitions": [{"wordtype": "Noun", "description": "A suffix used to denote in the form / shape of, resembling, etc.; as, valiform; oviform."}, {"wordtype": "Noun", "description": "The shape and structure of anything, as distinguished from the material of which it is composed; particular disposition or arrangement of matter, giving it individuality or distinctive character; configuration; figure; external appearance."}, {"wordtype": "Noun", "description": "Constitution; mode of construction, organization, etc.; system; as, a republican form of government."}, {"wordtype": "Noun", "description": "Established method of expression or practice; fixed way of proceeding; conventional or stated scheme; formula; as, a form of prayer."}, {"wordtype": "Noun", "description": "Show without substance; empty, outside appearance; vain, trivial, or conventional ceremony; conventionality; formality; as, a matter of mere form."}, {"wordtype": "Noun", "description": "Orderly arrangement; shapeliness; also, comeliness; elegance; beauty."}, {"wordtype": "Noun", "description": "A shape; an image; a phantom."}, {"wordtype": "Noun", "description": "That by which shape is given or determined; mold; pattern; model."}, {"wordtype": "Noun", "description": "A long seat; a bench; hence, a rank of students in a school; a class; also, a class or rank in society."}, {"wordtype": "Noun", "description": "The seat or bed of a hare."}, {"wordtype": "Noun", "description": "The type or other matter from which an impression is to be taken, arranged and secured in a chase."}, {"wordtype": "Noun", "description": "The boundary line of a material object. In painting, more generally, the human body."}, {"wordtype": "Noun", "description": "The particular shape or structure of a word or part of speech; as, participial forms; verbal forms."}, {"wordtype": "Noun", "description": "The combination of planes included under a general crystallographic symbol. It is not necessarily a closed solid."}, {"wordtype": "Noun", "description": "That assemblage or disposition of qualities which makes a conception, or that internal constitution which makes an existing thing to be what it is; -- called essential or substantial form, and contradistinguished from matter; hence, active or formative nature; law of being or activity; subjectively viewed, an idea; objectively, a law."}, {"wordtype": "Noun", "description": "Mode of acting or manifestation to the senses, or the intellect; as, water assumes the form of ice or snow. In modern usage, the elements of a conception furnished by the mind's own activity, as contrasted with its object or condition, which is called the matter; subjectively, a mode of apprehension or belief conceived as dependent on the constitution of the mind; objectively, universal and necessary accompaniments or elements of every object known or thought of."}, {"wordtype": "Noun", "description": "The peculiar characteristics of an organism as a type of others; also, the structure of the parts of an animal or plant."}, {"wordtype": "Noun", "description": "To give form or shape to; to frame; to construct; to make; to fashion."}, {"wordtype": "Noun", "description": "To give a particular shape to; to shape, mold, or fashion into a certain state or condition; to arrange; to adjust; also, to model by instruction and discipline; to mold by influence, etc.; to train."}, {"wordtype": "Noun", "description": "To go to make up; to act as constituent of; to be the essential or constitutive elements of; to answer for; to make the shape of; -- said of that out of which anything is formed or constituted, in whole or in part."}, {"wordtype": "Noun", "description": "To provide with a form, as a hare. See Form, n., 9."}, {"wordtype": "Noun", "description": "To derive by grammatical rules, as by adding the proper suffixes and affixes."}, {"wordtype": "Verb Intransitive", "description": "To take a form, definite shape, or arrangement; as, the infantry should form in column."}, {"wordtype": "Verb Intransitive", "description": "To run to a form, as a hare."}]}