{"definitions": [{"wordtype": "Noun", "description": "A bird."}, {"wordtype": "Adjective", "description": "Covered with, or containing, extraneous matter which is injurious, noxious, offensive, or obstructive; filthy; dirty; not clean; polluted; nasty; defiled; as, a foul cloth; foul hands; a foul chimney; foul air; a ship's bottom is foul when overgrown with barnacles; a gun becomes foul from repeated firing; a well is foul with polluted water."}, {"wordtype": "Adjective", "description": "Scurrilous; obscene or profane; abusive; as, foul words; foul language."}, {"wordtype": "Adjective", "description": "Hateful; detestable; shameful; odious; wretched."}, {"wordtype": "Adjective", "description": "Loathsome; disgusting; as, a foul disease."}, {"wordtype": "Adjective", "description": "Ugly; homely; poor."}, {"wordtype": "Adjective", "description": "Not favorable; unpropitious; not fair or advantageous; as, a foul wind; a foul road; cloudy or rainy; stormy; not fair; -- said of the weather, sky, etc."}, {"wordtype": "Adjective", "description": "Not conformed to the established rules and customs of a game, conflict, test, etc.; unfair; dishonest; dishonorable; cheating; as, foul play."}, {"wordtype": "Adjective", "description": "Having freedom of motion interfered with by collision or entanglement; entangled; -- opposed to clear; as, a rope or cable may get foul while paying it out."}, {"wordtype": "Transitive Verb", "description": "To make filthy; to defile; to daub; to dirty; to soil; as, to foul the face or hands with mire."}, {"wordtype": "Transitive Verb", "description": "To incrust (the bore of a gun) with burnt powder in the process of firing."}, {"wordtype": "Transitive Verb", "description": "To cover (a ship's bottom) with anything that impered its sailing; as, a bottom fouled with barnacles."}, {"wordtype": "Transitive Verb", "description": "To entangle, so as to impede motion; as, to foul a rope or cable in paying it out; to come into collision with; as, one boat fouled the other in a race."}, {"wordtype": "Verb Intransitive", "description": "To become clogged with burnt powder in the process of firing, as a gun."}, {"wordtype": "Verb Intransitive", "description": "To become entagled, as ropes; to come into collision with something; as, the two boats fouled."}, {"wordtype": "Noun", "description": "An entanglement; a collision, as in a boat race."}, {"wordtype": "Noun", "description": "See Foul ball, under Foul, a."}]}