{"definitions": [{"wordtype": "Transitive Verb", "description": "To construct by fitting and uniting the several parts of the skeleton of any structure; specifically, in woodwork, to put together by cutting parts of one member to fit parts of another. See Dovetail, Halve, v. t., Miter, Tenon, Tooth, Tusk, Scarf, and Splice."}, {"wordtype": "Transitive Verb", "description": "To originate; to plan; to devise; to contrive; to compose; in a bad sense, to invent or fabricate, as something false."}, {"wordtype": "Transitive Verb", "description": "To fit to something else, or for some specific end; to adjust; to regulate; to shape; to conform."}, {"wordtype": "Transitive Verb", "description": "To cause; to bring about; to produce."}, {"wordtype": "Transitive Verb", "description": "To support."}, {"wordtype": "Transitive Verb", "description": "To provide with a frame, as a picture."}, {"wordtype": "Verb Intransitive", "description": "To shape; to arrange, as the organs of speech."}, {"wordtype": "Verb Intransitive", "description": "To proceed; to go."}, {"wordtype": "Noun", "description": "Anything composed of parts fitted and united together; a fabric; a structure; esp., the constructional system, whether of timber or metal, that gives to a building, vessel, etc., its model and strength; the skeleton of a structure."}, {"wordtype": "Noun", "description": "The bodily structure; physical constitution; make or build of a person."}, {"wordtype": "Noun", "description": "A kind of open case or structure made for admitting, inclosing, or supporting things, as that which incloses or contains a window, door, picture, etc.; that on which anything is held or stretched"}, {"wordtype": "Noun", "description": "The skeleton structure which supports the boiler and machinery of a locomotive upon its wheels."}, {"wordtype": "Noun", "description": "A molding box or flask, which being filled with sand serves as a mold for castings."}, {"wordtype": "Noun", "description": "The ribs and stretchers of an umbrella or other structure with a fabric covering."}, {"wordtype": "Noun", "description": "A structure of four bars, adjustable in size, on which cloth, etc., is stretched for quilting, embroidery, etc."}, {"wordtype": "Noun", "description": "A glazed portable structure for protecting young plants from frost."}, {"wordtype": "Noun", "description": "A stand to support the type cases for use by the compositor."}, {"wordtype": "Noun", "description": "A term applied, especially in England, to certain machines built upon or within framework; as, a stocking frame; lace frame; spinning frame, etc."}, {"wordtype": "Noun", "description": "Form; shape; proportion; scheme; structure; constitution; system; as, a frameof government."}, {"wordtype": "Noun", "description": "Particular state or disposition, as of the mind; humor; temper; mood; as, to be always in a happy frame."}, {"wordtype": "Noun", "description": "Contrivance; the act of devising or scheming."}]}