{"definitions": [{"wordtype": "Adjective", "description": "Exempt from subjection to the will of others; not under restraint, control, or compulsion; able to follow one's own impulses, desires, or inclinations; determining one's own course of action; not dependent; at liberty."}, {"wordtype": "Adjective", "description": "Not under an arbitrary or despotic government; subject only to fixed laws regularly and fairly administered, and defended by them from encroachments upon natural or acquired rights; enjoying political liberty."}, {"wordtype": "Adjective", "description": "Liberated, by arriving at a certain age, from the control of parents, guardian, or master."}, {"wordtype": "Adjective", "description": "Not confined or imprisoned; released from arrest; liberated; at liberty to go."}, {"wordtype": "Adjective", "description": "Not subjected to the laws of physical necessity; capable of voluntary activity; endowed with moral liberty; -- said of the will."}, {"wordtype": "Adjective", "description": "Clear of offense or crime; guiltless; innocent."}, {"wordtype": "Adjective", "description": "Unconstrained by timidity or distrust; unreserved; ingenuous; frank; familiar; communicative."}, {"wordtype": "Adjective", "description": "Unrestrained; immoderate; lavish; licentious; -- used in a bad sense."}, {"wordtype": "Adjective", "description": "Not close or parsimonious; liberal; open-handed; lavish; as, free with his money."}, {"wordtype": "Adjective", "description": "Exempt; clear; released; liberated; not encumbered or troubled with; as, free from pain; free from a burden; -- followed by from, or, rarely, by of."}, {"wordtype": "Adjective", "description": "Characteristic of one acting without restraint; charming; easy."}, {"wordtype": "Adjective", "description": "Ready; eager; acting without spurring or whipping; spirited; as, a free horse."}, {"wordtype": "Adjective", "description": "Invested with a particular freedom or franchise; enjoying certain immunities or privileges; admitted to special rights; -- followed by of."}, {"wordtype": "Adjective", "description": "Thrown open, or made accessible, to all; to be enjoyed without limitations; unrestricted; not obstructed, engrossed, or appropriated; open; -- said of a thing to be possessed or enjoyed; as, a free school."}, {"wordtype": "Adjective", "description": "Not gained by importunity or purchase; gratuitous; spontaneous; as, free admission; a free gift."}, {"wordtype": "Adjective", "description": "Not arbitrary or despotic; assuring liberty; defending individual rights against encroachment by any person or class; instituted by a free people; -- said of a government, institutions, etc."}, {"wordtype": "Adjective", "description": "Certain or honorable; the opposite of base; as, free service; free socage."}, {"wordtype": "Adjective", "description": "Privileged or individual; the opposite of common; as, a free fishery; a free warren."}, {"wordtype": "Adjective", "description": "Not united or combined with anything else; separated; dissevered; unattached; at liberty to escape; as, free carbonic acid gas; free cells."}, {"wordtype": "Adverb", "description": "Freely; willingly."}, {"wordtype": "Adverb", "description": "Without charge; as, children admitted free."}, {"wordtype": "Adjective", "description": "To make free; to set at liberty; to rid of that which confines, limits, embarrasses, oppresses, etc.; to release; to disengage; to clear; -- followed by from, and sometimes by off; as, to free a captive or a slave; to be freed of these inconveniences."}, {"wordtype": "Adjective", "description": "To remove, as something that confines or bars; to relieve from the constraint of."}, {"wordtype": "Adjective", "description": "To frank."}]}