{"definitions": [{"wordtype": "Noun", "description": "See 1st Frith."}, {"wordtype": "Transitive Verb", "description": "To devour."}, {"wordtype": "Transitive Verb", "description": "To rub; to wear away by friction; to chafe; to gall; hence, to eat away; to gnaw; as, to fret cloth; to fret a piece of gold or other metal; a worm frets the plants of a ship."}, {"wordtype": "Transitive Verb", "description": "To impair; to wear away; to diminish."}, {"wordtype": "Transitive Verb", "description": "To make rough, agitate, or disturb; to cause to ripple; as, to fret the surface of water."}, {"wordtype": "Transitive Verb", "description": "To tease; to irritate; to vex."}, {"wordtype": "Verb Intransitive", "description": "To be worn away; to chafe; to fray; as, a wristband frets on the edges."}, {"wordtype": "Verb Intransitive", "description": "To eat in; to make way by corrosion."}, {"wordtype": "Verb Intransitive", "description": "To be agitated; to be in violent commotion; to rankle; as, rancor frets in the malignant breast."}, {"wordtype": "Verb Intransitive", "description": "To be vexed; to be chafed or irritated; to be angry; to utter peevish expressions."}, {"wordtype": "Noun", "description": "The agitation of the surface of a fluid by fermentation or other cause; a rippling on the surface of water."}, {"wordtype": "Noun", "description": "Agitation of mind marked by complaint and impatience; disturbance of temper; irritation; as, he keeps his mind in a continual fret."}, {"wordtype": "Noun", "description": "Herpes; tetter."}, {"wordtype": "Noun", "description": "The worn sides of river banks, where ores, or stones containing them, accumulate by being washed down from the hills, and thus indicate to the miners the locality of the veins."}, {"wordtype": "Transitive Verb", "description": "To ornament with raised work; to variegate; to diversify."}, {"wordtype": "Noun", "description": "Ornamental work in relief, as carving or embossing. See Fretwork."}, {"wordtype": "Noun", "description": "An ornament consisting of smmall fillets or slats intersecting each other or bent at right angles, as in classical designs, or at obilique angles, as often in Oriental art."}, {"wordtype": "Noun", "description": "The reticulated headdress or net, made of gold or silver wire, in which ladies in the Middle Ages confined their hair."}, {"wordtype": "Noun", "description": "A saltire interlaced with a mascle."}, {"wordtype": "Noun", "description": "A short piece of wire, or other material fixed across the finger board of a guitar or a similar instrument, to indicate where the finger is to be placed."}, {"wordtype": "Transitive Verb", "description": "To furnish with frets, as an instrument of music."}]}