{"definitions": [{"wordtype": "Noun", "description": "The forehead or brow, the part of the face above the eyes; sometimes, also, the whole face."}, {"wordtype": "Noun", "description": "The forehead, countenance, or personal presence, as expressive of character or temper, and especially, of boldness of disposition, sometimes of impudence; seeming; as, a bold front; a hardened front."}, {"wordtype": "Noun", "description": "The part or surface of anything which seems to look out, or to be directed forward; the fore or forward part; the foremost rank; the van; -- the opposite to back or rear; as, the front of a house; the front of an army."}, {"wordtype": "Noun", "description": "A position directly before the face of a person, or before the foremost part of a thing; as, in front of un person, of the troops, or of a house."}, {"wordtype": "Noun", "description": "The most conspicuous part."}, {"wordtype": "Noun", "description": "That which covers the foremost part of the head: a front piece of false hair worn by women."}, {"wordtype": "Noun", "description": "The beginning."}, {"wordtype": "Adjective", "description": "Of or relating to the front or forward part; having a position in front; foremost; as, a front view."}, {"wordtype": "Transitive Verb", "description": "To oppose face to face; to oppose directly; to meet in a hostile manner."}, {"wordtype": "Transitive Verb", "description": "To appear before; to meet."}, {"wordtype": "Transitive Verb", "description": "To face toward; to have the front toward; to confront; as, the house fronts the street."}, {"wordtype": "Transitive Verb", "description": "To stand opposed or opposite to, or over against as, his house fronts the church."}, {"wordtype": "Transitive Verb", "description": "To adorn in front; to supply a front to; as, to front a house with marble; to front a head with laurel."}, {"wordtype": "Transitive Verb", "description": "To have or turn the face or front in any direction; as, the house fronts toward the east."}]}