{"definitions": [{"wordtype": "Transitive Verb", "description": "To measure or determine with a gauge."}, {"wordtype": "Transitive Verb", "description": "To measure or to ascertain the contents or the capacity of, as of a pipe, barrel, or keg."}, {"wordtype": "Transitive Verb", "description": "To measure the dimensions of, or to test the accuracy of the form of, as of a part of a gunlock."}, {"wordtype": "Transitive Verb", "description": "To draw into equidistant gathers by running a thread through it, as cloth or a garment."}, {"wordtype": "Transitive Verb", "description": "To measure the capacity, character, or ability of; to estimate; to judge of."}, {"wordtype": "Noun", "description": "A measure; a standard of measure; an instrument to determine dimensions, distance, or capacity; a standard."}, {"wordtype": "Noun", "description": "Measure; dimensions; estimate."}, {"wordtype": "Noun", "description": "Any instrument for ascertaining or regulating the dimensions or forms of things; a templet or template; as, a button maker's gauge."}, {"wordtype": "Noun", "description": "Any instrument or apparatus for measuring the state of a phenomenon, or for ascertaining its numerical elements at any moment; -- usually applied to some particular instrument; as, a rain gauge; a steam gauge."}, {"wordtype": "Noun", "description": "Relative positions of two or more vessels with reference to the wind; as, a vessel has the weather gauge of another when on the windward side of it, and the lee gauge when on the lee side of it."}, {"wordtype": "Noun", "description": "The depth to which a vessel sinks in the water."}, {"wordtype": "Noun", "description": "The distance between the rails of a railway."}, {"wordtype": "Noun", "description": "The quantity of plaster of Paris used with common plaster to accelerate its setting."}, {"wordtype": "Noun", "description": "That part of a shingle, slate, or tile, which is exposed to the weather, when laid; also, one course of such shingles, slates, or tiles."}]}