{"definitions": [{"wordtype": "Noun", "description": "To bestow without receiving a return; to confer without compensation; to impart, as a possession; to grant, as authority or permission; to yield up or allow."}, {"wordtype": "Noun", "description": "To yield possesion of; to deliver over, as property, in exchange for something; to pay; as, we give the value of what we buy."}, {"wordtype": "Noun", "description": "To yield; to furnish; to produce; to emit; as, flint and steel give sparks."}, {"wordtype": "Noun", "description": "To communicate or announce, as advice, tidings, etc.; to pronounce; to render or utter, as an opinion, a judgment, a sentence, a shout, etc."}, {"wordtype": "Noun", "description": "To grant power or license to; to permit; to allow; to license; to commission."}, {"wordtype": "Noun", "description": "To exhibit as a product or result; to produce; to show; as, the number of men, divided by the number of ships, gives four hundred to each ship."}, {"wordtype": "Noun", "description": "To devote; to apply; used reflexively, to devote or apply one's self; as, the soldiers give themselves to plunder; also in this sense used very frequently in the past participle; as, the people are given to luxury and pleasure; the youth is given to study."}, {"wordtype": "Noun", "description": "To set forth as a known quantity or a known relation, or as a premise from which to reason; -- used principally in the passive form given."}, {"wordtype": "Noun", "description": "To allow or admit by way of supposition."}, {"wordtype": "Noun", "description": "To attribute; to assign; to adjudge."}, {"wordtype": "Noun", "description": "To excite or cause to exist, as a sensation; as, to give offense; to give pleasure or pain."}, {"wordtype": "Noun", "description": "To pledge; as, to give one's word."}, {"wordtype": "Noun", "description": "To cause; to make; -- with the infinitive; as, to give one to understand, to know, etc."}, {"wordtype": "Verb Intransitive", "description": "To give a gift or gifts."}, {"wordtype": "Verb Intransitive", "description": "To yield to force or pressure; to relax; to become less rigid; as, the earth gives under the feet."}, {"wordtype": "Verb Intransitive", "description": "To become soft or moist."}, {"wordtype": "Verb Intransitive", "description": "To move; to recede."}, {"wordtype": "Verb Intransitive", "description": "To shed tears; to weep."}, {"wordtype": "Verb Intransitive", "description": "To have a misgiving."}, {"wordtype": "Verb Intransitive", "description": "To open; to lead."}]}