{"definitions": [{"wordtype": "Verb Intransitive", "description": "To pass from one place to another; to be in motion; to be in a state not motionless or at rest; to proceed; to advance; to make progress; -- used, in various applications, of the movement of both animate and inanimate beings, by whatever means, and also of the movements of the mind; also figuratively applied."}, {"wordtype": "Verb Intransitive", "description": "To move upon the feet, or step by step; to walk; also, to walk step by step, or leisurely."}, {"wordtype": "Verb Intransitive", "description": "To be passed on fron one to another; to pass; to circulate; hence, with for, to have currency; to be taken, accepted, or regarded."}, {"wordtype": "Verb Intransitive", "description": "To proceed or happen in a given manner; to fare; to move on or be carried on; to have course; to come to an issue or result; to succeed; to turn out."}, {"wordtype": "Verb Intransitive", "description": "To proceed or tend toward a result, consequence, or product; to tend; to conduce; to be an ingredient; to avail; to apply; to contribute; -- often with the infinitive; as, this goes to show."}, {"wordtype": "Verb Intransitive", "description": "To apply one's self; to set one's self; to undertake."}, {"wordtype": "Verb Intransitive", "description": "To proceed by a mental operation; to pass in mind or by an act of the memory or imagination; -- generally with over or through."}, {"wordtype": "Verb Intransitive", "description": "To be with young; to be pregnant; to gestate."}, {"wordtype": "Verb Intransitive", "description": "To move from the person speaking, or from the point whence the action is contemplated; to pass away; to leave; to depart; -- in opposition to stay and come."}, {"wordtype": "Verb Intransitive", "description": "To pass away; to depart forever; to be lost or ruined; to perish; to decline; to decease; to die."}, {"wordtype": "Verb Intransitive", "description": "To reach; to extend; to lead; as, a line goes across the street; his land goes to the river; this road goes to New York."}, {"wordtype": "Verb Intransitive", "description": "To have recourse; to resort; as, to go to law."}, {"wordtype": "Transitive Verb", "description": "To take, as a share in an enterprise; to undertake or become responsible for; to bear a part in."}, {"wordtype": "Transitive Verb", "description": "To bet or wager; as, I'll go you a shilling."}, {"wordtype": "Noun", "description": "Act; working; operation."}, {"wordtype": "Noun", "description": "A circumstance or occurrence; an incident."}, {"wordtype": "Noun", "description": "The fashion or mode; as, quite the go."}, {"wordtype": "Noun", "description": "Noisy merriment; as, a high go."}, {"wordtype": "Noun", "description": "A glass of spirits."}, {"wordtype": "Noun", "description": "Power of going or doing; energy; vitality; perseverance; push; as, there is no go in him."}, {"wordtype": "Noun", "description": "That condition in the course of the game when a player can not lay down a card which will not carry the aggregate count above thirty-one."}]}