{"definitions": [{"wordtype": "Adjective", "description": "Possessing desirable qualities; adapted to answer the end designed; promoting success, welfare, or happiness; serviceable; useful; fit; excellent; admirable; commendable; not bad, corrupt, evil, noxious, offensive, or troublesome, etc."}, {"wordtype": "Adjective", "description": "Possessing moral excellence or virtue; virtuous; pious; religious; -- said of persons or actions."}, {"wordtype": "Adjective", "description": "Kind; benevolent; humane; merciful; gracious; polite; propitious; friendly; well-disposed; -- often followed by to or toward, also formerly by unto."}, {"wordtype": "Adjective", "description": "Serviceable; suited; adapted; suitable; of use; to be relied upon; -- followed especially by for."}, {"wordtype": "Adjective", "description": "Clever; skillful; dexterous; ready; handy; -- followed especially by at."}, {"wordtype": "Adjective", "description": "Adequate; sufficient; competent; sound; not fallacious; valid; in a commercial sense, to be depended on for the discharge of obligations incurred; having pecuniary ability; of unimpaired credit."}, {"wordtype": "Adjective", "description": "Real; actual; serious; as in the phrases in good earnest; in good sooth."}, {"wordtype": "Adjective", "description": "Not small, insignificant, or of no account; considerable; esp., in the phrases a good deal, a good way, a good degree, a good share or part, etc."}, {"wordtype": "Adjective", "description": "Not lacking or deficient; full; complete."}, {"wordtype": "Adjective", "description": "Not blemished or impeached; fair; honorable; unsullied; as in the phrases a good name, a good report, good repute, etc."}, {"wordtype": "Noun", "description": "That which possesses desirable qualities, promotes success, welfare, or happiness, is serviceable, fit, excellent, kind, benevolent, etc.; -- opposed to evil."}, {"wordtype": "Noun", "description": "Advancement of interest or happiness; welfare; prosperity; advantage; benefit; -- opposed to harm, etc."}, {"wordtype": "Noun", "description": "Wares; commodities; chattels; -- formerly used in the singular in a collective sense. In law, a comprehensive name for almost all personal property as distinguished from land or real property."}, {"wordtype": "Adverb", "description": "Well, -- especially in the phrase as good, with a following as expressed or implied; equally well with as much advantage or as little harm as possible."}, {"wordtype": "Transitive Verb", "description": "To make good; to turn to good."}, {"wordtype": "Transitive Verb", "description": "To manure; to improve."}]}