{"definitions": [{"wordtype": "Noun", "description": "The exercise of love, kindness, mercy, favor; disposition to benefit or serve another; favor bestowed or privilege conferred."}, {"wordtype": "Noun", "description": "The divine favor toward man; the mercy of God, as distinguished from His justice; also, any benefits His mercy imparts; divine love or pardon; a state of acceptance with God; enjoyment of the divine favor."}, {"wordtype": "Noun", "description": "The prerogative of mercy execised by the executive, as pardon."}, {"wordtype": "Noun", "description": "The same prerogative when exercised in the form of equitable relief through chancery."}, {"wordtype": "Noun", "description": "Fortune; luck; -- used commonly with hard or sorry when it means misfortune."}, {"wordtype": "Noun", "description": "Inherent excellence; any endowment or characteristic fitted to win favor or confer pleasure or benefit."}, {"wordtype": "Noun", "description": "Beauty, physical, intellectual, or moral; loveliness; commonly, easy elegance of manners; perfection of form."}, {"wordtype": "Noun", "description": "Graceful and beautiful females, sister goddesses, represented by ancient writers as the attendants sometimes of Apollo but oftener of Venus. They were commonly mentioned as three in number; namely, Aglaia, Euphrosyne, and Thalia, and were regarded as the inspirers of the qualities which give attractiveness to wisdom, love, and social intercourse."}, {"wordtype": "Noun", "description": "The title of a duke, a duchess, or an archbishop, and formerly of the king of England."}, {"wordtype": "Noun", "description": "Thanks."}, {"wordtype": "Noun", "description": "A petition for grace; a blessing asked, or thanks rendered, before or after a meal."}, {"wordtype": "Noun", "description": "Ornamental notes or short passages, either introduced by the performer, or indicated by the composer, in which case the notation signs are called grace notes, appeggiaturas, turns, etc."}, {"wordtype": "Noun", "description": "An act, vote, or decree of the government of the institution; a degree or privilege conferred by such vote or decree."}, {"wordtype": "Noun", "description": "A play designed to promote or display grace of motion. It consists in throwing a small hoop from one player to another, by means of two sticks in the hands of each. Called also grace hoop or hoops."}, {"wordtype": "Transitive Verb", "description": "To adorn; to decorate; to embellish and dignify."}, {"wordtype": "Transitive Verb", "description": "To dignify or raise by an act of favor; to honor."}, {"wordtype": "Transitive Verb", "description": "To supply with heavenly grace."}, {"wordtype": "Transitive Verb", "description": "To add grace notes, cadenzas, etc., to."}]}