{"definitions": [{"wordtype": "Noun", "description": "A single small hard seed; a kernel, especially of  those plants, like wheat, whose seeds are used for food."}, {"wordtype": "Noun", "description": "The fruit of certain grasses which furnish the chief food of man, as corn, wheat, rye, oats, etc., or the plants themselves; -- used collectively."}, {"wordtype": "Noun", "description": "Any small, hard particle, as of sand, sugar, salt, etc.; hence, any minute portion or particle; as, a grain of gunpowder, of pollen, of starch, of sense, of wit, etc."}, {"wordtype": "Noun", "description": "The unit of the English system of weights; -- so called because considered equal to the average of grains taken from the middle of the ears of wheat. 7,000 grains constitute the pound avoirdupois, and 5,760 grains the pound troy.  A grain is equal to .0648 gram. See Gram. "}, {"wordtype": "Noun", "description": "A reddish dye made from the coccus insect, or kermes; hence, a red color of any tint or hue, as crimson, scarlet, etc.; sometimes used by the poets as equivalent to Tyrian purple."}, {"wordtype": "Noun", "description": "The composite particles of any substance; that arrangement of the particles of any body which determines its comparative roughness or hardness; texture; as, marble, sugar, sandstone, etc., of fine grain."}, {"wordtype": "Noun", "description": "The direction, arrangement, or appearance of the fibers in wood, or of the strata in stone, slate, etc."}, {"wordtype": "Noun", "description": "The fiber which forms the substance of wood or of any fibrous material."}, {"wordtype": "Noun", "description": "The hair side of a piece of leather, or the marking on that side."}, {"wordtype": "Noun", "description": "The remains of grain, etc., after brewing or distillation; hence, any residuum. Also called draff."}, {"wordtype": "Noun", "description": "A rounded prominence on the back of a sepal, as in the common dock. See Grained, a., 4."}, {"wordtype": "Adjective", "description": "Temper; natural disposition; inclination."}, {"wordtype": "Adjective", "description": "A sort of spice, the grain of paradise."}, {"wordtype": "Transitive Verb", "description": "To paint in imitation of the grain of wood, marble, etc."}, {"wordtype": "Transitive Verb", "description": "To form (powder, sugar, etc.) into grains."}, {"wordtype": "Transitive Verb", "description": "To take the hair off (skins); to soften and raise the grain of (leather, etc.)."}, {"wordtype": "Noun", "description": "To yield fruit."}, {"wordtype": "Noun", "description": "To form grains, or to assume a granular ferm, as the result of crystallization; to granulate."}, {"wordtype": "Noun", "description": "A branch of a tree; a stalk or stem of a plant."}, {"wordtype": "Noun", "description": "A tine, prong, or fork."}, {"wordtype": "Noun", "description": "One the branches of a valley or of a river."}, {"wordtype": "Noun", "description": "An iron first speak or harpoon, having four or more barbed points."}, {"wordtype": "Noun", "description": "A blade of a sword, knife, etc."}, {"wordtype": "Noun", "description": "A thin piece of metal, used in a mold to steady a core."}]}