{"definitions": [{"wordtype": "Past Participle", "description": "of Grind"}, {"wordtype": "Noun", "description": "The surface of the earth; the outer crust of the globe, or some indefinite portion of it."}, {"wordtype": "Noun", "description": "A floor or pavement supposed to rest upon the earth."}, {"wordtype": "Noun", "description": "Any definite portion of the earth's surface; region; territory; country. Hence: A territory appropriated to, or resorted to, for a particular purpose; the field or place of action; as, a hunting or fishing ground; a play ground."}, {"wordtype": "Noun", "description": "Land; estate; possession; field; esp. (pl.), the gardens, lawns, fields, etc., belonging to a homestead; as, the grounds of the estate are well kept."}, {"wordtype": "Noun", "description": "The basis on which anything rests; foundation. Hence: The foundation of knowledge, belief, or conviction; a premise, reason, or datum; ultimate or first principle; cause of existence or occurrence; originating force or agency; as, the ground of my hope."}, {"wordtype": "Noun", "description": "That surface upon which the figures of a composition are set, and which relieves them by its plainness, being either of one tint or of tints but slightly contrasted with one another; as, crimson Bowers on a white ground."}, {"wordtype": "Noun", "description": "In sculpture, a flat surface upon which figures are raised in relief."}, {"wordtype": "Noun", "description": "In point lace, the net of small meshes upon which the embroidered pattern is applied; as, Brussels ground. See Brussels lace, under Brussels."}, {"wordtype": "Noun", "description": "A gummy composition spread over the surface of a metal to be etched, to prevent the acid from eating except where an opening is made by the needle."}, {"wordtype": "Noun", "description": "One of the pieces of wood, flush with the plastering, to which moldings, etc., are attached; -- usually in the plural."}, {"wordtype": "Noun", "description": "A composition in which the bass, consisting of a few bars of independent notes, is continually repeated to a varying melody."}, {"wordtype": "Noun", "description": "The tune on which descants are raised; the plain song."}, {"wordtype": "Noun", "description": "A conducting connection with the earth, whereby the earth is made part of an electrical circuit."}, {"wordtype": "Noun", "description": "Sediment at the bottom of liquors or liquids; dregs; lees; feces; as, coffee grounds."}, {"wordtype": "Noun", "description": "The pit of a theater."}, {"wordtype": "Transitive Verb", "description": "To lay, set, or run, on the ground."}, {"wordtype": "Transitive Verb", "description": "To found; to fix or set, as on a foundation, reason, or principle; to furnish a ground for; to fix firmly."}, {"wordtype": "Transitive Verb", "description": "To instruct in elements or first principles."}, {"wordtype": "Transitive Verb", "description": "To connect with the ground so as to make the earth a part of an electrical circuit."}, {"wordtype": "Transitive Verb", "description": "To cover with a ground, as a copper plate for etching (see Ground, n., 5); or as paper or other materials with a uniform tint as a preparation for ornament."}, {"wordtype": "Verb Intransitive", "description": "To run aground; to strike the bottom and remain fixed; as, the ship grounded on the bar."}]}