{"definitions": [{"wordtype": "Noun", "description": "That part of the fore limb below the forearm or wrist in man and monkeys, and the corresponding part in many other animals; manus; paw. See Manus."}, {"wordtype": "Noun", "description": "That which resembles, or to some extent performs the office of, a human hand"}, {"wordtype": "Noun", "description": "A limb of certain animals, as the foot of a hawk, or any one of the four extremities of a monkey."}, {"wordtype": "Noun", "description": "An index or pointer on a dial; as, the hour or minute hand of a clock."}, {"wordtype": "Noun", "description": "A measure equal to a hand's breadth, -- four inches; a palm. Chiefly used in measuring the height of horses."}, {"wordtype": "Noun", "description": "Side; part; direction, either right or left."}, {"wordtype": "Noun", "description": "Power of performance; means of execution; ability; skill; dexterity."}, {"wordtype": "Noun", "description": "Actual performance; deed; act; workmanship; agency; hence, manner of performance."}, {"wordtype": "Noun", "description": "An agent; a servant, or laborer; a workman, trained or competent for special service or duty; a performer more or less skillful; as, a deck hand; a farm hand; an old hand at speaking."}, {"wordtype": "Noun", "description": "Handwriting; style of penmanship; as, a good, bad or running hand. Hence, a signature."}, {"wordtype": "Noun", "description": "Personal possession; ownership; hence, control; direction; management; -- usually in the plural."}, {"wordtype": "Noun", "description": "Agency in transmission from one person to another; as, to buy at first hand, that is, from the producer, or when new; at second hand, that is, when no longer in the producer's hand, or when not new."}, {"wordtype": "Noun", "description": "Rate; price."}, {"wordtype": "Noun", "description": "That which is, or may be, held in a hand at once"}, {"wordtype": "Noun", "description": "The quota of cards received from the dealer."}, {"wordtype": "Noun", "description": "A bundle of tobacco leaves tied together."}, {"wordtype": "Noun", "description": "The small part of a gunstock near the lock, which is grasped by the hand in taking aim."}, {"wordtype": "Transitive Verb", "description": "To give, pass, or transmit with the hand; as, he handed them the letter."}, {"wordtype": "Transitive Verb", "description": "To lead, guide, or assist with the hand; to conduct; as, to hand a lady into a carriage."}, {"wordtype": "Transitive Verb", "description": "To manage; as, I hand my oar."}, {"wordtype": "Transitive Verb", "description": "To seize; to lay hands on."}, {"wordtype": "Transitive Verb", "description": "To pledge by the hand; to handfast."}, {"wordtype": "Transitive Verb", "description": "To furl; -- said of a sail."}, {"wordtype": "Verb Intransitive", "description": "To cooperate."}]}