{"definitions": [{"wordtype": "Adjective", "description": "Not easily penetrated, cut, or separated into parts; not yielding to pressure; firm; solid; compact; -- applied to material bodies, and opposed to soft; as, hard wood; hard flesh; a hard apple."}, {"wordtype": "Adjective", "description": "Difficult, mentally or judicially; not easily apprehended, decided, or resolved; as a hard problem."}, {"wordtype": "Adjective", "description": "Difficult to accomplish; full of obstacles; laborious; fatiguing; arduous; as, a hard task; a disease hard to cure."}, {"wordtype": "Adjective", "description": "Difficult to resist or control; powerful."}, {"wordtype": "Adjective", "description": "Difficult to bear or endure; not easy to put up with or consent to; hence, severe; rigorous; oppressive; distressing; unjust; grasping; as, a hard lot; hard times; hard fare; a hard winter; hard conditions or terms."}, {"wordtype": "Adjective", "description": "Difficult to please or influence; stern; unyielding; obdurate; unsympathetic; unfeeling; cruel; as, a hard master; a hard heart; hard words; a hard character."}, {"wordtype": "Adjective", "description": "Not easy or agreeable to the taste; stiff; rigid; ungraceful; repelling; as, a hard style."}, {"wordtype": "Adjective", "description": "Rough; acid; sour, as liquors; as, hard cider."}, {"wordtype": "Adjective", "description": "Abrupt or explosive in utterance; not aspirated, sibilated, or pronounced with a gradual change of the organs from one position to another; -- said of certain consonants, as c in came, and g in go, as distinguished from the same letters in center, general, etc."}, {"wordtype": "Adjective", "description": "Wanting softness or smoothness of utterance; harsh; as, a hard tone."}, {"wordtype": "Adjective", "description": "Rigid in the drawing or distribution of the figures; formal; lacking grace of composition."}, {"wordtype": "Adjective", "description": "Having disagreeable and abrupt contrasts in the coloring or light and shade."}, {"wordtype": "Adverb", "description": "With pressure; with urgency; hence, diligently; earnestly."}, {"wordtype": "Adverb", "description": "With difficulty; as, the vehicle moves hard."}, {"wordtype": "Adverb", "description": "Uneasily; vexatiously; slowly."}, {"wordtype": "Adverb", "description": "So as to raise difficulties."}, {"wordtype": "Adverb", "description": "With tension or strain of the powers; violently; with force; tempestuously; vehemently; vigorously; energetically; as, to press, to blow, to rain hard; hence, rapidly; as, to run hard."}, {"wordtype": "Adverb", "description": "Close or near."}, {"wordtype": "Transitive Verb", "description": "To harden; to make hard."}, {"wordtype": "Noun", "description": "A ford or passage across a river or swamp."}]}