{"definitions": [{"wordtype": "Noun", "description": "The anterior or superior part of an animal, containing the brain, or chief ganglia of the nervous system, the mouth, and in the higher animals, the chief sensory organs; poll; cephalon."}, {"wordtype": "Noun", "description": "The uppermost, foremost, or most important part of an inanimate object; such a part as may be considered to resemble the head of an animal; often, also, the larger, thicker, or heavier part or extremity, in distinction from the smaller or thinner part, or from the point or edge; as, the head of a cane, a nail, a spear, an ax, a mast, a sail, a ship; that which covers and closes the top or the end of a hollow vessel; as, the head of a cask or a steam boiler."}, {"wordtype": "Noun", "description": "The place where the head should go; as, the head of a bed, of a grave, etc.; the head of a carriage, that is, the hood which covers the head."}, {"wordtype": "Noun", "description": "The most prominent or important member of any organized body; the chief; the leader; as, the head of a college, a school, a church, a state, and the like."}, {"wordtype": "Noun", "description": "The place or honor, or of command; the most important or foremost position; the front; as, the head of the table; the head of a column of soldiers."}, {"wordtype": "Noun", "description": "Each one among many; an individual; -- often used in a plural sense; as, a thousand head of cattle."}, {"wordtype": "Noun", "description": "The seat of the intellect; the brain; the understanding; the mental faculties; as, a good head, that is, a good mind; it never entered his head, it did not occur to him; of his own head, of his own thought or will."}, {"wordtype": "Noun", "description": "The source, fountain, spring, or beginning, as of a stream or river; as, the head of the Nile; hence, the altitude of the source, or the height of the surface, as of water, above a given place, as above an orifice at which it issues, and the pressure resulting from the height or from motion; sometimes also, the quantity in reserve; as, a mill or reservoir has a good head of water, or ten feet head; also, that part of a gulf or bay most remote from the outlet or the sea."}, {"wordtype": "Noun", "description": "A headland; a promontory; as, Gay Head."}, {"wordtype": "Noun", "description": "A separate part, or topic, of a discourse; a theme to be expanded; a subdivision; as, the heads of a sermon."}, {"wordtype": "Noun", "description": "Culminating point or crisis; hence, strength; force; height."}, {"wordtype": "Noun", "description": "Power; armed force."}, {"wordtype": "Noun", "description": "A headdress; a covering of the head; as, a laced head; a head of hair."}, {"wordtype": "Noun", "description": "An ear of wheat, barley, or of one of the other small cereals."}, {"wordtype": "Noun", "description": "A dense cluster of flowers, as in clover, daisies, thistles; a capitulum."}, {"wordtype": "Noun", "description": "A dense, compact mass of leaves, as in a cabbage or a lettuce plant."}, {"wordtype": "Noun", "description": "The antlers of a deer."}, {"wordtype": "Noun", "description": "A rounded mass of foam which rises on a pot of beer or other effervescing liquor."}, {"wordtype": "Noun", "description": "Tiles laid at the eaves of a house."}, {"wordtype": "Adjective", "description": "Principal; chief; leading; first; as, the head master of a school; the head man of a tribe; a head chorister; a head cook."}, {"wordtype": "Transitive Verb", "description": "To be at the head of; to put one's self at the head of; to lead; to direct; to act as leader to; as, to head an army, an expedition, or a riot."}, {"wordtype": "Transitive Verb", "description": "To form a head to; to fit or furnish with a head; as, to head a nail."}, {"wordtype": "Transitive Verb", "description": "To behead; to decapitate."}, {"wordtype": "Transitive Verb", "description": "To cut off the top of; to lop off; as, to head trees."}, {"wordtype": "Transitive Verb", "description": "To go in front of; to get in the front of, so as to hinder or stop; to oppose; hence, to check or restrain; as, to head a drove of cattle; to head a person; the wind heads a ship."}, {"wordtype": "Transitive Verb", "description": "To set on the head; as, to head a cask."}, {"wordtype": "Verb Intransitive", "description": "To originate; to spring; to have its source, as a river."}, {"wordtype": "Verb Intransitive", "description": "To go or point in a certain direction; to tend; as, how does the ship head?"}, {"wordtype": "Verb Intransitive", "description": "To form a head; as, this kind of cabbage heads early."}]}