{"definitions": [{"wordtype": "Noun", "description": "A hollow, muscular organ, which, by contracting rhythmically, keeps up the circulation of the blood."}, {"wordtype": "Noun", "description": "The seat of the affections or sensibilities, collectively or separately, as love, hate, joy, grief, courage, and the like; rarely, the seat of the understanding or will; -- usually in a good sense, when no epithet is expressed; the better or lovelier part of our nature; the spring of all our actions and purposes; the seat of moral life and character; the moral affections and character itself; the individual disposition and character; as, a good, tender, loving, bad, hard, or selfish heart."}, {"wordtype": "Noun", "description": "The nearest the middle or center; the part most hidden and within; the inmost or most essential part of any body or system; the source of life and motion in any organization; the chief or vital portion; the center of activity, or of energetic or efficient action; as, the heart of a country, of a tree, etc."}, {"wordtype": "Noun", "description": "Courage; courageous purpose; spirit."}, {"wordtype": "Noun", "description": "Vigorous and efficient activity; power of fertile production; condition of the soil, whether good or bad."}, {"wordtype": "Noun", "description": "That which resembles a heart in shape; especially, a roundish or oval figure or object having an obtuse point at one end, and at the other a corresponding indentation, -- used as a symbol or representative of the heart."}, {"wordtype": "Noun", "description": "One of a series of playing cards, distinguished by the figure or figures of a heart; as, hearts are trumps."}, {"wordtype": "Noun", "description": "Vital part; secret meaning; real intention."}, {"wordtype": "Noun", "description": "A term of affectionate or kindly and familiar address."}, {"wordtype": "Transitive Verb", "description": "To give heart to; to hearten; to encourage; to inspirit."}, {"wordtype": "Verb Intransitive", "description": "To form a compact center or heart; as, a hearting cabbage."}]}