{"definitions": ["A force in nature which is recognized in various effects, but especially in the phenomena of fusion and evaporation, and which, as manifested in fire, the sun's rays, mechanical action, chemical combination, etc., becomes directly known to us through the sense of feeling. In its nature heat is a mode if motion, being in general a form of molecular disturbance or vibration. It was formerly supposed to be a subtile, imponderable fluid, to which was given the name caloric.", "The sensation caused by the force or influence of heat when excessive, or above that which is normal to the human body; the bodily feeling experienced on exposure to fire, the sun's rays, etc.; the reverse of cold.", "High temperature, as distinguished from low temperature, or cold; as, the heat of summer and the cold of winter; heat of the skin or body in fever, etc.", "Indication of high temperature; appearance, condition, or color of a body, as indicating its temperature; redness; high color; flush; degree of temperature to which something is heated, as indicated by appearance, condition, or otherwise.", "A single complete operation of heating, as at a forge or in a furnace; as, to make a horseshoe in a certain number of heats.", "A violent action unintermitted; a single effort; a single course in a race that consists of two or more courses; as, he won two heats out of three.", "Utmost violence; rage; vehemence; as, the heat of battle or party.", "Agitation of mind; inflammation or excitement; exasperation.", "Animation, as in discourse; ardor; fervency.", "Sexual excitement in animals.", "Fermentation.", "To make hot; to communicate heat to, or cause to grow warm; as, to heat an oven or furnace, an iron, or the like.", "To excite or make hot by action or emotion; to make feverish.", "To excite ardor in; to rouse to action; to excite to excess; to inflame, as the passions.", "To grow warm or hot by the action of fire or friction, etc., or the communication of heat; as, the iron or the water heats slowly.", "To grow warm or hot by fermentation, or the development of heat by chemical action; as, green hay heats in a mow, and manure in the dunghill.", "Heated; as, the iron though heat red-hot."]}