{"definitions": [{"wordtype": "Adjective", "description": "Having the heaves."}, {"wordtype": "Adjective", "description": "Heaved or lifted with labor; not light; weighty; ponderous; as, a heavy stone; hence, sometimes, large in extent, quantity, or effects; as, a heavy fall of rain or snow; a heavy failure; heavy business transactions, etc.; often implying strength; as, a heavy barrier; also, difficult to move; as, a heavy draught."}, {"wordtype": "Adjective", "description": "Not easy to bear; burdensome; oppressive; hard to endure or accomplish; hence, grievous, afflictive; as, heavy yokes, expenses, undertakings, trials, news, etc."}, {"wordtype": "Adjective", "description": "Laden with that which is weighty; encumbered; burdened; bowed down, either with an actual burden, or with care, grief, pain, disappointment."}, {"wordtype": "Adjective", "description": "Slow; sluggish; inactive; or lifeless, dull, inanimate, stupid; as, a heavy gait, looks, manners, style, and the like; a heavy writer or book."}, {"wordtype": "Adjective", "description": "Strong; violent; forcible; as, a heavy sea, storm, cannonade, and the like."}, {"wordtype": "Adjective", "description": "Loud; deep; -- said of sound; as, heavy thunder."}, {"wordtype": "Adjective", "description": "Dark with clouds, or ready to rain; gloomy; -- said of the sky."}, {"wordtype": "Adjective", "description": "Impeding motion; cloggy; clayey; -- said of earth; as, a heavy road, soil, and the like."}, {"wordtype": "Adjective", "description": "Not raised or made light; as, heavy bread."}, {"wordtype": "Adjective", "description": "Not agreeable to, or suitable for, the stomach; not easily digested; -- said of food."}, {"wordtype": "Adjective", "description": "Having much body or strength; -- said of wines, or other liquors."}, {"wordtype": "Adjective", "description": "With child; pregnant."}, {"wordtype": "Adverb", "description": "Heavily; -- sometimes used in composition; as, heavy-laden."}, {"wordtype": "Transitive Verb", "description": "To make heavy."}]}