{"definitions": [{"wordtype": "Verb Intransitive", "description": "To lean or tip to one side, as a ship; as, the ship heels aport; the boat heeled over when the squall struck it."}, {"wordtype": "Noun", "description": "The hinder part of the foot; sometimes, the whole foot; -- in man or quadrupeds."}, {"wordtype": "Noun", "description": "The hinder part of any covering for the foot, as of a shoe, sock, etc.; specif., a solid part projecting downward from the hinder part of the sole of a boot or shoe."}, {"wordtype": "Noun", "description": "The latter or remaining part of anything; the closing or concluding part."}, {"wordtype": "Noun", "description": "Anything regarded as like a human heel in shape; a protuberance; a knob."}, {"wordtype": "Noun", "description": "The part of a thing corresponding in position to the human heel; the lower part, or part on which a thing rests"}, {"wordtype": "Noun", "description": "The after end of a ship's keel."}, {"wordtype": "Noun", "description": "The lower end of a mast, a boom, the bowsprit, the sternpost, etc."}, {"wordtype": "Noun", "description": "In a small arm, the corner of the but which is upwards in the firing position."}, {"wordtype": "Noun", "description": "The uppermost part of the blade of a sword, next to the hilt."}, {"wordtype": "Noun", "description": "The part of any tool next the tang or handle; as, the heel of a scythe."}, {"wordtype": "Noun", "description": "Management by the heel, especially the spurred heel; as, the horse understands the heel well."}, {"wordtype": "Noun", "description": "The lower end of a timber in a frame, as a post or rafter. In the United States, specif., the obtuse angle of the lower end of a rafter set sloping."}, {"wordtype": "Noun", "description": "A cyma reversa; -- so called by workmen."}, {"wordtype": "Transitive Verb", "description": "To perform by the use of the heels, as in dancing, running, and the like."}, {"wordtype": "Transitive Verb", "description": "To add a heel to; as, to heel a shoe."}, {"wordtype": "Transitive Verb", "description": "To arm with a gaff, as a cock for fighting."}]}