{"definitions": [{"wordtype": "Verb Intransitive", "description": "To hie."}, {"wordtype": "Adjective", "description": "Elevated above any starting point of measurement, as a line, or surface; having altitude; lifted up; raised or extended in the direction of the zenith; lofty; tall; as, a high mountain, tower, tree; the sun is high."}, {"wordtype": "Adjective", "description": "Regarded as raised up or elevated; distinguished; remarkable; conspicuous; superior; -- used indefinitely or relatively, and often in figurative senses, which are understood from the connection"}, {"wordtype": "Adjective", "description": "Elevated in character or quality, whether moral or intellectual; preeminent; honorable; as, high aims, or motives."}, {"wordtype": "Adjective", "description": "Exalted in social standing or general estimation, or in rank, reputation, office, and the like; dignified; as, she was welcomed in the highest circles."}, {"wordtype": "Adjective", "description": "Of noble birth; illustrious; as, of high family."}, {"wordtype": "Adjective", "description": "Of great strength, force, importance, and the like; strong; mighty; powerful; violent; sometimes, triumphant; victorious; majestic, etc.; as, a high wind; high passions."}, {"wordtype": "Adjective", "description": "Very abstract; difficult to comprehend or surmount; grand; noble."}, {"wordtype": "Adjective", "description": "Costly; dear in price; extravagant; as, to hold goods at a high price."}, {"wordtype": "Adjective", "description": "Arrogant; lofty; boastful; proud; ostentatious; -- used in a bad sense."}, {"wordtype": "Adjective", "description": "Possessing a characteristic quality in a supreme or superior degree; as, high (i. e., intense) heat; high (i. e., full or quite) noon; high (i. e., rich or spicy) seasoning; high (i. e., complete) pleasure; high (i. e., deep or vivid) color; high (i. e., extensive, thorough) scholarship, etc."}, {"wordtype": "Adjective", "description": "Strong-scented; slightly tainted; as, epicures do not cook game before it is high."}, {"wordtype": "Adjective", "description": "Acute or sharp; -- opposed to grave or low; as, a high note."}, {"wordtype": "Adjective", "description": "Made with a high position of some part of the tongue in relation to the palate, as / (/ve), / (f/d). See Guide to Pronunciation, // 10, 11."}, {"wordtype": "Adverb", "description": "In a high manner; in a high place; to a great altitude; to a great degree; largely; in a superior manner; eminently; powerfully."}, {"wordtype": "Noun", "description": "An elevated place; a superior region; a height; the sky; heaven."}, {"wordtype": "Noun", "description": "People of rank or high station; as, high and low."}, {"wordtype": "Noun", "description": "The highest card dealt or drawn."}, {"wordtype": "Verb Intransitive", "description": "To rise; as, the sun higheth."}]}