{"definitions": ["The whole interior portion of a vessel below the lower deck, in which the cargo is stowed.", "To cause to remain in a given situation, position, or relation, within certain limits, or the like; to prevent from falling or escaping; to sustain; to restrain; to keep in the grasp; to retain.", "To retain in one's keeping; to maintain possession of, or authority over; not to give up or relinquish; to keep; to defend.", "To have; to possess; to be in possession of; to occupy; to derive title to; as, to hold office.", "To impose restraint upon; to limit in motion or action; to bind legally or morally; to confine; to restrain.", "To maintain in being or action; to carry on; to prosecute, as a course of conduct or an argument; to continue; to sustain.", "To prosecute, have, take, or join in, as something which is the result of united action; as to, hold a meeting, a festival, a session, etc.; hence, to direct and bring about officially; to conduct or preside at; as, the general held a council of war; a judge holds a court; a clergyman holds a service.", "To receive and retain; to contain as a vessel; as, this pail holds milk; hence, to be able to receive and retain; to have capacity or containing power for.", "To accept, as an opinion; to be the adherent of, openly or privately; to persist in, as a purpose; to maintain; to sustain.", "To consider; to regard; to esteem; to account; to think; to judge.", "To bear, carry, or manage; as he holds himself erect; he holds his head high.", "In general, to keep one's self in a given position or condition; to remain fixed. Hence:", "Not to more; to halt; to stop;-mostly in the imperative.", "Not to give way; not to part or become separated; to remain unbroken or unsubdued.", "Not to fail or be found wanting; to continue; to last; to endure a test or trial; to abide; to persist.", "Not to fall away, desert, or prove recreant; to remain attached; to cleave;-often with with, to, or for.", "To restrain one's self; to refrain.", "To derive right or title; -- generally with of.", "The act of holding, as in or with the hands or arms; the manner of holding, whether firm or loose; seizure; grasp; clasp; gripe; possession; -- often used with the verbs take and lay.", "The authority or ground to take or keep; claim.", "Binding power and influence.", "Something that may be grasped; means of support.", "A place of confinement; a prison; confinement; custody; guard.", "A place of security; a fortified place; a fort; a castle; -- often called a stronghold.", "A character [thus /] placed over or under a note or rest, and indicating that it is to be prolonged; -- called also pause, and corona."]}