{"definitions": [{"wordtype": "Noun", "description": "A hard, projecting, and usually pointed organ, growing upon the heads of certain animals, esp. of the ruminants, as cattle, goats, and the like. The hollow horns of the Ox family consist externally of true horn, and are never shed."}, {"wordtype": "Noun", "description": "The antler of a deer, which is of bone throughout, and annually shed and renewed."}, {"wordtype": "Noun", "description": "Any natural projection or excrescence from an animal, resembling or thought to resemble a horn in substance or form; esp.: (a) A projection from the beak of a bird, as in the hornbill. (b) A tuft of feathers on the head of a bird, as in the horned owl. (c) A hornlike projection from the head or thorax of an insect, or the head of a reptile, or fish. (d) A sharp spine in front of the fins of a fish, as in the horned pout."}, {"wordtype": "Noun", "description": "An incurved, tapering and pointed appendage found in the flowers of the milkweed (Asclepias)."}, {"wordtype": "Noun", "description": "Something made of a horn, or in resemblance of a horn"}, {"wordtype": "Noun", "description": "A wind instrument of music; originally, one made of a horn (of an ox or a ram); now applied to various elaborately wrought instruments of brass or other metal, resembling a horn in shape."}, {"wordtype": "Noun", "description": "A drinking cup, or beaker, as having been originally made of the horns of cattle."}, {"wordtype": "Noun", "description": "The cornucopia, or horn of plenty."}, {"wordtype": "Noun", "description": "A vessel made of a horn; esp., one designed for containing powder; anciently, a small vessel for carrying liquids."}, {"wordtype": "Noun", "description": "The pointed beak of an anvil."}, {"wordtype": "Noun", "description": "The high pommel of a saddle; also, either of the projections on a lady's saddle for supporting the leg."}, {"wordtype": "Noun", "description": "The Ionic volute."}, {"wordtype": "Noun", "description": "The outer end of a crosstree; also, one of the projections forming the jaws of a gaff, boom, etc."}, {"wordtype": "Noun", "description": "A curved projection on the fore part of a plane."}, {"wordtype": "Noun", "description": "One of the projections at the four corners of the Jewish altar of burnt offering."}, {"wordtype": "Noun", "description": "One of the curved ends of a crescent; esp., an extremity or cusp of the moon when crescent-shaped."}, {"wordtype": "Noun", "description": "The curving extremity of the wing of an army or of a squadron drawn up in a crescentlike form."}, {"wordtype": "Noun", "description": "The tough, fibrous material of which true horns are composed, being, in the Ox family, chiefly albuminous, with some phosphate of lime; also, any similar substance, as that which forms the hoof crust of horses, sheep, and cattle; as, a spoon of horn."}, {"wordtype": "Noun", "description": "A symbol of strength, power, glory, exaltation, or pride."}, {"wordtype": "Noun", "description": "An emblem of a cuckold; -- used chiefly in the plural."}, {"wordtype": "Transitive Verb", "description": "To furnish with horns; to give the shape of a horn to."}, {"wordtype": "Transitive Verb", "description": "To cause to wear horns; to cuckold."}]}