{"definitions": [{"wordtype": "Noun", "description": "A hoofed quadruped of the genus Equus; especially, the domestic horse (E. caballus), which was domesticated in Egypt and Asia at a very early period. It has six broad molars, on each side of each jaw, with six incisors, and two canine teeth, both above and below. The mares usually have the canine teeth rudimentary or wanting. The horse differs from the true asses, in having a long, flowing mane, and the tail bushy to the base. Unlike the asses it has callosities, or chestnuts, on all its legs. The horse excels in strength, speed, docility, courage, and nobleness of character, and is used for drawing, carrying, bearing a rider, and like purposes."}, {"wordtype": "Noun", "description": "The male of the genus horse, in distinction from the female or male; usually, a castrated male."}, {"wordtype": "Noun", "description": "Mounted soldiery; cavalry; -- used without the plural termination; as, a regiment of horse; -- distinguished from foot."}, {"wordtype": "Noun", "description": "A frame with legs, used to support something; as, a clotheshorse, a sawhorse, etc."}, {"wordtype": "Noun", "description": "A frame of timber, shaped like a horse, on which soldiers were made to ride for punishment."}, {"wordtype": "Noun", "description": "Anything, actual or figurative, on which one rides as on a horse; a hobby."}, {"wordtype": "Noun", "description": "A mass of earthy matter, or rock of the same character as the wall rock, occurring in the course of a vein, as of coal or ore; hence, to take horse -- said of a vein -- is to divide into branches for a distance."}, {"wordtype": "Noun", "description": "See Footrope, a."}, {"wordtype": "Adjective", "description": "A breastband for a leadsman."}, {"wordtype": "Adjective", "description": "An iron bar for a sheet traveler to slide upon."}, {"wordtype": "Adjective", "description": "A jackstay."}, {"wordtype": "Transitive Verb", "description": "To provide with a horse, or with horses; to mount on, or as on, a horse."}, {"wordtype": "Transitive Verb", "description": "To sit astride of; to bestride."}, {"wordtype": "Transitive Verb", "description": "To cover, as a mare; -- said of the male."}, {"wordtype": "Transitive Verb", "description": "To take or carry on the back; as, the keeper, horsing a deer."}, {"wordtype": "Transitive Verb", "description": "To place on the back of another, or on a wooden horse, etc., to be flogged; to subject to such punishment."}, {"wordtype": "Verb Intransitive", "description": "To get on horseback."}]}