{"definitions": [{"wordtype": "Noun", "description": "A structure intended or used as a habitation or shelter for animals of any kind; but especially, a building or edifice for the habitation of man; a dwelling place, a mansion."}, {"wordtype": "Noun", "description": "Household affairs; domestic concerns; particularly in the phrase to keep house. See below."}, {"wordtype": "Noun", "description": "Those who dwell in the same house; a household."}, {"wordtype": "Noun", "description": "A family of ancestors, descendants, and kindred; a race of persons from the same stock; a tribe; especially, a noble family or an illustrious race; as, the house of Austria; the house of Hanover; the house of Israel."}, {"wordtype": "Noun", "description": "One of the estates of a kingdom or other government assembled in parliament or legislature; a body of men united in a legislative capacity; as, the House of Lords; the House of Commons; the House of Representatives; also, a quorum of such a body. See Congress, and Parliament."}, {"wordtype": "Noun", "description": "A firm, or commercial establishment."}, {"wordtype": "Noun", "description": "A public house; an inn; a hotel."}, {"wordtype": "Noun", "description": "A twelfth part of the heavens, as divided by six circles intersecting at the north and south points of the horizon, used by astrologers in noting the positions of the heavenly bodies, and casting horoscopes or nativities. The houses were regarded as fixed in respect to the horizon, and numbered from the one at the eastern horizon, called the ascendant, first house, or house of life, downward, or in the direction of the earth's revolution, the stars and planets passing through them in the reverse order every twenty-four hours."}, {"wordtype": "Noun", "description": "A square on a chessboard, regarded as the proper place of a piece."}, {"wordtype": "Noun", "description": "An audience; an assembly of hearers, as at a lecture, a theater, etc.; as, a thin or a full house."}, {"wordtype": "Noun", "description": "The body, as the habitation of the soul."}, {"wordtype": "Noun", "description": "The grave."}, {"wordtype": "Transitive Verb", "description": "To take or put into a house; to shelter under a roof; to cover from the inclemencies of the weather; to protect by covering; as, to house one's family in a comfortable home; to house farming utensils; to house cattle."}, {"wordtype": "Transitive Verb", "description": "To drive to a shelter."}, {"wordtype": "Transitive Verb", "description": "To admit to residence; to harbor."}, {"wordtype": "Transitive Verb", "description": "To deposit and cover, as in the grave."}, {"wordtype": "Transitive Verb", "description": "To stow in a safe place; to take down and make safe; as, to house the upper spars."}, {"wordtype": "Verb Intransitive", "description": "To take shelter or lodging; to abide to dwell; to lodge."}, {"wordtype": "Verb Intransitive", "description": "To have a position in one of the houses. See House, n., 8."}]}