{"definitions": [{"wordtype": "Noun", "description": "A large tree, the Artocarpus integrifolia, common in the East Indies, closely allied to the breadfruit, from which it differs in having its leaves entire. The fruit is of great size, weighing from thirty to forty pounds, and through its soft fibrous matter are scattered the seeds, which are roasted and eaten. The wood is of a yellow color, fine grain, and rather heavy, and is much used in cabinetwork. It is also used for dyeing a brilliant yellow."}, {"wordtype": "Noun", "description": "A familiar nickname of, or substitute for, John."}, {"wordtype": "Noun", "description": "An impertinent or silly fellow; a simpleton; a boor; a clown; also, a servant; a rustic."}, {"wordtype": "Noun", "description": "A popular colloquial name for a sailor; -- called also Jack tar, and Jack afloat."}, {"wordtype": "Noun", "description": "A mechanical contrivance, an auxiliary machine, or a subordinate part of a machine, rendering convenient service, and often supplying the place of a boy or attendant who was commonly called Jack"}, {"wordtype": "Noun", "description": "A device to pull off boots."}, {"wordtype": "Noun", "description": "A sawhorse or sawbuck."}, {"wordtype": "Noun", "description": "A machine or contrivance for turning a spit; a smoke jack, or kitchen jack."}, {"wordtype": "Noun", "description": "A wooden wedge for separating rocks rent by blasting."}, {"wordtype": "Noun", "description": "A lever for depressing the sinkers which push the loops down on the needles."}, {"wordtype": "Noun", "description": "A grating to separate and guide the threads; a heck box."}, {"wordtype": "Noun", "description": "A machine for twisting the sliver as it leaves the carding machine."}, {"wordtype": "Noun", "description": "A compact, portable machine for planing metal."}, {"wordtype": "Noun", "description": "A machine for slicking or pebbling leather."}, {"wordtype": "Noun", "description": "A system of gearing driven by a horse power, for multiplying speed."}, {"wordtype": "Noun", "description": "A hood or other device placed over a chimney or vent pipe, to prevent a back draught."}, {"wordtype": "Noun", "description": "In the harpsichord, an intermediate piece communicating the action of the key to the quill; -- called also hopper."}, {"wordtype": "Noun", "description": "In hunting, the pan or frame holding the fuel of the torch used to attract game at night; also, the light itself."}, {"wordtype": "Noun", "description": "A portable machine variously constructed, for exerting great pressure, or lifting or moving a heavy body through a small distance. It consists of a lever, screw, rack and pinion, hydraulic press, or any simple combination of mechanical powers, working in a compact pedestal or support and operated by a lever, crank, capstan bar, etc. The name is often given to a jackscrew, which is a kind of jack."}, {"wordtype": "Noun", "description": "The small bowl used as a mark in the game of bowls."}, {"wordtype": "Noun", "description": "The male of certain animals, as of the ass."}, {"wordtype": "Noun", "description": "A young pike; a pickerel."}, {"wordtype": "Noun", "description": "The jurel."}, {"wordtype": "Noun", "description": "A large, California rock fish (Sebastodes paucispinus); -- called also boccaccio, and merou."}, {"wordtype": "Noun", "description": "The wall-eyed pike."}, {"wordtype": "Noun", "description": "A drinking measure holding half a pint; also, one holding a quarter of a pint."}, {"wordtype": "Noun", "description": "A flag, containing only the union, without the fly, usually hoisted on a jack staff at the bowsprit cap; -- called also union jack. The American jack is a small blue flag, with a star for each State."}, {"wordtype": "Noun", "description": "A bar of iron athwart ships at a topgallant masthead, to support a royal mast, and give spread to the royal shrouds; -- called also jack crosstree."}, {"wordtype": "Noun", "description": "The knave of a suit of playing cards."}, {"wordtype": "Noun", "description": "A coarse and cheap mediaeval coat of defense, esp. one made of leather."}, {"wordtype": "Noun", "description": "A pitcher or can of waxed leather; -- called also black jack."}, {"wordtype": "Verb Intransitive", "description": "To hunt game at night by means of a jack. See 2d Jack, n., 4, n."}, {"wordtype": "Transitive Verb", "description": "To move or lift, as a house, by means of a jack or jacks. See 2d Jack, n., 5."}]}