{"definitions": [{"wordtype": "Verb Intransitive", "description": "A public officer who is invested with authority to hear and determine litigated causes, and to administer justice between parties in courts held for that purpose."}, {"wordtype": "Verb Intransitive", "description": "One who has skill, knowledge, or experience, sufficient to decide on the merits of a question, or on the quality or value of anything; one who discerns properties or relations with skill and readiness; a connoisseur; an expert; a critic."}, {"wordtype": "Verb Intransitive", "description": "A person appointed to decide in a/trial of skill, speed, etc., between two or more parties; an umpire; as, a judge in a horse race."}, {"wordtype": "Verb Intransitive", "description": "One of supreme magistrates, with both civil and military powers, who governed Israel for more than four hundred years."}, {"wordtype": "Verb Intransitive", "description": "The title of the seventh book of the Old Testament; the Book of Judges."}, {"wordtype": "Adjective", "description": "To hear and determine, as in causes on trial; to decide as a judge; to give judgment; to pass sentence."}, {"wordtype": "Adjective", "description": "To assume the right to pass judgment on another; to sit in judgment or commendation; to criticise or pass adverse judgment upon others. See Judge, v. t., 3."}, {"wordtype": "Transitive Verb", "description": "To compare facts or ideas, and perceive their relations and attributes, and thus distinguish truth from falsehood; to determine; to discern; to distinguish; to form an opinion about."}, {"wordtype": "Transitive Verb", "description": "To hear and determine by authority, as a case before a court, or a controversy between two parties."}, {"wordtype": "Transitive Verb", "description": "To examine and pass sentence on; to try; to doom."}, {"wordtype": "Transitive Verb", "description": "To arrogate judicial authority over; to sit in judgment upon; to be censorious toward."}, {"wordtype": "Transitive Verb", "description": "To determine upon or deliberation; to esteem; to think; to reckon."}, {"wordtype": "Transitive Verb", "description": "To exercise the functions of a magistrate over; to govern."}]}