{"definitions": [{"wordtype": "Transitive Verb", "description": "To care; to desire."}, {"wordtype": "Transitive Verb", "description": "To hold; to restrain from departure or removal; not to let go of; to retain in one's power or possession; not to lose; to retain; to detain."}, {"wordtype": "Transitive Verb", "description": "To cause to remain in a given situation or condition; to maintain unchanged; to hold or preserve in any state or tenor."}, {"wordtype": "Transitive Verb", "description": "To have in custody; to have in some place for preservation; to take charge of."}, {"wordtype": "Transitive Verb", "description": "To preserve from danger, harm, or loss; to guard."}, {"wordtype": "Transitive Verb", "description": "To preserve from discovery or publicity; not to communicate, reveal, or betray, as a secret."}, {"wordtype": "Transitive Verb", "description": "To attend upon; to have the care of; to tend."}, {"wordtype": "Transitive Verb", "description": "To record transactions, accounts, or events in; as, to keep books, a journal, etc.  ; also, to enter (as accounts, records, etc. ) in a book."}, {"wordtype": "Transitive Verb", "description": "To maintain, as an establishment, institution, or the like; to conduct; to manage; as, to keep store."}, {"wordtype": "Transitive Verb", "description": "To supply with necessaries of life; to entertain; as, to keep boarders."}, {"wordtype": "Transitive Verb", "description": "To have in one's service; to have and maintain, as an assistant, a servant, a mistress, a horse, etc."}, {"wordtype": "Transitive Verb", "description": "To have habitually in stock for sale."}, {"wordtype": "Transitive Verb", "description": "To continue in, as a course or mode of action; not to intermit or fall from; to hold to; to maintain; as, to keep silence; to keep one's word; to keep possession."}, {"wordtype": "Transitive Verb", "description": "To observe; to adhere to; to fulfill; not to swerve from or violate; to practice or perform, as duty; not to neglect; to be faithful to."}, {"wordtype": "Transitive Verb", "description": "To confine one's self to; not to quit; to remain in; as, to keep one's house, room, bed, etc.  ; hence, to haunt; to frequent."}, {"wordtype": "Transitive Verb", "description": "To observe duty, as a festival, etc. ; to celebrate; to solemnize; as, to keep a feast."}, {"wordtype": "Verb Intransitive", "description": "To remain in any position or state; to continue; to abide; to stay; as, to keep at a distance; to keep aloft; to keep near; to keep in the house; to keep before or behind; to keep in favor; to keep out of company, or out reach."}, {"wordtype": "Verb Intransitive", "description": "To last; to endure; to remain unimpaired."}, {"wordtype": "Verb Intransitive", "description": "To reside for a time; to lodge; to dwell."}, {"wordtype": "Verb Intransitive", "description": "To take care; to be solicitous; to watch."}, {"wordtype": "Verb Intransitive", "description": "To be in session; as, school keeps to-day."}, {"wordtype": "Noun", "description": "The act or office of keeping; custody; guard; care; heed; charge."}, {"wordtype": "Noun", "description": "The state of being kept; hence, the resulting condition; case; as, to be in good keep."}, {"wordtype": "Noun", "description": "The means or provisions by which one is kept; maintenance; support; as, the keep of a horse."}, {"wordtype": "Noun", "description": "That which keeps or protects; a stronghold; a fortress; a castle; specifically, the strongest and securest part of a castle, often used as a place of residence by the lord of the castle, especially during a siege; the donjon. See Illust. of Castle."}, {"wordtype": "Noun", "description": "That which is kept in charge; a charge."}, {"wordtype": "Noun", "description": "A cap for retaining anything, as a journal box, in place."}]}