{"definitions": [{"wordtype": "Noun", "description": "Physical toil or bodily exertion, especially when fatiguing, irksome, or unavoidable, in distinction from sportive exercise; hard, muscular effort directed to some useful end, as agriculture, manufactures, and like; servile toil; exertion; work."}, {"wordtype": "Noun", "description": "Intellectual exertion; mental effort; as, the labor of compiling a history."}, {"wordtype": "Noun", "description": "That which requires hard work for its accomplishment; that which demands effort."}, {"wordtype": "Noun", "description": "Travail; the pangs and efforts of childbirth."}, {"wordtype": "Noun", "description": "Any pang or distress."}, {"wordtype": "Noun", "description": "The pitching or tossing of a vessel which results in the straining of timbers and rigging."}, {"wordtype": "Noun", "description": "A measure of land in Mexico and Texas, equivalent to an area of 177/ acres."}, {"wordtype": "Noun", "description": "To exert muscular strength; to exert one's strength with painful effort, particularly in servile occupations; to work; to toil."}, {"wordtype": "Noun", "description": "To exert one's powers of mind in the prosecution of any design; to strive; to take pains."}, {"wordtype": "Noun", "description": "To be oppressed with difficulties or disease; to do one's work under conditions which make it especially hard, wearisome; to move slowly, as against opposition, or under a burden; to be burdened; -- often with under, and formerly with of."}, {"wordtype": "Noun", "description": "To be in travail; to suffer the pangs of childbirth."}, {"wordtype": "Noun", "description": "To pitch or roll heavily, as a ship in a turbulent sea."}, {"wordtype": "Transitive Verb", "description": "To work at; to work; to till; to cultivate by toil."}, {"wordtype": "Transitive Verb", "description": "To form or fabricate with toil, exertion, or care."}, {"wordtype": "Transitive Verb", "description": "To prosecute, or perfect, with effort; to urge stre/uously; as, to labor a point or argument."}, {"wordtype": "Transitive Verb", "description": "To belabor; to beat."}]}