{"definitions": [{"wordtype": "Noun", "description": "Urine. See Lant."}, {"wordtype": "Noun", "description": "The solid part of the surface of the earth; -- opposed to water as constituting a part of such surface, especially to oceans and seas; as, to sight land after a long voyage."}, {"wordtype": "Noun", "description": "Any portion, large or small, of the surface of the earth, considered by itself, or as belonging to an individual or a people, as a country, estate, farm, or tract."}, {"wordtype": "Noun", "description": "Ground, in respect to its nature or quality; soil; as, wet land; good or bad land."}, {"wordtype": "Noun", "description": "The inhabitants of a nation or people."}, {"wordtype": "Noun", "description": "The mainland, in distinction from islands."}, {"wordtype": "Noun", "description": "The ground or floor."}, {"wordtype": "Noun", "description": "The ground left unplowed between furrows; any one of several portions into which a field is divided for convenience in plowing."}, {"wordtype": "Noun", "description": "Any ground, soil, or earth whatsoever, as meadows, pastures, woods, etc., and everything annexed to it, whether by nature, as trees, water, etc., or by the hand of man, as buildings, fences, etc.; real estate."}, {"wordtype": "Noun", "description": "The lap of the strakes in a clinker-built boat; the lap of plates in an iron vessel; -- called also landing."}, {"wordtype": "Noun", "description": "In any surface prepared with indentations, perforations, or grooves, that part of the surface which is not so treated, as the level part of a millstone between the furrows, or the surface of the bore of a rifled gun between the grooves."}, {"wordtype": "Transitive Verb", "description": "To set or put on shore from a ship or other water craft; to disembark; to debark."}, {"wordtype": "Transitive Verb", "description": "To catch and bring to shore; to capture; as, to land a fish."}, {"wordtype": "Transitive Verb", "description": "To set down after conveying; to cause to fall, alight, or reach; to bring to the end of a course; as, he landed the quoit near the stake; to be thrown from a horse and landed in the mud; to land one in difficulties or mistakes."}, {"wordtype": "Verb Intransitive", "description": "To go on shore from a ship or boat; to disembark; to come to the end of a course."}]}