{"definitions": ["In general, a rule of being or of conduct, established by an authority able to enforce its will; a controlling regulation; the mode or order according to which an agent or a power acts.", "In morals: The will of God as the rule for the disposition and conduct of all responsible beings toward him and toward each other; a rule of living, conformable to righteousness; the rule of action as obligatory on the conscience or moral nature.", "The Jewish or Mosaic code, and that part of Scripture where it is written, in distinction from the gospel; hence, also, the Old Testament.", "An organic rule, as a constitution or charter, establishing and defining the conditions of the existence of a state or other organized community.", "Any edict, decree, order, ordinance, statute, resolution, judicial, decision, usage, etc., or recognized, and enforced, by the controlling authority.", "In philosophy and physics: A rule of being, operation, or change, so certain and constant that it is conceived of as imposed by the will of God or by some controlling authority; as, the law of gravitation; the laws of motion; the law heredity; the laws of thought; the laws of cause and effect; law of self-preservation.", "In matematics: The rule according to which anything, as the change of value of a variable, or the value of the terms of a series, proceeds; mode or order of sequence.", "In arts, works, games, etc.: The rules of construction, or of procedure, conforming to the conditions of success; a principle, maxim; or usage; as, the laws of poetry, of architecture, of courtesy, or of whist.", "Collectively, the whole body of rules relating to one subject, or emanating from one source; -- including usually the writings pertaining to them, and judicial proceedings under them; as, divine law; English law; Roman law; the law of real property; insurance law.", "Legal science; jurisprudence; the principles of equity; applied justice.", "Trial by the laws of the land; judicial remedy; litigation; as, to go law.", "An oath, as in the presence of a court.", "Same as Lawe, v. t.", "An exclamation of mild surprise."]}