{"definitions": ["One of the elements, a heavy, pliable, inelastic metal, having a bright, bluish color, but easily tarnished. It is both malleable and ductile, though with little tenacity, and is used for tubes, sheets, bullets, etc. Its specific gravity is 11.37. It is easily fusible, forms alloys with other metals, and is an ingredient of solder and type metal. Atomic weight, 206.4. Symbol Pb (L. Plumbum). It is chiefly obtained from the mineral galena, lead sulphide.", "An article made of lead or an alloy of lead", "A plummet or mass of lead, used in sounding at sea.", "A thin strip of type metal, used to separate lines of type in printing.", "Sheets or plates of lead used as a covering for roofs; hence, pl., a roof covered with lead sheets or terne plates.", "A small cylinder of black lead or plumbago, used in pencils.", "To cover, fill, or affect with lead; as, continuous firing leads the grooves of a rifle.", "To place leads between the lines of; as, to lead a page; leaded matter.", "To guide or conduct with the hand, or by means of some physical contact connection; as, a father leads a child; a jockey leads a horse with a halter; a dog leads a blind man.", "To guide or conduct in a certain course, or to a certain place or end, by making the way known; to show the way, esp. by going with or going in advance of. Hence, figuratively: To direct; to counsel; to instruct; as, to lead a traveler; to lead a pupil.", "To conduct or direct with authority; to have direction or charge of; as, to lead an army, an exploring party, or a search; to lead a political party.", "To go or to be in advance of; to precede; hence, to be foremost or chief among; as, the big sloop led the fleet of yachts; the Guards led the attack; Demosthenes leads the orators of all ages.", "To draw or direct by influence, whether good or bad; to prevail on; to induce; to entice; to allure; as, to lead one to espouse a righteous cause.", "To guide or conduct one's self in, through, or along (a certain course); hence, to proceed in the way of; to follow the path or course of; to pass; to spend. Also, to cause (one) to proceed or follow in (a certain course).", "To begin a game, round, or trick, with; as, to lead trumps; the double five was led.", "To guide or conduct, as by accompanying, going before, showing, influencing, directing with authority, etc.; to have precedence or preeminence; to be first or chief; -- used in most of the senses of lead, v. t.", "To tend or reach in a certain direction, or to a certain place; as, the path leads to the mill; gambling leads to other vices.", "The act of leading or conducting; guidance; direction; as, to take the lead; to be under the lead of another.", "precedence; advance position; also, the measure of precedence; as, the white horse had the lead; a lead of a boat's length, or of half a second.", "The act or right of playing first in a game or round; the card suit, or piece, so played; as, your partner has the lead.", "An open way in an ice field.", "A lode.", "The course of a rope from end to end.", "The width of port opening which is uncovered by the valve, for the admission or release of steam, at the instant when the piston is at end of its stroke.", "the distance of haul, as from a cutting to an embankment.", "The action of a tooth, as a tooth of a wheel, in impelling another tooth or a pallet."]}