{"definitions": [{"wordtype": "Noun", "description": "A line or surface to which, at every point, a vertical or plumb line is perpendicular; a line or surface which is everywhere parallel to the surface of still water; -- this is the true level, and is a curve or surface in which all points are equally distant from the center of the earth, or rather would be so if the earth were an exact sphere."}, {"wordtype": "Noun", "description": "A horizontal line or plane; that is, a straight line or a plane which is tangent to a true level at a given point and hence parallel to the horizon at that point; -- this is the apparent level at the given point."}, {"wordtype": "Noun", "description": "An approximately horizontal line or surface at a certain degree of altitude, or distance from the center of the earth; as, to climb from the level of the coast to the level of the plateau and then descend to the level of the valley or of the sea."}, {"wordtype": "Noun", "description": "Hence, figuratively, a certain position, rank, standard, degree, quality, character, etc., conceived of as in one of several planes of different elevation."}, {"wordtype": "Noun", "description": "A uniform or average height; a normal plane or altitude; a condition conformable to natural law or which will secure a level surface; as, moving fluids seek a level."}, {"wordtype": "Noun", "description": "An instrument by which to find a horizontal line, or adjust something with reference to a horizontal line."}, {"wordtype": "Noun", "description": "A measurement of the difference of altitude of two points, by means of a level; as, to take a level."}, {"wordtype": "Noun", "description": "A horizontal passage, drift, or adit, in a mine."}, {"wordtype": "Adjective", "description": "Even; flat; having no part higher than another; having, or conforming to, the curvature which belongs to the undisturbed liquid parts of the earth's surface; as, a level field; level ground; the level surface of a pond or lake."}, {"wordtype": "Adjective", "description": "Coinciding or parallel with the plane of the horizon; horizontal; as, the telescope is now level."}, {"wordtype": "Adjective", "description": "Even with anything else; of the same height; on the same line or plane; on the same footing; of equal importance; -- followed by with, sometimes by to."}, {"wordtype": "Adjective", "description": "Straightforward; direct; clear; open."}, {"wordtype": "Adjective", "description": "Well balanced; even; just; steady; impartial; as, a level head; a level understanding. [Colloq.] "}, {"wordtype": "Adjective", "description": "Of even tone; without rising or falling inflection."}, {"wordtype": "Transitive Verb", "description": "To make level; to make horizontal; to bring to the condition of a level line or surface; hence, to make flat or even; as, to level a road, a walk, or a garden."}, {"wordtype": "Transitive Verb", "description": "To bring to a lower level; to overthrow; to topple down; to reduce to a flat surface; to lower."}, {"wordtype": "Transitive Verb", "description": "To bring to a horizontal position, as a gun; hence, to point in taking aim; to aim; to direct."}, {"wordtype": "Transitive Verb", "description": "Figuratively, to bring to a common level or plane, in respect of rank, condition, character, privilege, etc.; as, to level all the ranks and conditions of men."}, {"wordtype": "Transitive Verb", "description": "To adjust or adapt to a certain level; as, to level remarks to the capacity of children."}, {"wordtype": "Verb Intransitive", "description": "To be level; to be on a level with, or on an equality with, something; hence, to accord; to agree; to suit."}, {"wordtype": "Verb Intransitive", "description": "To aim a gun, spear, etc., horizontally; hence, to aim or point a weapon in direct line with the mark; fig., to direct the eye, mind, or effort, directly to an object."}]}