{"definitions": [{"wordtype": "Noun", "description": "The state of being which begins with generation, birth, or germination, and ends with death; also, the time during which this state continues; that state of an animal or plant in which all or any of its organs are capable of performing all or any of their functions; -- used of all animal and vegetable organisms."}, {"wordtype": "Noun", "description": "Of human beings: The union of the soul and body; also, the duration of their union; sometimes, the deathless quality or existence of the soul; as, man is a creature having an immortal life."}, {"wordtype": "Noun", "description": "The potential principle, or force, by which the organs of animals and plants are started and continued in the performance of their several and cooperative functions; the vital force, whether regarded as physical or spiritual."}, {"wordtype": "Noun", "description": "Figuratively: The potential or animating principle, also, the period of duration, of anything that is conceived of as resembling a natural organism in structure or functions; as, the life of a state, a machine, or a book; authority is the life of government."}, {"wordtype": "Noun", "description": "A certain way or manner of living with respect to conditions, circumstances, character, conduct, occupation, etc.; hence, human affairs; also, lives, considered collectively, as a distinct class or type; as, low life; a good or evil life; the life of Indians, or of miners."}, {"wordtype": "Noun", "description": "Animation; spirit; vivacity; vigor; energy."}, {"wordtype": "Noun", "description": "That which imparts or excites spirit or vigor; that upon which enjoyment or success depends; as, he was the life of the company, or of the enterprise."}, {"wordtype": "Noun", "description": "The living or actual form, person, thing, or state; as, a picture or a description from the life."}, {"wordtype": "Noun", "description": "A person; a living being, usually a human being; as, many lives were sacrificed."}, {"wordtype": "Noun", "description": "The system of animal nature; animals in general, or considered collectively."}, {"wordtype": "Noun", "description": "An essential constituent of life, esp. the blood."}, {"wordtype": "Noun", "description": "A history of the acts and events of a life; a biography; as, Johnson wrote the life of Milton."}, {"wordtype": "Noun", "description": "Enjoyment in the right use of the powers; especially, a spiritual existence; happiness in the favor of God; heavenly felicity."}, {"wordtype": "Noun", "description": "Something dear to one as one's existence; a darling; -- used as a term of endearment."}]}