{"definitions": [{"wordtype": "Noun", "description": "The sky; the atmosphere; the firmament."}, {"wordtype": "Transitive Verb", "description": "To move in a direction opposite to that of gravitation; to raise; to elevate; to bring up from a lower place to a higher; to upheave; sometimes implying a continued support or holding in the higher place; -- said of material things; as, to lift the foot or the hand; to lift a chair or a burden."}, {"wordtype": "Transitive Verb", "description": "To raise, elevate, exalt, improve, in rank, condition, estimation, character, etc.; -- often with up."}, {"wordtype": "Transitive Verb", "description": "To bear; to support."}, {"wordtype": "Transitive Verb", "description": "To collect, as moneys due; to raise."}, {"wordtype": "Transitive Verb", "description": "To steal; to carry off by theft (esp. cattle); as, to lift a drove of cattle."}, {"wordtype": "Verb Intransitive", "description": "To try to raise something; to exert the strength for raising or bearing."}, {"wordtype": "Verb Intransitive", "description": "To rise; to become or appear raised or elevated; as, the fog lifts; the land lifts to a ship approaching it."}, {"wordtype": "Transitive Verb", "description": "To live by theft."}, {"wordtype": "Noun", "description": "Act of lifting; also, that which is lifted."}, {"wordtype": "Noun", "description": "The space or distance through which anything is lifted; as, a long lift."}, {"wordtype": "Noun", "description": "Help; assistance, as by lifting; as, to give one a lift in a wagon."}, {"wordtype": "Noun", "description": "That by means of which a person or thing lifts or is lifted"}, {"wordtype": "Noun", "description": "A hoisting machine; an elevator; a dumb waiter."}, {"wordtype": "Noun", "description": "A handle."}, {"wordtype": "Noun", "description": "An exercising machine."}, {"wordtype": "Noun", "description": "A rise; a degree of elevation; as, the lift of a lock in canals."}, {"wordtype": "Noun", "description": "A lift gate. See Lift gate, below."}, {"wordtype": "Noun", "description": "A rope leading from the masthead to the extremity of a yard below; -- used for raising or supporting the end of the yard."}, {"wordtype": "Noun", "description": "One of the steps of a cone pulley."}, {"wordtype": "Noun", "description": "A layer of leather in the heel."}, {"wordtype": "Noun", "description": "That portion of the vibration of a balance during which the impulse is given."}]}