{"definitions": [{"wordtype": "Noun", "description": "That agent, force, or action in nature by the operation of which upon the organs of sight, objects are rendered visible or luminous."}, {"wordtype": "Noun", "description": "That which furnishes, or is a source of, light, as the sun, a star, a candle, a lighthouse, etc."}, {"wordtype": "Noun", "description": "The time during which the light of the sun is visible; day; especially, the dawn of day."}, {"wordtype": "Noun", "description": "The brightness of the eye or eyes."}, {"wordtype": "Noun", "description": "The medium through which light is admitted, as a window, or window pane; a skylight; in architecture, one of the compartments of a window made by a mullion or mullions."}, {"wordtype": "Noun", "description": "Life; existence."}, {"wordtype": "Noun", "description": "Open view; a visible state or condition; public observation; publicity."}, {"wordtype": "Noun", "description": "The power of perception by vision."}, {"wordtype": "Noun", "description": "That which illumines or makes clear to the mind; mental or spiritual illumination; enlightenment; knowledge; information."}, {"wordtype": "Noun", "description": "Prosperity; happiness; joy; felicity."}, {"wordtype": "Noun", "description": "The manner in which the light strikes upon a picture; that part of a picture which represents those objects upon which the light is supposed to fall; the more illuminated part of a landscape or other scene; -- opposed to shade.  Cf. Chiaroscuro."}, {"wordtype": "Noun", "description": "Appearance due to the particular facts and circumstances presented to view; point of view; as, to state things fairly and put them in the right light."}, {"wordtype": "Noun", "description": "One who is conspicuous or noteworthy; a model or example; as, the lights of the age or of antiquity."}, {"wordtype": "Noun", "description": "A firework made by filling a case with a substance which burns brilliantly with a white or colored flame; as, a Bengal light."}, {"wordtype": "Noun", "description": "To set fire to; to cause to burn; to set burning; to ignite; to kindle; as, to light a candle or lamp; to light the gas; -- sometimes with up."}, {"wordtype": "Noun", "description": "To give light to; to illuminate; to fill with light; to spread over with light; -- often with up."}, {"wordtype": "Noun", "description": "To attend or conduct with a light; to show the way to by means of a light."}, {"wordtype": "Verb Intransitive", "description": "To become ignited; to take fire; as, the match will not light."}, {"wordtype": "Verb Intransitive", "description": "To be illuminated; to receive light; to brighten; -- with up; as, the room lights up very well."}, {"wordtype": "Adjective", "description": "Having little, or comparatively little, weight; not tending to the center of gravity with force; not heavy."}, {"wordtype": "Adjective", "description": "Not burdensome; easy to be lifted, borne, or carried by physical strength; as, a light burden, or load."}, {"wordtype": "Adjective", "description": "Easy to be endured or performed; not severe; not difficult; as, a light affliction or task."}, {"wordtype": "Adjective", "description": "Easy to be digested; not oppressive to the stomach; as, light food; also, containing little nutriment."}, {"wordtype": "Adjective", "description": "Not heavily armed; armed with light weapons; as, light troops; a troop of light horse."}, {"wordtype": "Adjective", "description": "Not encumbered; unembarrassed; clear of impediments; hence, active; nimble; swift."}, {"wordtype": "Adjective", "description": "Not heavily burdened; not deeply laden; not sufficiently ballasted; as, the ship returned light."}, {"wordtype": "Adjective", "description": "Slight; not important; as, a light error."}, {"wordtype": "Adjective", "description": "Well leavened; not heavy; as, light bread."}, {"wordtype": "Adjective", "description": "Not copious or heavy; not dense; not inconsiderable; as, a light rain; a light snow; light vapors."}, {"wordtype": "Adjective", "description": "Not strong or violent; moderate; as, a light wind."}, {"wordtype": "Adjective", "description": "Not pressing heavily or hard upon; hence, having an easy, graceful manner; delicate; as, a light touch; a light style of execution."}, {"wordtype": "Adjective", "description": "Easy to admit influence; inconsiderate; easily influenced by trifling considerations; unsteady; unsettled; volatile; as, a light, vain person; a light mind."}, {"wordtype": "Adjective", "description": "Indulging in, or inclined to, levity; wanting dignity or solemnity; trifling; gay; frivolous; airy; unsubstantial."}, {"wordtype": "Adjective", "description": "Not quite sound or normal; somewhat impaired or deranged; dizzy; giddy."}, {"wordtype": "Adjective", "description": "Easily bestowed; inconsiderately rendered."}, {"wordtype": "Adjective", "description": "Wanton; unchaste; as, a woman of light character."}, {"wordtype": "Adjective", "description": "Not of the legal, standard, or usual weight; clipped; diminished; as, light coin."}, {"wordtype": "Adjective", "description": "Loose; sandy; easily pulverized; as, a light soil."}, {"wordtype": "Adverb", "description": "Lightly; cheaply."}, {"wordtype": "Transitive Verb", "description": "To lighten; to ease of a burden; to take off."}, {"wordtype": "Verb Intransitive", "description": "To dismount; to descend, as from a horse or carriage; to alight; -- with from, off, on, upon, at, in."}, {"wordtype": "Verb Intransitive", "description": "To feel light; to be made happy."}, {"wordtype": "Verb Intransitive", "description": "To descend from flight, and rest, perch, or settle, as a bird or insect."}, {"wordtype": "Verb Intransitive", "description": "To come down suddenly and forcibly; to fall; -- with on or upon."}, {"wordtype": "Verb Intransitive", "description": "To come by chance; to happen; -- with on or upon; formerly with into."}]}