{"definitions": [{"wordtype": "Adjective", "description": "Of little breadth; not wide or broad; having little distance from side to side; as, a narrow board; a narrow street; a narrow hem."}, {"wordtype": "Adjective", "description": "Of little extent; very limited; circumscribed."}, {"wordtype": "Adjective", "description": "Having but a little margin; having barely sufficient space, time, or number, etc.; close; near; -- with special reference to some peril or misfortune; as, a narrow shot; a narrow escape; a narrow majority."}, {"wordtype": "Adjective", "description": "Limited as to means; straitened; pinching; as, narrow circumstances."}, {"wordtype": "Adjective", "description": "Contracted; of limited scope; illiberal; bigoted; as, a narrow mind; narrow views."}, {"wordtype": "Adjective", "description": "Parsimonious; niggardly; covetous; selfish."}, {"wordtype": "Adjective", "description": "Scrutinizing in detail; close; accurate; exact."}, {"wordtype": "Adjective", "description": "Formed (as a vowel) by a close position of some part of the tongue in relation to the palate; or (according to Bell) by a tense condition of the pharynx; -- distinguished from wide; as e (eve) and / (f/d), etc., from i (ill) and / (f/t), etc. See Guide to Pronunciation, / 13."}, {"wordtype": "Noun", "description": "A narrow passage; esp., a contracted part of a stream, lake, or sea; a strait connecting two bodies of water; -- usually in the plural; as, The Narrows of New York harbor."}, {"wordtype": "Transitive Verb", "description": "To lessen the breadth of; to contract; to draw into a smaller compass; to reduce the width or extent of."}, {"wordtype": "Transitive Verb", "description": "To contract the reach or sphere of; to make less liberal or more selfish; to limit; to confine; to restrict; as, to narrow one's views or knowledge; to narrow a question in discussion."}, {"wordtype": "Transitive Verb", "description": "To contract the size of, as a stocking, by taking two stitches into one."}, {"wordtype": "Verb Intransitive", "description": "To become less broad; to contract; to become narrower; as, the sea narrows into a strait."}, {"wordtype": "Verb Intransitive", "description": "Not to step out enough to the one hand or the other; as, a horse narrows."}, {"wordtype": "Verb Intransitive", "description": "To contract the size of a stocking or other knit article, by taking two stitches into one."}]}