{"definitions": ["Fixed or determined by nature; pertaining to the constitution of a thing; belonging to native character; according to nature; essential; characteristic; not artifical, foreign, assumed, put on, or acquired; as, the natural growth of animals or plants; the natural motion of a gravitating body; natural strength or disposition; the natural heat of the body; natural color.", "Conformed to the order, laws, or actual facts, of nature; consonant to the methods of nature; according to the stated course of things, or in accordance with the laws which govern events, feelings, etc.; not exceptional or violent; legitimate; normal; regular; as, the natural consequence of crime; a natural death.", "Having to do with existing system to things; dealing with, or derived from, the creation, or the world of matter and mind, as known by man; within the scope of human reason or experience; not supernatural; as, a natural law; natural science; history, theology.", "Conformed to truth or reality", "Springing from true sentiment; not artifical or exaggerated; -- said of action, delivery, etc.; as, a natural gesture, tone, etc.", "Resembling the object imitated; true to nature; according to the life; -- said of anything copied or imitated; as, a portrait is natural.", "Having the character or sentiments properly belonging to one's position; not unnatural in feelings.", "Connected by the ties of consanguinity.", "Begotten without the sanction of law; born out of wedlock; illegitimate; bastard; as, a natural child.", "Of or pertaining to the lower or animal nature, as contrasted with the higher or moral powers, or that which is spiritual; being in a state of nature; unregenerate.", "Belonging to, to be taken in, or referred to, some system, in which the base is 1; -- said or certain functions or numbers; as, natural numbers, those commencing at 1; natural sines, cosines, etc., those taken in arcs whose radii are 1.", "Produced by natural organs, as those of the human throat, in distinction from instrumental music.", "Of or pertaining to a key which has neither a flat nor a sharp for its signature, as the key of C major.", "Applied to an air or modulation of harmony which moves by easy and smooth transitions, digressing but little from the original key.", "A native; an aboriginal.", "Natural gifts, impulses, etc.", "One born without the usual powers of reason or understanding; an idiot.", "A character [/] used to contradict, or to remove the effect of, a sharp or flat which has preceded it, and to restore the unaltered note."]}