{"definitions": ["A pact.", "A bundle made up and prepared to be carried; especially, a bundle to be carried on the back; a load for an animal; a bale, as of goods.", "A number or quantity equal to the contents of a pack; hence, a multitude; a burden.", "A number or quantity of connected or similar things", "A full set of playing cards; also, the assortment used in a particular game; as, a euchre pack.", "A number of hounds or dogs, hunting or kept together.", "A number of persons associated or leagued in a bad design or practice; a gang; as, a pack of thieves or knaves.", "A shook of cask staves.", "A bundle of sheet-iron plates for rolling simultaneously.", "A large area of floating pieces of ice driven together more or less closely.", "An envelope, or wrapping, of sheets used in hydropathic practice, called dry pack, wet pack, cold pack, etc., according to the method of treatment.", "A loose, lewd, or worthless person. See Baggage.", "To make a pack of; to arrange closely and securely in a pack; hence, to place and arrange compactly as in a pack; to press into close order or narrow compass; as to pack goods in a box; to pack fish.", "To fill in the manner of a pack, that is, compactly and securely, as for transportation; hence, to fill closely or to repletion; to stow away within; to cause to be full; to crowd into; as, to pack a trunk; the play, or the audience, packs the theater.", "To sort and arrange (the cards) in a pack so as to secure the game unfairly.", "Hence: To bring together or make up unfairly and fraudulently, in order to secure a certain result; as, to pack a jury or a causes.", "To contrive unfairly or fraudulently; to plot.", "To load with a pack; hence, to load; to encumber; as, to pack a horse.", "To cause to go; to send away with baggage or belongings; esp., to send away peremptorily or suddenly; -- sometimes with off; as, to pack a boy off to school.", "To transport in a pack, or in the manner of a pack (i. e., on the backs of men or beasts).", "To envelop in a wet or dry sheet, within numerous coverings. See Pack, n., 5.", "To render impervious, as by filling or surrounding with suitable material, or to fit or adjust so as to move without giving passage to air, water, or steam; as, to pack a joint; to pack the piston of a steam engine.", "To make up packs, bales, or bundles; to stow articles securely for transportation.", "To admit of stowage, or of making up for transportation or storage; to become compressed or to settle together, so as to form a compact mass; as, the goods pack conveniently; wet snow packs well.", "To gather in flocks or schools; as, the grouse or the perch begin to pack.", "To depart in haste; -- generally with off or away.", "To unite in bad measures; to confederate for ill purposes; to join in collusion."]}