{"definitions": [{"wordtype": "Noun", "description": "A number of things resembling one another, or belonging together; a set; as, a pair or flight of stairs. \"A pair of beads.\"  Chaucer. Beau. &amp; Fl. \"Four pair of stairs.\" Macaulay. [Now mostly or quite disused, except as to stairs.]"}, {"wordtype": "Noun", "description": "Two things of a kind, similar in form, suited to each other, and intended to be used together; as, a pair of gloves or stockings; a pair of shoes."}, {"wordtype": "Noun", "description": "Two of a sort; a span; a yoke; a couple; a brace; as, a pair of horses; a pair of oxen."}, {"wordtype": "Noun", "description": "A married couple; a man and wife."}, {"wordtype": "Noun", "description": "A single thing, composed of two pieces fitted to each other and used together; as, a pair of scissors; a pair of tongs; a pair of bellows."}, {"wordtype": "Noun", "description": "Two members of opposite parties or opinion, as in a parliamentary body, who mutually agree not to vote on a given question, or on issues of a party nature during a specified time; as, there were two pairs on the final vote."}, {"wordtype": "Noun", "description": "In a mechanism, two elements, or bodies, which are so applied to each other as to mutually constrain relative motion."}, {"wordtype": "Verb Intransitive", "description": "To be joined in paris; to couple; to mate, as for breeding."}, {"wordtype": "Verb Intransitive", "description": "To suit; to fit, as a counterpart."}, {"wordtype": "Verb Intransitive", "description": "Same as To pair off. See phrase below."}, {"wordtype": "Transitive Verb", "description": "To unite in couples; to form a pair of; to bring together, as things which belong together, or which complement, or are adapted to one another."}, {"wordtype": "Transitive Verb", "description": "To engage (one's self) with another of opposite opinions not to vote on a particular question or class of questions."}, {"wordtype": "Transitive Verb", "description": "To impair."}]}