{"definitions": [{"wordtype": "Transitive Verb", "description": "To raze."}, {"wordtype": "Noun", "description": "A root."}, {"wordtype": "Noun", "description": "The descendants of a common ancestor; a family, tribe, people, or nation, believed or presumed to belong to the same stock; a lineage; a breed."}, {"wordtype": "Noun", "description": "Company; herd; breed."}, {"wordtype": "Noun", "description": "A variety of such fixed character that it may be propagated by seed."}, {"wordtype": "Noun", "description": "Peculiar flavor, taste, or strength, as of wine; that quality, or assemblage of qualities, which indicates origin or kind, as in wine; hence, characteristic flavor; smack."}, {"wordtype": "Noun", "description": "Hence, characteristic quality or disposition."}, {"wordtype": "Noun", "description": "A progress; a course; a movement or progression."}, {"wordtype": "Noun", "description": "Esp., swift progress; rapid course; a running."}, {"wordtype": "Noun", "description": "Hence: The act or process of running in competition; a contest of speed in any way, as in running, riding, driving, skating, rowing, sailing; in the plural, usually, a meeting for contests in the running of horses; as, he attended the races."}, {"wordtype": "Noun", "description": "Competitive action of any kind, especially when prolonged; hence, career; course of life."}, {"wordtype": "Noun", "description": "A strong or rapid current of water, or the channel or passage for such a current; a powerful current or heavy sea, sometimes produced by the meeting of two tides; as, the Portland Race; the Race of Alderney."}, {"wordtype": "Noun", "description": "The current of water that turns a water wheel, or the channel in which it flows; a mill race."}, {"wordtype": "Noun", "description": "A channel or guide along which a shuttle is driven back and forth, as in a loom, sewing machine, etc."}, {"wordtype": "Verb Intransitive", "description": "To run swiftly; to contend in a race; as, the animals raced over the ground; the ships raced from port to port."}, {"wordtype": "Verb Intransitive", "description": "To run too fast at times, as a marine engine or screw, when the screw is lifted out of water by the action of a heavy sea."}, {"wordtype": "Transitive Verb", "description": "To cause to contend in a race; to drive at high speed; as, to race horses."}, {"wordtype": "Transitive Verb", "description": "To run a race with."}]}