{"definitions": [{"wordtype": "Noun", "description": "Same as Arrack."}, {"wordtype": "Noun", "description": "The neck and spine of a fore quarter of veal or mutton."}, {"wordtype": "Noun", "description": "A wreck; destruction."}, {"wordtype": "Noun", "description": "Thin, flying, broken clouds, or any portion of floating vapor in the sky."}, {"wordtype": "Verb Intransitive", "description": "To fly, as vapor or broken clouds."}, {"wordtype": "Verb", "description": "To amble fast, causing a rocking or swaying motion of the body; to pace; -- said of a horse."}, {"wordtype": "Noun", "description": "A fast amble."}, {"wordtype": "Transitive Verb", "description": "To draw off from the lees or sediment, as wine."}, {"wordtype": "Adjective", "description": "An instrument or frame used for stretching, extending, retaining, or displaying, something."}, {"wordtype": "Adjective", "description": "An engine of torture, consisting of a large frame, upon which the body was gradually stretched until, sometimes, the joints were dislocated; -- formerly used judicially for extorting confessions from criminals or suspected persons."}, {"wordtype": "Adjective", "description": "An instrument for bending a bow."}, {"wordtype": "Adjective", "description": "A grate on which bacon is laid."}, {"wordtype": "Adjective", "description": "A frame or device of various construction for holding, and preventing the waste of, hay, grain, etc., supplied to beasts."}, {"wordtype": "Adjective", "description": "A frame on which articles are deposited for keeping or arranged for display; as, a clothes rack; a bottle rack, etc."}, {"wordtype": "Adjective", "description": "A piece or frame of wood, having several sheaves, through which the running rigging passes; -- called also rack block. Also, a frame to hold shot."}, {"wordtype": "Adjective", "description": "A frame or table on which ores are separated or washed."}, {"wordtype": "Adjective", "description": "A frame fitted to a wagon for carrying hay, straw, or grain on the stalk, or other bulky loads."}, {"wordtype": "Adjective", "description": "A distaff."}, {"wordtype": "Adjective", "description": "A bar with teeth on its face, or edge, to work with those of a wheel, pinion, or worm, which is to drive it or be driven by it."}, {"wordtype": "Adjective", "description": "That which is extorted; exaction."}, {"wordtype": "Transitive Verb", "description": "To extend by the application of force; to stretch or strain; specifically, to stretch on the rack or wheel; to torture by an engine which strains the limbs and pulls the joints."}, {"wordtype": "Transitive Verb", "description": "To torment; to torture; to affect with extreme pain or anguish."}, {"wordtype": "Transitive Verb", "description": "To stretch or strain, in a figurative sense; hence, to harass, or oppress by extortion."}, {"wordtype": "Transitive Verb", "description": "To wash on a rack, as metals or ore."}, {"wordtype": "Transitive Verb", "description": "To bind together, as two ropes, with cross turns of yarn, marline, etc."}]}