{"definitions": [{"wordtype": "Adjective", "description": "Of or pertaining to the root; proceeding directly from the root."}, {"wordtype": "Adjective", "description": "Hence: Of or pertaining to the root or origin; reaching to the center, to the foundation, to the ultimate sources, to the principles, or the like; original; fundamental; thorough-going; unsparing; extreme; as, radical evils; radical reform; a radical party."}, {"wordtype": "Adjective", "description": "Belonging to, or proceeding from, the root of a plant; as, radical tubers or hairs."}, {"wordtype": "Adjective", "description": "Proceeding from a rootlike stem, or one which does not rise above the ground; as, the radical leaves of the dandelion and the sidesaddle flower."}, {"wordtype": "Adjective", "description": "Relating, or belonging, to the root, or ultimate source of derivation; as, a radical verbal form."}, {"wordtype": "Adjective", "description": "Of or pertaining to a radix or root; as, a radical quantity; a radical sign. See below."}, {"wordtype": "Noun", "description": "A primitive word; a radix, root, or simple, underived, uncompounded word; an etymon."}, {"wordtype": "Noun", "description": "A primitive letter; a letter that belongs to the radix."}, {"wordtype": "Noun", "description": "One who advocates radical changes in government or social institutions, especially such changes as are intended to level class inequalities; -- opposed to conservative."}, {"wordtype": "Noun", "description": "A characteristic, essential, and fundamental constituent of any compound; hence, sometimes, an atom."}, {"wordtype": "Noun", "description": "Specifically, a group of two or more atoms, not completely saturated, which are so linked that their union implies certain properties, and are conveniently regarded as playing the part of a single atom; a residue; -- called also a compound radical.  Cf. Residue."}, {"wordtype": "Noun", "description": "A radical quantity. See under Radical, a."}, {"wordtype": "Adjective", "description": "A radical vessel. See under Radical, a."}]}