{"definitions": [{"wordtype": "Noun", "description": "An implement consisting of a headpiece having teeth, and a long handle at right angles to it, -- used for collecting hay, or other light things which are spread over a large surface, or for breaking and smoothing the earth."}, {"wordtype": "Noun", "description": "A toothed machine drawn by a horse, -- used for collecting hay or grain; a horserake."}, {"wordtype": "Noun", "description": "A fissure or mineral vein traversing the strata vertically, or nearly so; -- called also rake-vein."}, {"wordtype": "Transitive Verb", "description": "To collect with a rake; as, to rake hay; -- often with up; as, he raked up the fallen leaves."}, {"wordtype": "Transitive Verb", "description": "To collect or draw together with laborious industry; to gather from a wide space; to scrape together; as, to rake together wealth; to rake together slanderous tales; to rake together the rabble of a town."}, {"wordtype": "Transitive Verb", "description": "To pass a rake over; to scrape or scratch with a rake for the purpose of collecting and clearing off something, or for stirring up the soil; as, to rake a lawn; to rake a flower bed."}, {"wordtype": "Transitive Verb", "description": "To search through; to scour; to ransack."}, {"wordtype": "Transitive Verb", "description": "To scrape or scratch across; to pass over quickly and lightly, as a rake does."}, {"wordtype": "Transitive Verb", "description": "To enfilade; to fire in a direction with the length of; in naval engagements, to cannonade, as a ship, on the stern or head so that the balls range the whole length of the deck."}, {"wordtype": "Verb Intransitive", "description": "To use a rake, as for searching or for collecting; to scrape; to search minutely."}, {"wordtype": "Verb Intransitive", "description": "To pass with violence or rapidity; to scrape along."}, {"wordtype": "Noun", "description": "The inclination of anything from a perpendicular direction; as, the rake of a roof, a staircase, etc."}, {"wordtype": "Noun", "description": "the inclination of a mast or funnel, or, in general, of any part of a vessel not perpendicular to the keel."}, {"wordtype": "Verb Intransitive", "description": "To incline from a perpendicular direction; as, a mast rakes aft."}, {"wordtype": "Noun", "description": "A loose, disorderly, vicious man; a person addicted to lewdness and other scandalous vices; a debauchee; a roue."}, {"wordtype": "Verb Intransitive", "description": "To walk about; to gad or ramble idly."}, {"wordtype": "Verb Intransitive", "description": "To act the rake; to lead a dissolute, debauched life."}]}