{"definitions": ["To set in a row, or in rows; to place in a regular line or lines, or in ranks; to dispose in the proper order; to rank; as, to range soldiers in line.", "To place (as a single individual) among others in a line, row, or order, as in the ranks of an army; -- usually, reflexively and figuratively, (in the sense) to espouse a cause, to join a party, etc.", "To separate into parts; to sift.", "To dispose in a classified or in systematic order; to arrange regularly; as, to range plants and animals in genera and species.", "To rove over or through; as, to range the fields.", "To sail or pass in a direction parallel to or near; as, to range the coast.", "To be native to, or to live in; to frequent.", "To rove at large; to wander without restraint or direction; to roam.", "To have range; to change or differ within limits; to be capable of projecting, or to admit of being projected, especially as to horizontal distance; as, the temperature ranged through seventy degrees Fahrenheit; the gun ranges three miles; the shot ranged four miles.", "To be placed in order; to be ranked; to admit of arrangement or classification; to rank.", "To have a certain direction; to correspond in direction; to be or keep in a corresponding line; to trend or run; -- often followed by with; as, the front of a house ranges with the street; to range along the coast.", "To be native to, or live in, a certain district or region; as, the peba ranges from Texas to Paraguay.", "A series of things in a line; a row; a rank; as, a range of buildings; a range of mountains.", "An aggregate of individuals in one rank or degree; an order; a class.", "The step of a ladder; a rung.", "A kitchen grate.", "An extended cooking apparatus of cast iron, set in brickwork, and affording conveniences for various ways of cooking; also, a kind of cooking stove.", "A bolting sieve to sift meal.", "A wandering or roving; a going to and fro; an excursion; a ramble; an expedition.", "That which may be ranged over; place or room for excursion; especially, a region of country in which cattle or sheep may wander and pasture.", "Extent or space taken in by anything excursive; compass or extent of excursion; reach; scope; discursive power; as, the range of one's voice, or authority.", "The region within which a plant or animal naturally lives.", "The horizontal distance to which a shot or other projectile is carried.", "Sometimes, less properly, the trajectory of a shot or projectile.", "A place where shooting, as with cannons or rifles, is practiced.", "In the public land system of the United States, a row or line of townships lying between two successive meridian lines six miles apart.", "See Range of cable, below."]}