{"definitions": [{"wordtype": "Verb Transitive and Intransitive", "description": "To chide with vehemence; to scold; to censure violently."}, {"wordtype": "Noun", "description": "Established portion or measure; fixed allowance."}, {"wordtype": "Noun", "description": "That which is established as a measure or criterion; degree; standard; rank; proportion; ratio; as, a slow rate of movement; rate of interest is the ratio of the interest to the principal, per annum."}, {"wordtype": "Noun", "description": "Valuation; price fixed with relation to a standard; cost; charge; as, high or low rates of transportation."}, {"wordtype": "Noun", "description": "A tax or sum assessed by authority on property for public use, according to its income or value; esp., in England, a local tax; as, parish rates; town rates."}, {"wordtype": "Noun", "description": "Order; arrangement."}, {"wordtype": "Noun", "description": "Ratification; approval."}, {"wordtype": "Noun", "description": "The gain or loss of a timepiece in a unit of time; as, daily rate; hourly rate; etc."}, {"wordtype": "Noun", "description": "The order or class to which a war vessel belongs, determined according to its size, armament, etc.; as, first rate, second rate, etc."}, {"wordtype": "Noun", "description": "The class of a merchant vessel for marine insurance, determined by its relative safety as a risk, as A1, A2, etc."}, {"wordtype": "Transitive Verb", "description": "To set a certain estimate on; to value at a certain price or degree."}, {"wordtype": "Transitive Verb", "description": "To assess for the payment of a rate or tax."}, {"wordtype": "Transitive Verb", "description": "To settle the relative scale, rank, position, amount, value, or quality of; as, to rate a ship; to rate a seaman; to rate a pension."}, {"wordtype": "Transitive Verb", "description": "To ratify."}, {"wordtype": "Verb Intransitive", "description": "To be set or considered in a class; to have rank; as, the ship rates as a ship of the line."}, {"wordtype": "Verb Intransitive", "description": "To make an estimate."}]}