{"definitions": [{"wordtype": "Noun", "description": "A thought or a consideration offered in support of a determination or an opinion; a just ground for a conclusion or an action; that which is offered or accepted as an explanation; the efficient cause of an occurrence or a phenomenon; a motive for an action or a determination; proof, more or less decisive, for an opinion or a conclusion; principle; efficient cause; final cause; ground of argument."}, {"wordtype": "Noun", "description": "The faculty or capacity of the human mind by which it is distinguished from the intelligence of the inferior animals; the higher as distinguished from the lower cognitive faculties, sense, imagination, and memory, and in contrast to the feelings and desires. Reason comprises conception, judgment, reasoning, and the intuitional faculty. Specifically, it is the intuitional faculty, or the faculty of first truths, as distinguished from the understanding, which is called the discursive or ratiocinative faculty."}, {"wordtype": "Noun", "description": "Due exercise of the reasoning faculty; accordance with, or that which is accordant with and ratified by, the mind rightly exercised; right intellectual judgment; clear and fair deductions from true principles; that which is dictated or supported by the common sense of mankind; right conduct; right; propriety; justice."}, {"wordtype": "Noun", "description": "Ratio; proportion."}, {"wordtype": "Noun", "description": "To exercise the rational faculty; to deduce inferences from premises; to perform the process of deduction or of induction; to ratiocinate; to reach conclusions by a systematic comparison of facts."}, {"wordtype": "Noun", "description": "Hence: To carry on a process of deduction or of induction, in order to convince or to confute; to formulate and set forth propositions and the inferences from them; to argue."}, {"wordtype": "Noun", "description": "To converse; to compare opinions."}, {"wordtype": "Transitive Verb", "description": "To arrange and present the reasons for or against; to examine or discuss by arguments; to debate or discuss; as, I reasoned the matter with my friend."}, {"wordtype": "Transitive Verb", "description": "To support with reasons, as a request."}, {"wordtype": "Transitive Verb", "description": "To persuade by reasoning or argument; as, to reason one into a belief; to reason one out of his plan."}, {"wordtype": "Transitive Verb", "description": "To overcome or conquer by adducing reasons; -- with down; as, to reason down a passion."}, {"wordtype": "Transitive Verb", "description": "To find by logical processes; to explain or justify by reason or argument; -- usually with out; as, to reason out the causes of the librations of the moon."}]}