{"definitions": [{"wordtype": "Transitive Verb", "description": "To keep in view; to behold; to look at; to view; to gaze upon."}, {"wordtype": "Transitive Verb", "description": "Hence, to look or front toward; to face."}, {"wordtype": "Transitive Verb", "description": "To look closely at; to observe attentively; to pay attention to; to notice or remark particularly."}, {"wordtype": "Transitive Verb", "description": "To look upon, as in a certain relation; to hold as an popinion; to consider; as, to regard abstinence from wine as a duty; to regard another as a friend or enemy."}, {"wordtype": "Transitive Verb", "description": "To consider and treat; to have a certain feeling toward; as, to regard one with favor or dislike."}, {"wordtype": "Transitive Verb", "description": "To pay respect to; to treat as something of peculiar value, sanctity, or the like; to care for; to esteem."}, {"wordtype": "Transitive Verb", "description": "To take into consideration; to take account of, as a fact or condition."}, {"wordtype": "Transitive Verb", "description": "To have relation to, as bearing upon; to respect; to relate to; to touch; as, an argument does not regard the question; -- often used impersonally; as, I agree with you as regards this or that."}, {"wordtype": "Verb Intransitive", "description": "To look attentively; to consider; to notice."}, {"wordtype": "Transitive Verb", "description": "A look; aspect directed to another; view; gaze."}, {"wordtype": "Transitive Verb", "description": "Attention of the mind with a feeling of interest; observation; heed; notice."}, {"wordtype": "Transitive Verb", "description": "That view of the mind which springs from perception of value, estimable qualities, or anything that excites admiration; respect; esteem; reverence; affection; as, to have a high regard for a person; -- often in the plural."}, {"wordtype": "Transitive Verb", "description": "State of being regarded, whether favorably or otherwise; estimation; repute; note; account."}, {"wordtype": "Transitive Verb", "description": "Consideration; thought; reflection; heed."}, {"wordtype": "Transitive Verb", "description": "Matter for consideration; account; condition."}, {"wordtype": "Transitive Verb", "description": "Respect; relation; reference."}, {"wordtype": "Transitive Verb", "description": "Object of sight; scene; view; aspect."}, {"wordtype": "Transitive Verb", "description": "Supervision; inspection."}]}