{"definitions": [{"wordtype": "Noun", "description": "A written account or entry; an official or formal enumeration, description, or record; a memorial record; a list or roll; a schedule."}, {"wordtype": "Noun", "description": "A record containing a list and description of the merchant vessels belonging to a port or customs district."}, {"wordtype": "Noun", "description": "A certificate issued by the collector of customs of a port or district to the owner of a vessel, containing the description of a vessel, its name, ownership, and other material facts. It is kept on board the vessel, to be used as an evidence of nationality or as a muniment of title."}, {"wordtype": "Noun", "description": "One who registers or records; a registrar; a recorder; especially, a public officer charged with the duty of recording certain transactions or events; as, a register of deeds."}, {"wordtype": "Noun", "description": "That which registers or records."}, {"wordtype": "Noun", "description": "A contrivance for automatically noting the performance of a machine or the rapidity of a process."}, {"wordtype": "Noun", "description": "The part of a telegraphic apparatus which records automatically the message received."}, {"wordtype": "Noun", "description": "A machine for registering automatically the number of persons passing through a gateway, fares taken, etc.; a telltale."}, {"wordtype": "Noun", "description": "A lid, stopper, or sliding plate, in a furnace, stove, etc., for regulating the admission of air to the fuel; also, an arrangement containing dampers or shutters, as in the floor or wall of a room or passage, or in a chimney, for admitting or excluding heated air, or for regulating ventilation."}, {"wordtype": "Noun", "description": "The inner part of the mold in which types are cast."}, {"wordtype": "Noun", "description": "The correspondence of pages, columns, or lines on the opposite or reverse sides of the sheet."}, {"wordtype": "Noun", "description": "The correspondence or adjustment of the several impressions in a design which is printed in parts, as in chromolithographic printing, or in the manufacture of paper hangings. See Register, v. i. 2."}, {"wordtype": "Verb Intransitive", "description": "The compass of a voice or instrument; a specified portion of the compass of a voice, or a series of vocal tones of a given compass; as, the upper, middle, or lower register; the soprano register; the tenor register."}, {"wordtype": "Verb Intransitive", "description": "A stop or set of pipes in an organ."}, {"wordtype": "Noun", "description": "To enter in a register; to record formally and distinctly, as for future use or service."}, {"wordtype": "Noun", "description": "To enroll; to enter in a list."}, {"wordtype": "Verb Intransitive", "description": "To enroll one's name in a register."}, {"wordtype": "Verb Intransitive", "description": "To correspond in relative position; as, two pages, columns, etc. , register when the corresponding parts fall in the same line, or when line falls exactly upon line in reverse pages, or (as in chromatic printing) where the various colors of the design are printed consecutively, and perfect adjustment of parts is necessary."}]}