{"definitions": [{"wordtype": "Transitive Verb", "description": "To refer."}, {"wordtype": "Transitive Verb", "description": "To bring back, as an answer; to announce in return; to relate, as what has been discovered by a person sent to examine, explore, or investigate; as, a messenger reports to his employer what he has seen or ascertained; the committee reported progress."}, {"wordtype": "Transitive Verb", "description": "To give an account of; to relate; to tell; to circulate publicly, as a story; as, in the common phrase, it is reported."}, {"wordtype": "Transitive Verb", "description": "To give an official account or statement of; as, a treasurer reports the receipts and expenditures."}, {"wordtype": "Transitive Verb", "description": "To return or repeat, as sound; to echo."}, {"wordtype": "Transitive Verb", "description": "To return or present as the result of an examination or consideration of any matter officially referred; as, the committee reported the bill witth amendments, or reported a new bill, or reported the results of an inquiry."}, {"wordtype": "Transitive Verb", "description": "To make minutes of, as a speech, or the doings of a public body; to write down from the lips of a speaker."}, {"wordtype": "Transitive Verb", "description": "To write an account of for publication, as in a newspaper; as, to report a public celebration or a horse race."}, {"wordtype": "Transitive Verb", "description": "To make a statement of the conduct of, especially in an unfavorable sense; as, to report a servant to his employer."}, {"wordtype": "Verb Intransitive", "description": "To make a report, or response, in respect of a matter inquired of, a duty enjoined, or information expected; as, the committee will report at twelve o'clock."}, {"wordtype": "Verb Intransitive", "description": "To furnish in writing an account of a speech, the proceedings at a meeting, the particulars of an occurrence, etc., for publication."}, {"wordtype": "Verb Intransitive", "description": "To present one's self, as to a superior officer, or to one to whom service is due, and to be in readiness for orders or to do service; also, to give information, as of one's address, condition, etc.; as, the officer reported to the general for duty; to report weekly by letter."}, {"wordtype": "Transitive Verb", "description": "That which is reported."}, {"wordtype": "Transitive Verb", "description": "An account or statement of the results of examination or inquiry made by request or direction; relation."}, {"wordtype": "Transitive Verb", "description": "A story or statement circulating by common talk; a rumor; hence, fame; repute; reputation."}, {"wordtype": "Transitive Verb", "description": "Sound; noise; as, the report of a pistol or cannon."}, {"wordtype": "Transitive Verb", "description": "An official statement of facts, verbal or written; especially, a statement in writing of proceedings and facts exhibited by an officer to his superiors; as, the reports of the heads af departments to Congress, of a master in chancery to the court, of committees to a legislative body, and the like."}, {"wordtype": "Transitive Verb", "description": "An account or statement of a judicial opinion or decision, or of case argued and determined in a court of law, chancery, etc.; also, in the plural, the volumes containing such reports; as, Coke's Reports."}, {"wordtype": "Transitive Verb", "description": "A sketch, or a fully written account, of a speech, debate, or the proceedings of a public meeting, legislative body, etc."}, {"wordtype": "Transitive Verb", "description": "Rapport; relation; connection; reference."}]}