{"definitions": [{"wordtype": "Verb Intransitive", "description": "To separate the component parts of; to reduce to the constituent elements; -- said of compound substances; hence, sometimes, to melt, or dissolve."}, {"wordtype": "Verb Intransitive", "description": "To reduce to simple or intelligible notions; -- said of complex ideas or obscure questions; to make clear or certain; to free from doubt; to disentangle; to unravel; to explain; hence, to clear up, or dispel, as doubt; as, to resolve a riddle."}, {"wordtype": "Verb Intransitive", "description": "To cause to perceive or understand; to acquaint; to inform; to convince; to assure; to make certain."}, {"wordtype": "Verb Intransitive", "description": "To determine or decide in purpose; to make ready in mind; to fix; to settle; as, he was resolved by an unexpected event."}, {"wordtype": "Verb Intransitive", "description": "To express, as an opinion or determination, by resolution and vote; to declare or decide by a formal vote; -- followed by a clause; as, the house resolved (or, it was resolved by the house) that no money should be apropriated (or, to appropriate no money)."}, {"wordtype": "Verb Intransitive", "description": "To change or convert by resolution or formal vote; -- used only reflexively; as, the house resolved itself into a committee of the whole."}, {"wordtype": "Verb Intransitive", "description": "To solve, as a problem, by enumerating the several things to be done, in order to obtain what is required; to find the answer to, or the result of."}, {"wordtype": "Verb Intransitive", "description": "To dispere or scatter; to discuss, as an inflammation or a tumor."}, {"wordtype": "Verb Intransitive", "description": "To let the tones (as of a discord) follow their several tendencies, resulting in a concord."}, {"wordtype": "Verb Intransitive", "description": "To relax; to lay at ease."}, {"wordtype": "Verb Intransitive", "description": "To be separated into its component parts or distinct principles; to undergo resolution."}, {"wordtype": "Verb Intransitive", "description": "To melt; to dissolve; to become fluid."}, {"wordtype": "Verb Intransitive", "description": "To be settled in opinion; to be convinced."}, {"wordtype": "Verb Intransitive", "description": "To form a purpose; to make a decision; especially, to determine after reflection; as, to resolve on a better course of life."}, {"wordtype": "Noun", "description": "The act of resolving or making clear; resolution; solution."}, {"wordtype": "Noun", "description": "That which has been resolved on or determined; decisive conclusion; fixed purpose; determination; also, legal or official determination; a legislative declaration; a resolution."}]}