{"definitions": [{"wordtype": "Transitive Verb", "description": "To arrest."}, {"wordtype": "Noun", "description": "A state of quiet or repose; a cessation from motion or labor; tranquillity; as, rest from mental exertion; rest of body or mind."}, {"wordtype": "Noun", "description": "Hence, freedom from everything which wearies or disturbs; peace; security."}, {"wordtype": "Noun", "description": "Sleep; slumber; hence, poetically, death."}, {"wordtype": "Noun", "description": "That on which anything rests or leans for support; as, a rest in a lathe, for supporting the cutting tool or steadying the work."}, {"wordtype": "Noun", "description": "A projection from the right side of the cuirass, serving to support the lance."}, {"wordtype": "Noun", "description": "A place where one may rest, either temporarily, as in an inn, or permanently, as, in an abode."}, {"wordtype": "Noun", "description": "A short pause in reading verse; a c/sura."}, {"wordtype": "Noun", "description": "The striking of a balance at regular intervals in a running account."}, {"wordtype": "Noun", "description": "A set or game at tennis."}, {"wordtype": "Noun", "description": "Silence in music or in one of its parts; the name of the character that stands for such silence. They are named as notes are, whole, half, quarter,etc."}, {"wordtype": "Noun", "description": "To cease from action or motion, especially from action which has caused weariness; to desist from labor or exertion."}, {"wordtype": "Noun", "description": "To be free from whanever wearies or disturbs; to be quiet or still."}, {"wordtype": "Noun", "description": "To lie; to repose; to recline; to lan; as, to rest on a couch."}, {"wordtype": "Noun", "description": "To stand firm; to be fixed; to be supported; as, a column rests on its pedestal."}, {"wordtype": "Noun", "description": "To sleep; to slumber; hence, poetically, to be dead."}, {"wordtype": "Noun", "description": "To lean in confidence; to trust; to rely; to repose without anxiety; as, to rest on a man's promise."}, {"wordtype": "Noun", "description": "To be satisfied; to acquiesce."}, {"wordtype": "Transitive Verb", "description": "To lay or place at rest; to quiet."}, {"wordtype": "Transitive Verb", "description": "To place, as on a support; to cause to lean."}, {"wordtype": "Noun", "description": "That which is left, or which remains after the separation of a part, either in fact or in contemplation; remainder; residue."}, {"wordtype": "Noun", "description": "Those not included in a proposition or description; the remainder; others."}, {"wordtype": "Noun", "description": "A surplus held as a reserved fund by a bank to equalize its dividends, etc.; in the Bank of England, the balance of assets above liabilities."}, {"wordtype": "Verb Intransitive", "description": "To be left; to remain; to continue to be."}]}