{"definitions": [{"wordtype": "Verb Transitive and Intransitive", "description": "To turn again."}, {"wordtype": "Verb Intransitive", "description": "To turn back; to go or come again to the same place or condition."}, {"wordtype": "Verb Intransitive", "description": "To come back, or begin again, after an interval, regular or irregular; to appear again."}, {"wordtype": "Verb Intransitive", "description": "To speak in answer; to reply; to respond."}, {"wordtype": "Verb Intransitive", "description": "To revert; to pass back into possession."}, {"wordtype": "Verb Intransitive", "description": "To go back in thought, narration, or argument."}, {"wordtype": "Transitive Verb", "description": "To bring, carry, send, or turn, back; as, to return a borrowed book, or a hired horse."}, {"wordtype": "Transitive Verb", "description": "To repay; as, to return borrowed money."}, {"wordtype": "Transitive Verb", "description": "To give in requital or recompense; to requite."}, {"wordtype": "Transitive Verb", "description": "To give back in reply; as, to return an answer; to return thanks."}, {"wordtype": "Transitive Verb", "description": "To retort; to throw back; as, to return the lie."}, {"wordtype": "Transitive Verb", "description": "To report, or bring back and make known."}, {"wordtype": "Transitive Verb", "description": "To render, as an account, usually an official account, to a superior; to report officially by a list or statement; as, to return a list of stores, of killed or wounded; to return the result of an election."}, {"wordtype": "Transitive Verb", "description": "Hence, to elect according to the official report of the election officers."}, {"wordtype": "Transitive Verb", "description": "To bring or send back to a tribunal, or to an office, with a certificate of what has been done; as, to return a writ."}, {"wordtype": "Transitive Verb", "description": "To convey into official custody, or to a general depository."}, {"wordtype": "Transitive Verb", "description": "To bat (the ball) back over the net."}, {"wordtype": "Transitive Verb", "description": "To lead in response to the lead of one's partner; as, to return a trump; to return a diamond for a club."}, {"wordtype": "Noun", "description": "The act of returning (intransitive), or coming back to the same place or condition; as, the return of one long absent; the return of health; the return of the seasons, or of an anniversary."}, {"wordtype": "Noun", "description": "The act of returning (transitive), or sending back to the same place or condition; restitution; repayment; requital; retribution; as, the return of anything borrowed, as a book or money; a good return in tennis."}, {"wordtype": "Noun", "description": "That which is returned."}, {"wordtype": "Noun", "description": "A payment; a remittance; a requital."}, {"wordtype": "Noun", "description": "An answer; as, a return to one's question."}, {"wordtype": "Noun", "description": "An account, or formal report, of an action performed, of a duty discharged, of facts or statistics, and the like; as, election returns; a return of the amount of goods produced or sold; especially, in the plural, a set of tabulated statistics prepared for general information."}, {"wordtype": "Noun", "description": "The profit on, or advantage received from, labor, or an investment, undertaking, adventure, etc."}, {"wordtype": "Noun", "description": "The continuation in a different direction, most often at a right angle, of a building, face of a building, or any member, as a molding or mold; -- applied to the shorter in contradistinction to the longer; thus, a facade of sixty feet east and west has a return of twenty feet north and south."}, {"wordtype": "Noun", "description": "The rendering back or delivery of writ, precept, or execution, to the proper officer or court."}, {"wordtype": "Noun", "description": "The certificate of an officer stating what he has done in execution of a writ, precept, etc., indorsed on the document."}, {"wordtype": "Noun", "description": "The sending back of a commission with the certificate of the commissioners."}, {"wordtype": "Noun", "description": "A day in bank. See Return day, below."}, {"wordtype": "Noun", "description": "An official account, report, or statement, rendered to the commander or other superior officer; as, the return of men fit for duty; the return of the number of the sick; the return of provisions, etc."}, {"wordtype": "Noun", "description": "The turnings and windings of a trench or mine."}]}