{"definitions": [{"wordtype": "Adjective", "description": "Turned backward; having a contrary or opposite direction; hence; opposite or contrary in kind; as, the reverse order or method."}, {"wordtype": "Adjective", "description": "Turned upside down; greatly disturbed."}, {"wordtype": "Adjective", "description": "Reversed; as, a reverse shell."}, {"wordtype": "Adjective", "description": "That which appears or is presented when anything, as a lance, a line, a course of conduct, etc., is reverted or turned contrary to its natural direction."}, {"wordtype": "Adjective", "description": "That which is directly opposite or contrary to something else; a contrary; an opposite."}, {"wordtype": "Adjective", "description": "The act of reversing; complete change; reversal; hence, total change in circumstances or character; especially, a change from better to worse; misfortune; a check or defeat; as, the enemy met with a reverse."}, {"wordtype": "Adjective", "description": "The back side; as, the reverse of a drum or trench; the reverse of a medal or coin, that is, the side opposite to the obverse. See Obverse."}, {"wordtype": "Adjective", "description": "A thrust in fencing made with a backward turn of the hand; a backhanded stroke."}, {"wordtype": "Adjective", "description": "A turn or fold made in bandaging, by which the direction of the bandage is changed."}, {"wordtype": "Adjective", "description": "To turn back; to cause to face in a contrary direction; to cause to depart."}, {"wordtype": "Adjective", "description": "To cause to return; to recall."}, {"wordtype": "Adjective", "description": "To change totally; to alter to the opposite."}, {"wordtype": "Adjective", "description": "To turn upside down; to invert."}, {"wordtype": "Adjective", "description": "Hence, to overthrow; to subvert."}, {"wordtype": "Adjective", "description": "To overthrow by a contrary decision; to make void; to under or annual for error; as, to reverse a judgment, sentence, or decree."}, {"wordtype": "Verb Intransitive", "description": "To return; to revert."}, {"wordtype": "Verb Intransitive", "description": "To become or be reversed."}]}