{"definitions": [{"wordtype": "Adjective", "description": "Straight; direct; not crooked; as, a right line."}, {"wordtype": "Adjective", "description": "Upright; erect from a base; having an upright axis; not oblique; as, right ascension; a right pyramid or cone."}, {"wordtype": "Adjective", "description": "Conformed to the constitution of man and the will of God, or to justice and equity; not deviating from the true and just; according with truth and duty; just; true."}, {"wordtype": "Adjective", "description": "Fit; suitable; proper; correct; becoming; as, the right man in the right place; the right way from London to Oxford."}, {"wordtype": "Adjective", "description": "Characterized by reality or genuineness; real; actual; not spurious."}, {"wordtype": "Adjective", "description": "According with truth; passing a true judgment; conforming to fact or intent; not mistaken or wrong; not erroneous; correct; as, this is the right faith."}, {"wordtype": "Adjective", "description": "Most favorable or convenient; fortunate."}, {"wordtype": "Adjective", "description": "Of or pertaining to that side of the body in man on which the muscular action is usually stronger than on the other side; -- opposed to left when used in reference to a part of the body; as, the right side, hand, arm. Also applied to the corresponding side of the lower animals."}, {"wordtype": "Adjective", "description": "Well placed, disposed, or adjusted; orderly; well regulated; correctly done."}, {"wordtype": "Adjective", "description": "Designed to be placed or worn outward; as, the right side of a piece of cloth."}, {"wordtype": "Adverb", "description": "In a right manner."}, {"wordtype": "Adverb", "description": "In a right or straight line; directly; hence; straightway; immediately; next; as, he stood right before me; it went right to the mark; he came right out; he followed right after the guide."}, {"wordtype": "Adverb", "description": "Exactly; just."}, {"wordtype": "Adverb", "description": "According to the law or will of God; conforming to the standard of truth and justice; righteously; as, to live right; to judge right."}, {"wordtype": "Adverb", "description": "According to any rule of art; correctly."}, {"wordtype": "Adverb", "description": "According to fact or truth; actually; truly; really; correctly; exactly; as, to tell a story right."}, {"wordtype": "Adverb", "description": "In a great degree; very; wholly; unqualifiedly; extremely; highly; as, right humble; right noble; right valiant."}, {"wordtype": "Adjective", "description": "That which is right or correct."}, {"wordtype": "Adjective", "description": "The straight course; adherence to duty; obedience to lawful authority, divine or human; freedom from guilt, -- the opposite of moral wrong."}, {"wordtype": "Adjective", "description": "A true statement; freedom from error of falsehood; adherence to truth or fact."}, {"wordtype": "Adjective", "description": "A just judgment or action; that which is true or proper; justice; uprightness; integrity."}, {"wordtype": "Adjective", "description": "That to which one has a just claim."}, {"wordtype": "Adjective", "description": "That which one has a natural claim to exact."}, {"wordtype": "Adjective", "description": "That which one has a legal or social claim to do or to exact; legal power; authority; as, a sheriff has a right to arrest a criminal."}, {"wordtype": "Adjective", "description": "That which justly belongs to one; that which one has a claim to possess or own; the interest or share which anyone has in a piece of property; title; claim; interest; ownership."}, {"wordtype": "Adjective", "description": "Privilege or immunity granted by authority."}, {"wordtype": "Adjective", "description": "The right side; the side opposite to the left."}, {"wordtype": "Adjective", "description": "In some legislative bodies of Europe (as in France), those members collectively who are conservatives or monarchists. See Center, 5."}, {"wordtype": "Adjective", "description": "The outward or most finished surface, as of a piece of cloth, a carpet, etc."}, {"wordtype": "Adjective", "description": "To bring or restore to the proper or natural position; to set upright; to make right or straight (that which has been wrong or crooked); to correct."}, {"wordtype": "Adjective", "description": "To do justice to; to relieve from wrong; to restore rights to; to assert or regain the rights of; as, to right the oppressed; to right one's self; also, to vindicate."}, {"wordtype": "Verb Intransitive", "description": "To recover the proper or natural condition or position; to become upright."}, {"wordtype": "Verb Intransitive", "description": "Hence, to regain an upright position, as a ship or boat, after careening."}]}