{"definitions": [{"wordtype": "Transitive Verb", "description": "To cause to sound, especially by striking, as a metallic body; as, to ring a bell."}, {"wordtype": "Transitive Verb", "description": "To make (a sound), as by ringing a bell; to sound."}, {"wordtype": "Transitive Verb", "description": "To repeat often, loudly, or earnestly."}, {"wordtype": "Verb Intransitive", "description": "To sound, as a bell or other sonorous body, particularly a metallic one."}, {"wordtype": "Verb Intransitive", "description": "To practice making music with bells."}, {"wordtype": "Verb Intransitive", "description": "To sound loud; to resound; to be filled with a ringing or reverberating sound."}, {"wordtype": "Verb Intransitive", "description": "To continue to sound or vibrate; to resound."}, {"wordtype": "Verb Intransitive", "description": "To be filled with report or talk; as, the whole town rings with his fame."}, {"wordtype": "Noun", "description": "A sound; especially, the sound of vibrating metals; as, the ring of a bell."}, {"wordtype": "Noun", "description": "Any loud sound; the sound of numerous voices; a sound continued, repeated, or reverberated."}, {"wordtype": "Noun", "description": "A chime, or set of bells harmonically tuned."}, {"wordtype": "Noun", "description": "A circle, or a circular line, or anything in the form of a circular line or hoop."}, {"wordtype": "Noun", "description": "Specifically, a circular ornament of gold or other precious material worn on the finger, or attached to the ear, the nose, or some other part of the person; as, a wedding ring."}, {"wordtype": "Noun", "description": "A circular area in which races are or run or other sports are performed; an arena."}, {"wordtype": "Noun", "description": "An inclosed space in which pugilists fight; hence, figuratively, prize fighting."}, {"wordtype": "Noun", "description": "A circular group of persons."}, {"wordtype": "Noun", "description": "The plane figure included between the circumferences of two concentric circles."}, {"wordtype": "Noun", "description": "The solid generated by the revolution of a circle, or other figure, about an exterior straight line (as an axis) lying in the same plane as the circle or other figure."}, {"wordtype": "Noun", "description": "An instrument, formerly used for taking the sun's altitude, consisting of a brass ring suspended by a swivel, with a hole at one side through which a solar ray entering indicated the altitude on the graduated inner surface opposite."}, {"wordtype": "Noun", "description": "An elastic band partly or wholly encircling the spore cases of ferns. See Illust. of Sporangium."}, {"wordtype": "Noun", "description": "A clique; an exclusive combination of persons for a selfish purpose, as to control the market, distribute offices, obtain contracts, etc."}, {"wordtype": "Transitive Verb", "description": "To surround with a ring, or as with a ring; to encircle."}, {"wordtype": "Transitive Verb", "description": "To make a ring around by cutting away the bark; to girdle; as, to ring branches or roots."}, {"wordtype": "Transitive Verb", "description": "To fit with a ring or with rings, as the fingers, or a swine's snout."}, {"wordtype": "Verb Intransitive", "description": "To rise in the air spirally."}]}