{"definitions": [{"wordtype": "Verb", "description": "To move from a lower position to a higher; to ascend; to mount up. Specifically: -- (a) To go upward by walking, climbing, flying, or any other voluntary motion; as, a bird rises in the air; a fish rises to the bait."}, {"wordtype": "Verb", "description": "To ascend or float in a fluid, as gases or vapors in air, cork in water, and the like."}, {"wordtype": "Verb", "description": "To move upward under the influence of a projecting force; as, a bullet rises in the air."}, {"wordtype": "Verb", "description": "To grow upward; to attain a certain height; as, this elm rises to the height of seventy feet."}, {"wordtype": "Verb", "description": "To reach a higher level by increase of quantity or bulk; to swell; as, a river rises in its bed; the mercury rises in the thermometer."}, {"wordtype": "Verb", "description": "To become erect; to assume an upright position; as, to rise from a chair or from a fall."}, {"wordtype": "Verb", "description": "To leave one's bed; to arise; as, to rise early."}, {"wordtype": "Verb", "description": "To tower up; to be heaved up; as, the Alps rise far above the sea."}, {"wordtype": "Verb", "description": "To slope upward; as, a path, a line, or surface rises in this direction."}, {"wordtype": "Verb", "description": "To retire; to give up a siege."}, {"wordtype": "Verb", "description": "To swell or puff up in the process of fermentation; to become light, as dough, and the like."}, {"wordtype": "Verb", "description": "To have the aspect or the effect of rising."}, {"wordtype": "Verb", "description": "To appear above the horizont, as the sun, moon, stars, and the like."}, {"wordtype": "Verb", "description": "To become apparent; to emerge into sight; to come forth; to appear; as, an eruption rises on the skin; the land rises to view to one sailing toward the shore."}, {"wordtype": "Verb", "description": "To become perceptible to other senses than sight; as, a noise rose on the air; odor rises from the flower."}, {"wordtype": "Verb", "description": "To have a beginning; to proceed; to originate; as, rivers rise in lakes or springs."}, {"wordtype": "Verb", "description": "To increase in size, force, or value; to proceed toward a climax."}, {"wordtype": "Verb", "description": "To increase in power or fury; -- said of wind or a storm, and hence, of passion."}, {"wordtype": "Verb", "description": "To become of higher value; to increase in price."}, {"wordtype": "Verb", "description": "To become larger; to swell; -- said of a boil, tumor, and the like."}, {"wordtype": "Verb", "description": "To increase in intensity; -- said of heat."}, {"wordtype": "Verb", "description": "To become louder, or higher in pitch, as the voice."}, {"wordtype": "Verb", "description": "To increase in amount; to enlarge; as, his expenses rose beyond his expectations."}, {"wordtype": "Verb", "description": "In various figurative senses."}, {"wordtype": "Verb", "description": "To become excited, opposed, or hostile; to go to war; to take up arms; to rebel."}, {"wordtype": "Verb", "description": "To attain to a better social position; to be promoted; to excel; to succeed."}, {"wordtype": "Verb", "description": "To become more and more dignified or forcible; to increase in interest or power; -- said of style, thought, or discourse; as, to rise in force of expression; to rise in eloquence; a story rises in interest."}, {"wordtype": "Verb", "description": "To come to mind; to be suggested; to occur."}, {"wordtype": "Verb", "description": "To come; to offer itself."}, {"wordtype": "Verb", "description": "To ascend from the grave; to come to life."}, {"wordtype": "Verb", "description": "To terminate an official sitting; to adjourn; as, the committee rose after agreeing to the report."}, {"wordtype": "Verb", "description": "To ascend on a musical scale; to take a higher pith; as, to rise a tone or semitone."}, {"wordtype": "Verb", "description": "To be lifted, or to admit of being lifted, from the imposing stone without dropping any of the type; -- said of a form."}, {"wordtype": "Noun", "description": "The act of rising, or the state of being risen."}, {"wordtype": "Noun", "description": "The distance through which anything rises; as, the rise of the thermometer was ten degrees; the rise of the river was six feet; the rise of an arch or of a step."}, {"wordtype": "Noun", "description": "Land which is somewhat higher than the rest; as, the house stood on a rise of land."}, {"wordtype": "Noun", "description": "Spring; source; origin; as, the rise of a stream."}, {"wordtype": "Noun", "description": "Appearance above the horizon; as, the rise of the sun or of a planet."}, {"wordtype": "Noun", "description": "Increase; advance; augmentation, as of price, value, rank, property, fame, and the like."}, {"wordtype": "Noun", "description": "Increase of sound; a swelling of the voice."}, {"wordtype": "Noun", "description": "Elevation or ascent of the voice; upward change of key; as, a rise of a tone or semitone."}, {"wordtype": "Noun", "description": "The spring of a fish to seize food (as a fly) near the surface of the water."}]}