{"definitions": [{"wordtype": "Noun", "description": "To cause to revolve by turning over and over; to move by turning on an axis; to impel forward by causing to turn over and over on a supporting surface; as, to roll a wheel, a ball, or a barrel."}, {"wordtype": "Noun", "description": "To wrap round on itself; to form into a spherical or cylindrical body by causing to turn over and over; as, to roll a sheet of paper; to roll parchment; to roll clay or putty into a ball."}, {"wordtype": "Noun", "description": "To bind or involve by winding, as in a bandage; to inwrap; -- often with up; as, to roll up a parcel."}, {"wordtype": "Noun", "description": "To drive or impel forward with an easy motion, as of rolling; as, a river rolls its waters to the ocean."}, {"wordtype": "Noun", "description": "To utter copiously, esp. with sounding words; to utter with a deep sound; -- often with forth, or out; as, to roll forth some one's praises; to roll out sentences."}, {"wordtype": "Noun", "description": "To press or level with a roller; to spread or form with a roll, roller, or rollers; as, to roll a field; to roll paste; to roll steel rails, etc."}, {"wordtype": "Noun", "description": "To move, or cause to be moved, upon, or by means of, rollers or small wheels."}, {"wordtype": "Noun", "description": "To beat with rapid, continuous strokes, as a drum; to sound a roll upon."}, {"wordtype": "Noun", "description": "To apply (one line or surface) to another without slipping; to bring all the parts of (one line or surface) into successive contact with another, in suck manner that at every instant the parts that have been in contact are equal."}, {"wordtype": "Noun", "description": "To turn over in one's mind; to revolve."}, {"wordtype": "Verb Intransitive", "description": "To move, as a curved object may, along a surface by rotation without sliding; to revolve upon an axis; to turn over and over; as, a ball or wheel rolls on the earth; a body rolls on an inclined plane."}, {"wordtype": "Verb Intransitive", "description": "To move on wheels; as, the carriage rolls along the street."}, {"wordtype": "Verb Intransitive", "description": "To be wound or formed into a cylinder or ball; as, the cloth rolls unevenly; the snow rolls well."}, {"wordtype": "Verb Intransitive", "description": "To fall or tumble; -- with over; as, a stream rolls over a precipice."}, {"wordtype": "Verb Intransitive", "description": "To perform a periodical revolution; to move onward as with a revolution; as, the rolling year; ages roll away."}, {"wordtype": "Verb Intransitive", "description": "To turn; to move circularly."}, {"wordtype": "Verb Intransitive", "description": "To move, as waves or billows, with alternate swell and depression."}, {"wordtype": "Verb Intransitive", "description": "To incline first to one side, then to the other; to rock; as, there is a great difference in ships about rolling; in a general semse, to be tossed about."}, {"wordtype": "Verb Intransitive", "description": "To turn over, or from side to side, while lying down; to wallow; as, a horse rolls."}, {"wordtype": "Verb Intransitive", "description": "To spread under a roller or rolling-pin; as, the paste rolls well."}, {"wordtype": "Verb Intransitive", "description": "To beat a drum with strokes so rapid that they can scarcely be distinguished by the ear."}, {"wordtype": "Verb Intransitive", "description": "To make a loud or heavy rumbling noise; as, the thunder rolls."}, {"wordtype": "Verb", "description": "The act of rolling, or state of being rolled; as, the roll of a ball; the roll of waves."}, {"wordtype": "Verb", "description": "That which rolls; a roller."}, {"wordtype": "Verb", "description": "A heavy cylinder used to break clods."}, {"wordtype": "Verb", "description": "One of a set of revolving cylinders, or rollers, between which metal is pressed, formed, or smoothed, as in a rolling mill; as, to pass rails through the rolls."}, {"wordtype": "Verb", "description": "That which is rolled up; as, a roll of fat, of wool, paper, cloth, etc."}, {"wordtype": "Verb", "description": "A document written on a piece of parchment, paper, or other materials which may be rolled up; a scroll."}, {"wordtype": "Verb", "description": "Hence, an official or public document; a register; a record; also, a catalogue; a list."}, {"wordtype": "Verb", "description": "A quantity of cloth wound into a cylindrical form; as, a roll of carpeting; a roll of ribbon."}, {"wordtype": "Verb", "description": "A cylindrical twist of tobacco."}, {"wordtype": "Verb", "description": "A kind of shortened raised biscuit or bread, often rolled or doubled upon itself."}, {"wordtype": "Verb", "description": "The oscillating movement of a vessel from side to side, in sea way, as distinguished from the alternate rise and fall of bow and stern called pitching."}, {"wordtype": "Verb", "description": "A heavy, reverberatory sound; as, the roll of cannon, or of thunder."}, {"wordtype": "Verb", "description": "The uniform beating of a drum with strokes so rapid as scarcely to be distinguished by the ear."}, {"wordtype": "Verb", "description": "Part; office; duty; role."}]}