{"definitions": [{"wordtype": "Verb Intransitive", "description": "To turn up the earth with the snout, as swine."}, {"wordtype": "Verb Intransitive", "description": "Hence, to seek for favor or advancement by low arts or groveling servility; to fawn servilely."}, {"wordtype": "Transitive Verb", "description": "To turn up or to dig out with the snout; as, the swine roots the earth."}, {"wordtype": "Noun", "description": "The underground portion of a plant, whether a true root or a tuber, a bulb or rootstock, as in the potato, the onion, or the sweet flag."}, {"wordtype": "Noun", "description": "The descending, and commonly branching, axis of a plant, increasing in length by growth at its extremity only, not divided into joints, leafless and without buds, and having for its offices to fix the plant in the earth, to supply it with moisture and soluble matters, and sometimes to serve as a reservoir of nutriment for future growth. A true root, however, may never reach the ground, but may be attached to a wall, etc., as in the ivy, or may hang loosely in the air, as in some epiphytic orchids."}, {"wordtype": "Noun", "description": "An edible or esculent root, especially of such plants as produce a single root, as the beet, carrot, etc.; as, the root crop."}, {"wordtype": "Noun", "description": "That which resembles a root in position or function, esp. as a source of nourishment or support; that from which anything proceeds as if by growth or development; as, the root of a tooth, a nail, a cancer, and the like."}, {"wordtype": "Noun", "description": "An ancestor or progenitor; and hence, an early race; a stem."}, {"wordtype": "Noun", "description": "A primitive form of speech; one of the earliest terms employed in language; a word from which other words are formed; a radix, or radical."}, {"wordtype": "Noun", "description": "The cause or occasion by which anything is brought about; the source."}, {"wordtype": "Noun", "description": "That factor of a quantity which when multiplied into itself will produce that quantity; thus, 3 is a root of 9, because 3 multiplied into itself produces 9; 3 is the cube root of 27."}, {"wordtype": "Noun", "description": "The fundamental tone of any chord; the tone from whose harmonics, or overtones, a chord is composed."}, {"wordtype": "Noun", "description": "The lowest place, position, or part."}, {"wordtype": "Noun", "description": "The time which to reckon in making calculations."}, {"wordtype": "Verb Intransitive", "description": "To fix the root; to enter the earth, as roots; to take root and begin to grow."}, {"wordtype": "Verb Intransitive", "description": "To be firmly fixed; to be established."}, {"wordtype": "Transitive Verb", "description": "To plant and fix deeply in the earth, or as in the earth; to implant firmly; hence, to make deep or radical; to establish; -- used chiefly in the participle; as, rooted trees or forests; rooted dislike."}, {"wordtype": "Transitive Verb", "description": "To tear up by the root; to eradicate; to extirpate; -- with up, out, or away."}]}