{"definitions": ["To whisper.", "Having every portion of the surface or of the circumference equally distant from the center; spherical; circular; having a form approaching a spherical or a circular shape; orbicular; globular; as, a round ball.", "Having the form of a cylinder; cylindrical; as, the barrel of a musket is round.", "Having a curved outline or form; especially, one like the arc of a circle or an ellipse, or a portion of the surface of a sphere; rotund; bulging; protuberant; not angular or pointed; as, a round arch; round hills.", "Full; complete; not broken; not fractional; approximately in even units, tens, hundreds, thousands, etc.; -- said of numbers.", "Not inconsiderable; large; hence, generous; free; as, a round price.", "Uttered or emitted with a full tone; as, a round voice; a round note.", "Modified, as a vowel, by contraction of the lip opening, making the opening more or less round in shape; rounded; labialized; labial. See Guide to Pronunciation, / 11.", "Outspoken; plain and direct; unreserved; unqualified; not mincing; as, a round answer; a round oath.", "Full and smoothly expanded; not defective or abrupt; finished; polished; -- said of style, or of authors with reference to their style.", "Complete and consistent; fair; just; -- applied to conduct.", "Anything round, as a circle, a globe, a ring. \"The golden round\" [the crown].", "A series of changes or events ending where it began; a series of like events recurring in continuance; a cycle; a periodical revolution; as, the round of the seasons; a round of pleasures.", "A course of action or conduct performed by a number of persons in turn, or one after another, as if seated in a circle.", "A series of duties or tasks which must be performed in turn, and then repeated.", "A circular dance.", "That which goes round a whole circle or company; as, a round of applause.", "Rotation, as in office; succession.", "The step of a ladder; a rundle or rung; also, a crosspiece which joins and braces the legs of a chair.", "A course ending where it began; a circuit; a beat; especially, one freguently or regulary traversed; also, the act of traversing a circuit; as, a watchman's round; the rounds of the postman.", "A walk performed by a guard or an officer round the rampart of a garrison, or among sentinels, to see that the sentinels are faithful and all things safe; also, the guard or officer, with his attendants, who performs this duty; -- usually in the plural.", "A general discharge of firearms by a body of troops in which each soldier fires once.", "Ammunition for discharging a piece or pieces once; as, twenty rounds of ammunition were given out.", "A short vocal piece, resembling a catch in which three or four voices follow each other round in a species of canon in the unison.", "The time during which prize fighters or boxers are in actual contest without an intermission, as prescribed by their rules; a bout.", "A brewer's vessel in which the fermentation is concluded, the yeast escaping through the bunghole.", "A vessel filled, as for drinking.", "An assembly; a group; a circle; as, a round of politicians.", "See Roundtop.", "Same as Round of beef, below.", "On all sides; around.", "Circularly; in a circular form or manner; by revolving or reversing one's position; as, to turn one's head round; a wheel turns round.", "In circumference; as, a ball is ten inches round.", "From one side or party to another; as to come or turn round, -- that is, to change sides or opinions.", "By or in a circuit; by a course longer than the direct course; back to the starting point.", "Through a circle, as of friends or houses.", "Roundly; fully; vigorously.", "On every side of, so as to encompass or encircle; around; about; as, the people atood round him; to go round the city; to wind a cable round a windlass.", "To make circular, spherical, or cylindrical; to give a round or convex figure to; as, to round a silver coin; to round the edges of anything.", "To surround; to encircle; to encompass.", "To bring to fullness or completeness; to complete; hence, to bring to a fit conclusion.", "To go round wholly or in part; to go about (a corner or point); as, to round a corner; to round Cape Horn.", "To make full, smooth, and flowing; as, to round periods in writing.", "To grow round or full; hence, to attain to fullness, completeness, or perfection.", "To go round, as a guard.", "To go or turn round; to wheel about."]}