{"definitions": [{"wordtype": "Transitive Verb", "description": "To subject (a body) to the action of something moving over its surface with pressure and friction, especially to the action of something moving back and forth; as, to rub the flesh with the hand; to rub wood with sandpaper."}, {"wordtype": "Transitive Verb", "description": "To move over the surface of (a body) with pressure and friction; to graze; to chafe; as, the boat rubs the ground."}, {"wordtype": "Transitive Verb", "description": "To cause (a body) to move with pressure and friction along a surface; as, to rub the hand over the body."}, {"wordtype": "Transitive Verb", "description": "To spread a substance thinly over; to smear."}, {"wordtype": "Transitive Verb", "description": "To scour; to burnish; to polish; to brighten; to cleanse; -- often with up or over; as, to rub up silver."}, {"wordtype": "Transitive Verb", "description": "To hinder; to cross; to thwart."}, {"wordtype": "Verb Intransitive", "description": "To move along the surface of a body with pressure; to grate; as, a wheel rubs against the gatepost."}, {"wordtype": "Verb Intransitive", "description": "To fret; to chafe; as, to rub upon a sore."}, {"wordtype": "Verb Intransitive", "description": "To move or pass with difficulty; as, to rub through woods, as huntsmen; to rub through the world."}, {"wordtype": "Noun", "description": "The act of rubbing; friction."}, {"wordtype": "Noun", "description": "That which rubs; that which tends to hinder or obstruct motion or progress; hindrance; obstruction, an impediment; especially, a difficulty or obstruction hard to overcome; a pinch."}, {"wordtype": "Noun", "description": "Inequality of surface, as of the ground in the game of bowls; unevenness."}, {"wordtype": "Noun", "description": "Something grating to the feelings; sarcasm; joke; as, a hard rub."}, {"wordtype": "Noun", "description": "Imperfection; failing; fault."}, {"wordtype": "Noun", "description": "A chance."}, {"wordtype": "Noun", "description": "A stone, commonly flat, used to sharpen cutting tools; a whetstone; -- called also rubstone."}]}