{"definitions": ["That which is prescribed or laid down as a guide for conduct or action; a governing direction for a specific purpose; an authoritative enactment; a regulation; a prescription; a precept; as, the rules of various societies; the rules governing a school; a rule of etiquette or propriety; the rules of cricket.", "Uniform or established course of things.", "Systematic method or practice; as, my ule is to rise at six o'clock.", "Ordibary course of procedure; usual way; comon state or condition of things; as, it is a rule to which there are many exeptions.", "Conduct in general; behavior.", "The act of ruling; administration of law; government; empire; authority; control.", "An order regulating the practice of the courts, or an order made between parties to an action or a suit.", "A determinate method prescribed for performing any operation and producing a certain result; as, a rule for extracting the cube root.", "A general principle concerning the formation or use of words, or a concise statement thereof; thus, it is a rule in England, that s or es , added to a noun in the singular number, forms the plural of that noun; but \"man\" forms its plural \"men\", and is an exception to the rule.", "A straight strip of wood, metal, or the like, which serves as a guide in drawing a straight line; a ruler.", "A measuring instrument consisting of a graduated bar of wood, ivory, metal, or the like, which is usually marked so as to show inches and fractions of an inch, and jointed so that it may be folded compactly.", "A thin plate of metal (usually brass) of the same height as the type, and used for printing lines, as between columns on the same page, or in tabular work.", "A composing rule. See under Conposing.", "To control the will and actions of; to exercise authority or dominion over; to govern; to manage.", "To control or direct by influence, counsel, or persuasion; to guide; -- used chiefly in the passive.", "To establish or settle by, or as by, a rule; to fix by universal or general consent, or by common practice.", "To require or command by rule; to give as a direction or order of court.", "To mark with lines made with a pen, pencil, etc., guided by a rule or ruler; to print or mark with lines by means of a rule or other contrivance effecting a similar result; as, to rule a sheet of paper of a blank book.", "To have power or command; to exercise supreme authority; -- often followed by over.", "To lay down and settle a rule or order of court; to decide an incidental point; to enter a rule.", "To keep within a (certain) range for a time; to be in general, or as a rule; as, prices ruled lower yesterday than the day before."]}