{"definitions": [{"wordtype": "Noun", "description": "The chloride of sodium, a substance used for seasoning food, for the preservation of meat, etc. It is found native in the earth, and is also produced, by evaporation and crystallization, from sea water and other water impregnated with saline particles."}, {"wordtype": "Noun", "description": "Hence, flavor; taste; savor; smack; seasoning."}, {"wordtype": "Noun", "description": "Hence, also, piquancy; wit; sense; as, Attic salt."}, {"wordtype": "Noun", "description": "A dish for salt at table; a saltcellar."}, {"wordtype": "Noun", "description": "A sailor; -- usually qualified by old."}, {"wordtype": "Noun", "description": "The neutral compound formed by the union of an acid and a base; thus, sulphuric acid and iron form the salt sulphate of iron or green vitriol."}, {"wordtype": "Noun", "description": "Fig.: That which preserves from corruption or error; that which purifies; a corrective; an antiseptic; also, an allowance or deduction; as, his statements must be taken with a grain of salt."}, {"wordtype": "Noun", "description": "Any mineral salt used as an aperient or cathartic, especially Epsom salts, Rochelle salt, or Glauber's salt."}, {"wordtype": "Noun", "description": "Marshes flooded by the tide."}, {"wordtype": "Noun", "description": "Of or relating to salt; abounding in, or containing, salt; prepared or preserved with, or tasting of, salt; salted; as, salt beef; salt water."}, {"wordtype": "Noun", "description": "Overflowed with, or growing in, salt water; as, a salt marsh; salt grass."}, {"wordtype": "Noun", "description": "Fig.: Bitter; sharp; pungent."}, {"wordtype": "Noun", "description": "Fig.: Salacious; lecherous; lustful."}, {"wordtype": "Transitive Verb", "description": "To sprinkle, impregnate, or season with salt; to preserve with salt or in brine; to supply with salt; as, to salt fish, beef, or pork; to salt cattle."}, {"wordtype": "Transitive Verb", "description": "To fill with salt between the timbers and planks, as a ship, for the preservation of the timber."}, {"wordtype": "Verb Intransitive", "description": "To deposit salt as a saline solution; as, the brine begins to salt."}, {"wordtype": "Noun", "description": "The act of leaping or jumping; a leap."}]}