{"definitions": [{"wordtype": "Noun", "description": "The dish of a balance; hence, the balance itself; an instrument or machine for weighing; as, to turn the scale; -- chiefly used in the plural when applied to the whole instrument or apparatus for weighing. Also used figuratively."}, {"wordtype": "Noun", "description": "The sign or constellation Libra."}, {"wordtype": "Transitive Verb", "description": "To weigh or measure according to a scale; to measure; also, to grade or vary according to a scale or system."}, {"wordtype": "Noun", "description": "One of the small, thin, membranous, bony or horny pieces which form the covering of many fishes and reptiles, and some mammals, belonging to the dermal part of the skeleton, or dermoskeleton. See Cycloid, Ctenoid, and Ganoid."}, {"wordtype": "Noun", "description": "Hence, any layer or leaf of metal or other material, resembling in size and thinness the scale of a fish; as, a scale of iron, of bone, etc."}, {"wordtype": "Noun", "description": "One of the small scalelike structures covering parts of some invertebrates, as those on the wings of Lepidoptera and on the body of Thysanura; the elytra of certain annelids. See Lepidoptera."}, {"wordtype": "Noun", "description": "A scale insect. (See below.)"}, {"wordtype": "Noun", "description": "A small appendage like a rudimentary leaf, resembling the scales of a fish in form, and often in arrangement; as, the scale of a bud, of a pine cone, and the like. The name is also given to the chaff on the stems of ferns."}, {"wordtype": "Noun", "description": "The thin metallic side plate of the handle of a pocketknife. See Illust. of Pocketknife."}, {"wordtype": "Noun", "description": "An incrustation deposit on the inside of a vessel in which water is heated, as a steam boiler."}, {"wordtype": "Noun", "description": "The thin oxide which forms on the surface of iron forgings. It consists essentially of the magnetic oxide, Fe3O4. Also, a similar coating upon other metals."}, {"wordtype": "Transitive Verb", "description": "To strip or clear of scale or scales; as, to scale a fish; to scale the inside of a boiler."}, {"wordtype": "Transitive Verb", "description": "To take off in thin layers or scales, as tartar from the teeth; to pare off, as a surface."}, {"wordtype": "Transitive Verb", "description": "To scatter; to spread."}, {"wordtype": "Transitive Verb", "description": "To clean, as the inside of a cannon, by the explosion of a small quantity of powder."}, {"wordtype": "Verb Intransitive", "description": "To separate and come off in thin layers or laminae; as, some sandstone scales by exposure."}, {"wordtype": "Verb Intransitive", "description": "To separate; to scatter."}, {"wordtype": "Noun", "description": "A ladder; a series of steps; a means of ascending."}, {"wordtype": "Noun", "description": "Hence, anything graduated, especially when employed as a measure or rule, or marked by lines at regular intervals."}, {"wordtype": "Noun", "description": "A mathematical instrument, consisting of a slip of wood, ivory, or metal, with one or more sets of spaces graduated and numbered on its surface, for measuring or laying off distances, etc., as in drawing, plotting, and the like. See Gunter's scale."}, {"wordtype": "Noun", "description": "A series of spaces marked by lines, and representing proportionately larger distances; as, a scale of miles, yards, feet, etc., for a map or plan."}, {"wordtype": "Noun", "description": "A basis for a numeral system; as, the decimal scale; the binary scale, etc."}, {"wordtype": "Noun", "description": "The graduated series of all the tones, ascending or descending, from the keynote to its octave; -- called also the gamut. It may be repeated through any number of octaves. See Chromatic scale, Diatonic scale, Major scale, and Minor scale, under Chromatic, Diatonic, Major, and Minor."}, {"wordtype": "Noun", "description": "Gradation; succession of ascending and descending steps and degrees; progressive series; scheme of comparative rank or order; as, a scale of being."}, {"wordtype": "Noun", "description": "Relative dimensions, without difference in proportion of parts; size or degree of the parts or components in any complex thing, compared with other like things; especially, the relative proportion of the linear dimensions of the parts of a drawing, map, model, etc., to the dimensions of the corresponding parts of the object that is represented; as, a map on a scale of an inch to a mile."}, {"wordtype": "Transitive Verb", "description": "To climb by a ladder, or as if by a ladder; to ascend by steps or by climbing; to clamber up; as, to scale the wall of a fort."}, {"wordtype": "Verb Intransitive", "description": "To lead up by steps; to ascend."}]}