{"definitions": [{"wordtype": "Noun", "description": "A notch or incision; especially, one that is made as a tally mark; hence, a mark, or line, made for the purpose of account."}, {"wordtype": "Noun", "description": "An account or reckoning; account of dues; bill; hence, indebtedness."}, {"wordtype": "Noun", "description": "Account; reason; motive; sake; behalf."}, {"wordtype": "Noun", "description": "The number twenty, as being marked off by a special score or tally; hence, in pl., a large number."}, {"wordtype": "Noun", "description": "A distance of twenty yards; -- a term used in ancient archery and gunnery."}, {"wordtype": "Noun", "description": "A weight of twenty pounds."}, {"wordtype": "Noun", "description": "The number of points gained by the contestants, or either of them, in any game, as in cards or cricket."}, {"wordtype": "Noun", "description": "A line drawn; a groove or furrow."}, {"wordtype": "Noun", "description": "The original and entire draught, or its transcript, of a composition, with the parts for all the different instruments or voices written on staves one above another, so that they can be read at a glance; -- so called from the bar, which, in its early use, was drawn through all the parts."}, {"wordtype": "Transitive Verb", "description": "To mark with lines, scratches, or notches; to cut notches or furrows in; to notch; to scratch; to furrow; as, to score timber for hewing; to score the back with a lash."}, {"wordtype": "Transitive Verb", "description": "Especially, to mark with significant lines or notches, for indicating or keeping account of something; as, to score a tally."}, {"wordtype": "Transitive Verb", "description": "To mark or signify by lines or notches; to keep record or account of; to set down; to record; to charge."}, {"wordtype": "Transitive Verb", "description": "To engrave, as upon a shield."}, {"wordtype": "Transitive Verb", "description": "To make a score of, as points, runs, etc., in a game."}, {"wordtype": "Transitive Verb", "description": "To write down in proper order and arrangement; as, to score an overture for an orchestra. See Score, n., 9."}, {"wordtype": "Noun", "description": "To mark with parallel lines or scratches; as, the rocks of New England and the Western States were scored in the drift epoch."}]}