{"definitions": [{"wordtype": "Transitive Verb", "description": "To rub over the surface of (something) with a sharp or rough instrument; to rub over with something that roughens by removing portions of the surface; to grate harshly over; to abrade; to make even, or bring to a required condition or form, by moving the sharp edge of an instrument breadthwise over the surface with pressure, cutting away excesses and superfluous parts; to make smooth or clean; as, to scrape a bone with a knife; to scrape a metal plate to an even surface."}, {"wordtype": "Transitive Verb", "description": "To remove by rubbing or scraping (in the sense above)."}, {"wordtype": "Transitive Verb", "description": "To collect by, or as by, a process of scraping; to gather in small portions by laborious effort; hence, to acquire avariciously and save penuriously; -- often followed by together or up; as, to scrape money together."}, {"wordtype": "Transitive Verb", "description": "To express disapprobation of, as a play, or to silence, as a speaker, by drawing the feet back and forth upon the floor; -- usually with down."}, {"wordtype": "Verb Intransitive", "description": "To rub over the surface of anything with something which roughens or removes it, or which smooths or cleans it; to rub harshly and noisily along."}, {"wordtype": "Verb Intransitive", "description": "To occupy one's self with getting laboriously; as, he scraped and saved until he became rich."}, {"wordtype": "Verb Intransitive", "description": "To play awkwardly and inharmoniously on a violin or like instrument."}, {"wordtype": "Verb Intransitive", "description": "To draw back the right foot along the ground or floor when making a bow."}, {"wordtype": "Noun", "description": "The act of scraping; also, the effect of scraping, as a scratch, or a harsh sound; as, a noisy scrape on the floor; a scrape of a pen."}, {"wordtype": "Noun", "description": "A drawing back of the right foot when bowing; also, a bow made with that accompaniment."}, {"wordtype": "Noun", "description": "A disagreeable and embarrassing predicament out of which one can not get without undergoing, as it were, a painful rubbing or scraping; a perplexity; a difficulty."}]}