{"definitions": [{"wordtype": "Noun", "description": "A cylinder, or a cylindrical perforation, having a continuous rib, called the thread, winding round it spirally at a constant inclination, so as to leave a continuous spiral groove between one turn and the next, -- used chiefly for producing, when revolved, motion or pressure in the direction of its axis, by the sliding of the threads of the cylinder in the grooves between the threads of the perforation adapted to it, the former being distinguished as the external, or male screw, or, more usually the screw; the latter as the internal, or female screw, or, more usually, the nut."}, {"wordtype": "Noun", "description": "Specifically, a kind of nail with a spiral thread and a head with a nick to receive the end of the screw-driver. Screws are much used to hold together pieces of wood or to fasten something; -- called also wood screws, and screw nails. See also Screw bolt, below."}, {"wordtype": "Noun", "description": "Anything shaped or acting like a screw; esp., a form of wheel for propelling steam vessels. It is placed at the stern, and furnished with blades having helicoidal surfaces to act against the water in the manner of a screw. See Screw propeller, below."}, {"wordtype": "Noun", "description": "A steam vesel propelled by a screw instead of wheels; a screw steamer; a propeller."}, {"wordtype": "Noun", "description": "An extortioner; a sharp bargainer; a skinflint; a niggard."}, {"wordtype": "Noun", "description": "An instructor who examines with great or unnecessary severity; also, a searching or strict examination of a student by an instructor."}, {"wordtype": "Noun", "description": "A small packet of tobacco."}, {"wordtype": "Noun", "description": "An unsound or worn-out horse, useful as a hack, and commonly of good appearance."}, {"wordtype": "Noun", "description": "A straight line in space with which a definite linear magnitude termed the pitch is associated (cf. 5th Pitch, 10 (b)). It is used to express the displacement of a rigid body, which may always be made to consist of a rotation about an axis combined with a translation parallel to that axis."}, {"wordtype": "Noun", "description": "An amphipod crustacean; as, the skeleton screw (Caprella). See Sand screw, under Sand."}, {"wordtype": "Transitive Verb", "description": "To turn, as a screw; to apply a screw to; to press, fasten, or make firm, by means of a screw or screws; as, to screw a lock on a door; to screw a press."}, {"wordtype": "Transitive Verb", "description": "To force; to squeeze; to press, as by screws."}, {"wordtype": "Transitive Verb", "description": "Hence: To practice extortion upon; to oppress by unreasonable or extortionate exactions."}, {"wordtype": "Transitive Verb", "description": "To twist; to distort; as, to screw his visage."}, {"wordtype": "Transitive Verb", "description": "To examine rigidly, as a student; to subject to a severe examination."}, {"wordtype": "Verb Intransitive", "description": "To use violent mans in making exactions; to be oppressive or exacting."}, {"wordtype": "Verb Intransitive", "description": "To turn one's self uneasily with a twisting motion; as, he screws about in his chair."}]}