{"definitions": [{"wordtype": "Noun", "description": "Any aquatic carnivorous mammal of the families Phocidae and Otariidae."}, {"wordtype": "Noun", "description": "An engraved or inscribed stamp, used for marking an impression in wax or other soft substance, to be attached to a document, or otherwise used by way of authentication or security."}, {"wordtype": "Noun", "description": "Wax, wafer, or other tenacious substance, set to an instrument, and impressed or stamped with a seal; as, to give a deed under hand and seal."}, {"wordtype": "Noun", "description": "That which seals or fastens; esp., the wax or wafer placed on a letter or other closed paper, etc., to fasten it."}, {"wordtype": "Noun", "description": "That which confirms, ratifies, or makes stable; that which authenticates; that which secures; assurance."}, {"wordtype": "Noun", "description": "An arrangement for preventing the entrance or return of gas or air into a pipe, by which the open end of the pipe dips beneath the surface of water or other liquid, or a deep bend or sag in the pipe is filled with the liquid; a draintrap."}, {"wordtype": "Transitive Verb", "description": "To set or affix a seal to; hence, to authenticate; to confirm; to ratify; to establish; as, to seal a deed."}, {"wordtype": "Transitive Verb", "description": "To mark with a stamp, as an evidence of standard exactness, legal size, or merchantable quality; as, to seal weights and measures; to seal silverware."}, {"wordtype": "Transitive Verb", "description": "To fasten with a seal; to attach together with a wafer, wax, or other substance causing adhesion; as, to seal a letter."}, {"wordtype": "Transitive Verb", "description": "Hence, to shut close; to keep close; to make fast; to keep secure or secret."}, {"wordtype": "Transitive Verb", "description": "To fix, as a piece of iron in a wall, with cement, plaster, or the like."}, {"wordtype": "Transitive Verb", "description": "To close by means of a seal; as, to seal a drainpipe with water. See 2d Seal, 5."}, {"wordtype": "Transitive Verb", "description": "Among the Mormons, to confirm or set apart as a second or additional wife."}, {"wordtype": "Verb Intransitive", "description": "To affix one's seal, or a seal."}]}