{"definitions": [{"wordtype": "Noun", "description": "A smooth, flat surface, like the side of a board; a thin, flat, smooth piece of anything; a slab."}, {"wordtype": "Noun", "description": "A thin, flat piece of wood, stone, metal, or other material, on which anything is cut, traced, written, or painted; a tablet"}, {"wordtype": "Noun", "description": "a memorandum book."}, {"wordtype": "Noun", "description": "Any smooth, flat surface upon which an inscription, a drawing, or the like, may be produced."}, {"wordtype": "Noun", "description": "Hence, in a great variety of applications: A condensed statement which may be comprehended by the eye in a single view; a methodical or systematic synopsis; the presentation of many items or particulars in one group; a scheme; a schedule."}, {"wordtype": "Noun", "description": "A view of the contents of a work; a statement of the principal topics discussed; an index; a syllabus; a synopsis; as, a table of contents."}, {"wordtype": "Noun", "description": "A list of substances and their properties; especially, a list of the elementary substances with their atomic weights, densities, symbols, etc."}, {"wordtype": "Noun", "description": "Any collection and arrangement in a condensed form of many particulars or values, for ready reference, as of weights, measures, currency, specific gravities, etc.; also, a series of numbers following some law, and expressing particular values corresponding to certain other numbers on which they depend, and by means of which they are taken out for use in computations; as, tables of logarithms, sines, tangents, squares, cubes, etc.; annuity tables; interest tables; astronomical tables, etc."}, {"wordtype": "Noun", "description": "The arrangement or disposition of the lines which appear on the inside of the hand."}, {"wordtype": "Noun", "description": "An article of furniture, consisting of a flat slab, board, or the like, having a smooth surface, fixed horizontally on legs, and used for a great variety of purposes, as in eating, writing, or working."}, {"wordtype": "Noun", "description": "Hence, food placed on a table to be partaken of; fare; entertainment; as, to set a good table."}, {"wordtype": "Noun", "description": "The company assembled round a table."}, {"wordtype": "Noun", "description": "One of the two, external and internal, layers of compact bone, separated by diploe, in the walls of the cranium."}, {"wordtype": "Noun", "description": "A stringcourse which includes an offset; esp., a band of stone, or the like, set where an offset is required, so as to make it decorative. See Water table."}, {"wordtype": "Noun", "description": "The board on the opposite sides of which backgammon and draughts are played."}, {"wordtype": "Noun", "description": "One of the divisions of a backgammon board; as, to play into the right-hand table."}, {"wordtype": "Noun", "description": "The games of backgammon and of draughts."}, {"wordtype": "Noun", "description": "A circular plate of crown glass."}, {"wordtype": "Noun", "description": "The upper flat surface of a diamond or other precious stone, the sides of which are cut in angles."}, {"wordtype": "Noun", "description": "A plane surface, supposed to be transparent and perpendicular to the horizon; -- called also perspective plane."}, {"wordtype": "Noun", "description": "The part of a machine tool on which the work rests and is fastened."}, {"wordtype": "Transitive Verb", "description": "To form into a table or catalogue; to tabulate; as, to table fines."}, {"wordtype": "Transitive Verb", "description": "To delineate, as on a table; to represent, as in a picture."}, {"wordtype": "Transitive Verb", "description": "To supply with food; to feed."}, {"wordtype": "Transitive Verb", "description": "To insert, as one piece of timber into another, by alternate scores or projections from the middle, to prevent slipping; to scarf."}, {"wordtype": "Transitive Verb", "description": "To lay or place on a table, as money."}, {"wordtype": "Transitive Verb", "description": "In parliamentary usage, to lay on the table; to postpone, by a formal vote, the consideration of (a bill, motion, or the like) till called for, or indefinitely."}, {"wordtype": "Transitive Verb", "description": "To enter upon the docket; as, to table charges against some one."}, {"wordtype": "Transitive Verb", "description": "To make board hems in the skirts and bottoms of (sails) in order to strengthen them in the part attached to the boltrope."}, {"wordtype": "Verb Intransitive", "description": "To live at the table of another; to board; to eat."}]}