{"definitions": [{"wordtype": "Noun", "description": "Limitation; abridgment."}, {"wordtype": "Adjective", "description": "Limited; abridged; reduced; curtailed; as, estate tail."}, {"wordtype": "Noun", "description": "The terminal, and usually flexible, posterior appendage of an animal."}, {"wordtype": "Noun", "description": "Any long, flexible terminal appendage; whatever resembles, in shape or position, the tail of an animal, as a catkin."}, {"wordtype": "Noun", "description": "Hence, the back, last, lower, or inferior part of anything, -- as opposed to the head, or the superior part."}, {"wordtype": "Noun", "description": "A train or company of attendants; a retinue."}, {"wordtype": "Noun", "description": "The side of a coin opposite to that which bears the head, effigy, or date; the reverse; -- rarely used except in the expression \"heads or tails,\" employed when a coin is thrown up for the purpose of deciding some point by its fall."}, {"wordtype": "Noun", "description": "The distal tendon of a muscle."}, {"wordtype": "Noun", "description": "A downy or feathery appendage to certain achenes. It is formed of the permanent elongated style."}, {"wordtype": "Noun", "description": "A portion of an incision, at its beginning or end, which does not go through the whole thickness of the skin, and is more painful than a complete incision; -- called also tailing."}, {"wordtype": "Noun", "description": "One of the strips at the end of a bandage formed by splitting the bandage one or more times."}, {"wordtype": "Noun", "description": "A rope spliced to the strap of a block, by which it may be lashed to anything."}, {"wordtype": "Noun", "description": "The part of a note which runs perpendicularly upward or downward from the head; the stem."}, {"wordtype": "Noun", "description": "Same as Tailing, 4."}, {"wordtype": "Noun", "description": "The bottom or lower portion of a member or part, as a slate or tile."}, {"wordtype": "Noun", "description": "See Tailing, n., 5."}, {"wordtype": "Transitive Verb", "description": "To follow or hang to, like a tail; to be attached closely to, as that which can not be evaded."}, {"wordtype": "Transitive Verb", "description": "To pull or draw by the tail."}, {"wordtype": "Verb Intransitive", "description": "To hold by the end; -- said of a timber when it rests upon a wall or other support; -- with in or into."}, {"wordtype": "Verb Intransitive", "description": "To swing with the stern in a certain direction; -- said of a vessel at anchor; as, this vessel tails down stream."}]}