{"definitions": [{"wordtype": "Adverb", "description": "An inseparable prefix, or particle, signifying not; in-; non-. In- is prefixed mostly to words of Latin origin, or else to words formed by Latin suffixes; un- is of much wider application, and is attached at will to almost any adjective, or participle used adjectively, or adverb, from which it may be desired to form a corresponding negative adjective or adverb, and is also, but less freely, prefixed to nouns. Un- sometimes has merely an intensive force; as in unmerciless, unremorseless."}, {"wordtype": "Adverb", "description": "Un- is prefixed to adjectives, or to words used adjectively."}, {"wordtype": "Adverb", "description": "To adjectives, to denote the absence of the quality designated by the adjective"}, {"wordtype": "Adverb", "description": "To past particles, or to adjectives formed after the analogy of past particles, to indicate the absence of the condition or state expressed by them"}, {"wordtype": "Adverb", "description": "To present particles which come from intransitive verbs, or are themselves employed as adjectives, to mark the absence of the activity, disposition, or condition implied by the participle; as, - ---- and the like."}, {"wordtype": "Adverb", "description": "Those which have acquired an opposed or contrary, instead of a merely negative, meaning; as, unfriendly, ungraceful, unpalatable, unquiet, and the like; or else an intensive sense more than a prefixed not would express; as, unending, unparalleled, undisciplined, undoubted, unsafe, and the like."}, {"wordtype": "Adverb", "description": "Those which have the value of independent words, inasmuch as the simple words are either not used at all, or are rarely, or at least much less frequently, used; as, unavoidable, unconscionable, undeniable, unspeakable, unprecedented, unruly, and the like; or inasmuch as they are used in a different sense from the usual meaning of the primitive, or especially in one of the significations of the latter; as, unaccountable, unalloyed, unbelieving, unpretending, unreserved, and the like; or inasmuch as they are so frequently and familiarly used that they are hardly felt to be of negative origin; as, uncertain, uneven, and the like."}, {"wordtype": "Adverb", "description": "Those which are anomalous, provincial, or, for some other reason, not desirable to be used, and are so indicated; as, unpure for impure, unsatisfaction for dissatisfaction, unexpressible for inexpressible, and the like."}, {"wordtype": "Adverb", "description": "Un- is prefixed to nouns to express the absence of, or the contrary of, that which the noun signifies; as, unbelief, unfaith, unhealth, unrest, untruth, and the like."}]}