{"definitions": [{"wordtype": "Transitive Verb", "description": "The act of employing anything, or of applying it to one's service; the state of being so employed or applied; application; employment; conversion to some purpose; as, the use of a pen in writing; his machines are in general use."}, {"wordtype": "Transitive Verb", "description": "Occasion or need to employ; necessity; as, to have no further use for a book."}, {"wordtype": "Transitive Verb", "description": "Yielding of service; advantage derived; capability of being used; usefulness; utility."}, {"wordtype": "Transitive Verb", "description": "Continued or repeated practice; customary employment; usage; custom; manner; habit."}, {"wordtype": "Transitive Verb", "description": "Common occurrence; ordinary experience."}, {"wordtype": "Transitive Verb", "description": "The special form of ritual adopted for use in any diocese; as, the Sarum, or Canterbury, use; the Hereford use; the York use; the Roman use; etc."}, {"wordtype": "Transitive Verb", "description": "The premium paid for the possession and employment of borrowed money; interest; usury."}, {"wordtype": "Transitive Verb", "description": "The benefit or profit of lands and tenements. Use imports a trust and confidence reposed in a man for the holding of lands. He to whose use or benefit the trust is intended shall enjoy the profits. An estate is granted and limited to A for the use of B."}, {"wordtype": "Transitive Verb", "description": "A stab of iron welded to the side of a forging, as a shaft, near the end, and afterward drawn down, by hammering, so as to lengthen the forging."}, {"wordtype": "Transitive Verb", "description": "To make use of; to convert to one's service; to avail one's self of; to employ; to put a purpose; as, to use a plow; to use a chair; to use time; to use flour for food; to use water for irrigation."}, {"wordtype": "Transitive Verb", "description": "To behave toward; to act with regard to; to treat; as, to use a beast cruelly."}, {"wordtype": "Transitive Verb", "description": "To practice customarily; to make a practice of; as, to use diligence in business."}, {"wordtype": "Transitive Verb", "description": "To accustom; to habituate; to render familiar by practice; to inure; -- employed chiefly in the passive participle; as, men used to cold and hunger; soldiers used to hardships and danger."}, {"wordtype": "Verb Intransitive", "description": "To be wont or accustomed; to be in the habit or practice; as, he used to ride daily; -- now disused in the present tense, perhaps because of the similarity in sound, between \"use to,\" and \"used to.\""}, {"wordtype": "Verb Intransitive", "description": "To be accustomed to go; to frequent; to inhabit; to dwell; -- sometimes followed by of."}]}