{"definitions": [{"wordtype": "Verb Intransitive", "description": "To move along on foot; to advance by steps; to go on at a moderate pace; specifically, of two-legged creatures, to proceed at a slower or faster rate, but without running, or lifting one foot entirely before the other touches the ground."}, {"wordtype": "Verb Intransitive", "description": "To move or go on the feet for exercise or amusement; to take one's exercise; to ramble."}, {"wordtype": "Verb Intransitive", "description": "To be stirring; to be abroad; to go restlessly about; -- said of things or persons expected to remain quiet, as a sleeping person, or the spirit of a dead person; to go about as a somnambulist or a specter."}, {"wordtype": "Verb Intransitive", "description": "To be in motion; to act; to move; to wag."}, {"wordtype": "Verb Intransitive", "description": "To behave; to pursue a course of life; to conduct one's self."}, {"wordtype": "Verb Intransitive", "description": "To move off; to depart."}, {"wordtype": "Transitive Verb", "description": "To pass through, over, or upon; to traverse; to perambulate; as, to walk the streets."}, {"wordtype": "Transitive Verb", "description": "To cause to walk; to lead, drive, or ride with a slow pace; as to walk one's horses."}, {"wordtype": "Transitive Verb", "description": "To subject, as cloth or yarn, to the fulling process; to full."}, {"wordtype": "Noun", "description": "The act of walking, or moving on the feet with a slow pace; advance without running or leaping."}, {"wordtype": "Noun", "description": "The act of walking for recreation or exercise; as, a morning walk; an evening walk."}, {"wordtype": "Noun", "description": "Manner of walking; gait; step; as, we often know a person at a distance by his walk."}, {"wordtype": "Noun", "description": "That in or through which one walks; place or distance walked over; a place for walking; a path or avenue prepared for foot passengers, or for taking air and exercise; way; road; hence, a place or region in which animals may graze; place of wandering; range; as, a sheep walk."}, {"wordtype": "Noun", "description": "A frequented track; habitual place of action; sphere; as, the walk of the historian."}, {"wordtype": "Noun", "description": "Conduct; course of action; behavior."}, {"wordtype": "Noun", "description": "The route or district regularly served by a vender; as, a milkman's walk."}]}