{"definitions": [{"wordtype": "Verb Intransitive", "description": "Alt. of -wards"}, {"wordtype": "Adjective", "description": "The act of guarding; watch; guard; guardianship; specifically, a guarding during the day.  See the Note under Watch, n., 1."}, {"wordtype": "Noun", "description": "One who, or that which, guards; garrison; defender; protector; means of guarding; defense; protection."}, {"wordtype": "Noun", "description": "The state of being under guard or guardianship; confinement under guard; the condition of a child under a guardian; custody."}, {"wordtype": "Noun", "description": "A guarding or defensive motion or position, as in fencing; guard."}, {"wordtype": "Noun", "description": "One who, or that which, is guarded."}, {"wordtype": "Noun", "description": "A minor or person under the care of a guardian; as, a ward in chancery."}, {"wordtype": "Noun", "description": "A division of a county."}, {"wordtype": "Noun", "description": "A division, district, or quarter of a town or city."}, {"wordtype": "Noun", "description": "A division of a forest."}, {"wordtype": "Noun", "description": "A division of a hospital; as, a fever ward."}, {"wordtype": "Noun", "description": "A projecting ridge of metal in the interior of a lock, to prevent the use of any key which has not a corresponding notch for passing it."}, {"wordtype": "Noun", "description": "A notch or slit in a key corresponding to a ridge in the lock which it fits; a ward notch."}, {"wordtype": "Noun", "description": "To keep in safety; to watch; to guard; formerly, in a specific sense, to guard during the day time."}, {"wordtype": "Noun", "description": "To defend; to protect."}, {"wordtype": "Noun", "description": "To defend by walls, fortifications, etc."}, {"wordtype": "Noun", "description": "To fend off; to repel; to turn aside, as anything mischievous that approaches; -- usually followed by off."}, {"wordtype": "Verb Intransitive", "description": "To be vigilant; to keep guard."}, {"wordtype": "Verb Intransitive", "description": "To act on the defensive with a weapon."}]}