{"definitions": [{"wordtype": "Transitive Verb", "description": "To throw; hence, to send forth, or throw out, as words; to utter."}, {"wordtype": "Transitive Verb", "description": "To turn or twist out of shape; esp., to twist or bend out of a flat plane by contraction or otherwise."}, {"wordtype": "Transitive Verb", "description": "To turn aside from the true direction; to cause to bend or incline; to pervert."}, {"wordtype": "Transitive Verb", "description": "To weave; to fabricate."}, {"wordtype": "Transitive Verb", "description": "To tow or move, as a vessel, with a line, or warp, attached to a buoy, anchor, or other fixed object."}, {"wordtype": "Transitive Verb", "description": "To cast prematurely, as young; -- said of cattle, sheep, etc."}, {"wordtype": "Transitive Verb", "description": "To let the tide or other water in upon (lowlying land), for the purpose of fertilization, by a deposit of warp, or slimy substance."}, {"wordtype": "Transitive Verb", "description": "To run off the reel into hauls to be tarred, as yarns."}, {"wordtype": "Transitive Verb", "description": "To arrange (yarns) on a warp beam."}, {"wordtype": "Verb Intransitive", "description": "To turn, twist, or be twisted out of shape; esp., to be twisted or bent out of a flat plane; as, a board warps in seasoning or shrinking."}, {"wordtype": "Verb Intransitive", "description": "to turn or incline from a straight, true, or proper course; to deviate; to swerve."}, {"wordtype": "Verb Intransitive", "description": "To fly with a bending or waving motion; to turn and wave, like a flock of birds or insects."}, {"wordtype": "Verb Intransitive", "description": "To cast the young prematurely; to slink; -- said of cattle, sheep, etc."}, {"wordtype": "Verb Intransitive", "description": "To wind yarn off bobbins for forming the warp of a web; to wind a warp on a warp beam."}, {"wordtype": "Verb", "description": "The threads which are extended lengthwise in the loom, and crossed by the woof."}, {"wordtype": "Verb", "description": "A rope used in hauling or moving a vessel, usually with one end attached to an anchor, a post, or other fixed object; a towing line; a warping hawser."}, {"wordtype": "Verb", "description": "A slimy substance deposited on land by tides, etc., by which a rich alluvial soil is formed."}, {"wordtype": "Verb", "description": "A premature casting of young; -- said of cattle, sheep, etc."}, {"wordtype": "Verb", "description": "Four; esp., four herrings; a cast.  See Cast, n., 17."}, {"wordtype": "Verb", "description": "The state of being warped or twisted; as, the warp of a board."}]}