{"definitions": [{"wordtype": "Noun", "description": "That which warrants or authorizes; a commission giving authority, or justifying the doing of anything; an act, instrument, or obligation, by which one person authorizes another to do something which he has not otherwise a right to do; an act or instrument investing one with a right or authority, and thus securing him from loss or damage; commission; authority."}, {"wordtype": "Noun", "description": "A writing which authorizes a person to receive money or other thing."}, {"wordtype": "Noun", "description": "A precept issued by a magistrate authorizing an officer to make an arrest, a seizure, or a search, or do other acts incident to the administration of justice."}, {"wordtype": "Noun", "description": "An official certificate of appointment issued to an officer of lower rank than a commissioned officer.  See Warrant officer, below."}, {"wordtype": "Noun", "description": "That which vouches or insures for anything; guaranty; security."}, {"wordtype": "Noun", "description": "That which attests or proves; a voucher."}, {"wordtype": "Noun", "description": "Right; legality; allowance."}, {"wordtype": "Noun", "description": "To make secure; to give assurance against harm; to guarantee safety to; to give authority or power to do, or forbear to do, anything by which the person authorized is secured, or saved harmless, from any loss or damage by his action."}, {"wordtype": "Noun", "description": "To support by authority or proof; to justify; to maintain; to sanction; as, reason warrants it."}, {"wordtype": "Noun", "description": "To give a warrant or warranty to; to assure as if by giving a warrant to."}, {"wordtype": "Noun", "description": "To secure to, as a grantee, an estate granted; to assure."}, {"wordtype": "Noun", "description": "To secure to, as a purchaser of goods, the title to the same; to indemnify against loss."}, {"wordtype": "Noun", "description": "To secure to, as a purchaser, the quality or quantity of the goods sold, as represented.  See Warranty, n., 2."}, {"wordtype": "Noun", "description": "To assure, as a thing sold, to the purchaser; that is, to engage that the thing is what it appears, or is represented, to be, which implies a covenant to make good any defect or loss incurred by it."}]}