{"definitions": [{"wordtype": "Transitive Verb", "description": "To cleanse by ablution, or dipping or rubbing in water; to apply water or other liquid to for the purpose of cleansing; to scrub with water, etc., or as with water; as, to wash the hands or body; to wash garments; to wash sheep or wool; to wash the pavement or floor; to wash the bark of trees."}, {"wordtype": "Transitive Verb", "description": "To cover with water or any liquid; to wet; to fall on and moisten; hence, to overflow or dash against; as, waves wash the shore."}, {"wordtype": "Transitive Verb", "description": "To waste or abrade by the force of water in motion; as, heavy rains wash a road or an embankment."}, {"wordtype": "Transitive Verb", "description": "To remove by washing to take away by, or as by, the action of water; to drag or draw off as by the tide; -- often with away, off, out, etc.; as, to wash dirt from the hands."}, {"wordtype": "Transitive Verb", "description": "To cover with a thin or watery coat of color; to tint lightly and thinly."}, {"wordtype": "Transitive Verb", "description": "To overlay with a thin coat of metal; as, steel washed with silver."}, {"wordtype": "Verb Intransitive", "description": "To perform the act of ablution."}, {"wordtype": "Verb Intransitive", "description": "To clean anything by rubbing or dipping it in water; to perform the business of cleansing clothes, ore, etc., in water."}, {"wordtype": "Verb Intransitive", "description": "To bear without injury the operation of being washed; as, some calicoes do not wash."}, {"wordtype": "Verb Intransitive", "description": "To be wasted or worn away by the action of water, as by a running or overflowing stream, or by the dashing of the sea; -- said of road, a beach, etc."}, {"wordtype": "Noun", "description": "The act of washing; an ablution; a cleansing, wetting, or dashing with water; hence, a quantity, as of clothes, washed at once."}, {"wordtype": "Noun", "description": "A piece of ground washed by the action of a sea or river, or sometimes covered and sometimes left dry; the shallowest part of a river, or arm of the sea; also, a bog; a marsh; a fen; as, the washes in Lincolnshire."}, {"wordtype": "Noun", "description": "Substances collected and deposited by the action of water; as, the wash of a sewer, of a river, etc."}, {"wordtype": "Noun", "description": "Waste liquid, the refuse of food, the collection from washed dishes, etc., from a kitchen, often used as food for pigs."}, {"wordtype": "Noun", "description": "The fermented wort before the spirit is extracted."}, {"wordtype": "Noun", "description": "A mixture of dunder, molasses, water, and scummings, used in the West Indies for distillation."}, {"wordtype": "Noun", "description": "That with which anything is washed, or wetted, smeared, tinted, etc., upon the surface."}, {"wordtype": "Noun", "description": "A liquid cosmetic for the complexion."}, {"wordtype": "Noun", "description": "A liquid dentifrice."}, {"wordtype": "Noun", "description": "A liquid preparation for the hair; as, a hair wash."}, {"wordtype": "Noun", "description": "A medical preparation in a liquid form for external application; a lotion."}, {"wordtype": "Noun", "description": "A thin coat of color, esp. water color."}, {"wordtype": "Noun", "description": "A thin coat of metal laid on anything for beauty or preservation."}, {"wordtype": "Noun", "description": "The blade of an oar, or the thin part which enters the water."}, {"wordtype": "Noun", "description": "The backward current or disturbed water caused by the action of oars, or of a steamer's screw or paddles, etc."}, {"wordtype": "Noun", "description": "The flow, swash, or breaking of a body of water, as a wave; also, the sound of it."}, {"wordtype": "Noun", "description": "Ten strikes, or bushels, of oysters."}, {"wordtype": "Adjective", "description": "Washy; weak."}, {"wordtype": "Adjective", "description": "Capable of being washed without injury; washable; as, wash goods."}]}