{"definitions": [{"wordtype": "Noun", "description": "The fluid which descends from the clouds in rain, and which forms rivers, lakes, seas, etc."}, {"wordtype": "Noun", "description": "A body of water, standing or flowing; a lake, river, or other collection of water."}, {"wordtype": "Noun", "description": "Any liquid secretion, humor, or the like, resembling water; esp., the urine."}, {"wordtype": "Noun", "description": "A solution in water of a gaseous or readily volatile substance; as, ammonia water."}, {"wordtype": "Noun", "description": "The limpidity and luster of a precious stone, especially a diamond; as, a diamond of the first water, that is, perfectly pure and transparent. Hence, of the first water, that is, of the first excellence."}, {"wordtype": "Noun", "description": "A wavy, lustrous pattern or decoration such as is imparted to linen, silk, metals, etc.  See Water, v. t., 3, Damask, v. t., and Damaskeen."}, {"wordtype": "Transitive Verb", "description": "An addition to the shares representing the capital of a stock company so that the aggregate par value of the shares is increased while their value for investment is diminished, or \"diluted.\""}, {"wordtype": "Transitive Verb", "description": "To wet or supply with water; to moisten; to overflow with water; to irrigate; as, to water land; to water flowers."}, {"wordtype": "Transitive Verb", "description": "To supply with water for drink; to cause or allow to drink; as, to water cattle and horses."}, {"wordtype": "Transitive Verb", "description": "To wet and calender, as cloth, so as to impart to it a lustrous appearance in wavy lines; to diversify with wavelike lines; as, to water silk.  Cf. Water, n., 6."}, {"wordtype": "Noun", "description": "To add water to (anything), thereby extending the quantity or bulk while reducing the strength or quality; to extend; to dilute; to weaken."}, {"wordtype": "Verb Intransitive", "description": "To shed, secrete, or fill with, water or liquid matter; as, his eyes began to water."}, {"wordtype": "Verb Intransitive", "description": "To get or take in water; as, the ship put into port to water."}]}